{"countries": {"DE": {"articles": [{"title": "Mouse Model Services Market Key Manufacturers, Product Type, Application, Segmentation 2022 to 2028- Charles River Laboratories, Envigo, Taconic Biosciences", "summary": "Press release Mouse Model Services Market report helps in making informed business decisions by having complete insights of market and by making a comprehensive analysis of market segments. This recent research compilation on the Mouse Model Services Market is a versatile and future-ready analytical survey that replicates trend assessment, an in-depth assessment of market valuation and revenue-generating trends with information on profit models, Swot examination, competition spectrum, and associated vendor strategies illustrated by major players and market participants contributing by aggressively investing in the global Mouse Model Services market to secure a competitive advantage amid staggering competition, potential threats from new entrants, as well as technological innovations leading to market substitutes.", "topics": "business", "published_date": "2022-02-17 12:47:21", "link": "https://www.openpr.com/news/2555837/mouse-model-services-market-key-manufacturers-product-type", "country": "DE", "media": null, "emotion": "Fear"}, {"title": "Potassium Iodide Market to receive overwhelming hike in Revenues by 2024", "summary": "Potassium Iodide Market to receive overwhelming hike in Revenues by 2024\n\nPotassium Iodide Market\n\nhttps://www.transparencymarketresearch.com/potassium-iodide-market.html\n\nhttps://www.transparencymarketresearch.com/sample/sample.php?flag=S&rep_id=14282\n\nhttps://www.transparencymarketresearch.com/checkout.php?rep_id=14282<ype=S\n\nhttps://www.transparencymarketresearch.com/sample/sample.php?flag=covid19&rep_id=14282\n\nhttps://www.prnewswire.com/news-releases/waterproofing-admixture-market-to-expand-at-cagr-of-7-9-during-forecast-period-observes-tmr-study-301481748.", "topics": "business", "published_date": "2022-02-17 12:47:17", "link": "https://www.openpr.com/news/2555836/potassium-iodide-market-to-receive-overwhelming-hike", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217750406_g.jpg", "emotion": "Surprise"}, {"title": "Spire Global Appoints Chuck Cash as Vice President of Federal Sales", "summary": "Spire Global, Inc. (NYSE: SPIR) ('Spire' or 'the Company'), a leading global provider of space-based data, analytics, and space services, today announced it has appointed Chuck Cash as Vice President of Federal Sales. Mr. Cash will report to Kamal Arafeh, Senior Vice President of Sales and will be based in Spire's Vienna, Virginia office.\n\nSpire Global Appoints Chuck Cash as Vice President of Federal Sales (Photo: Business Wire)\n\nAn award-winning sales executive, Mr. Cash has been at the forefront of digital transformation and technological system adoptions, helping the Department of Defense (DOD) and federal customers deploy next-gen software and systems.", "topics": "finance", "published_date": "2022-02-17 12:47:00", "link": "https://www.wallstreet-online.de/nachricht/15064216-spire-global-appoints-chuck-cash-as-vice-president-of-federal-sales", "country": "DE", "media": "https://assets.wallstreet-online.de/_media/6/nachrichtenfeeds/size_645/logo-business-wire-engl.png", "emotion": "Happy"}, {"title": "Civil Aircraft Exterior Cleaning Services Market Size Growth Rate by Application 2022 Analysis, Share, Manufacturers, Growth Factor and Forecast to 2028", "summary": "Press release Civil Aircraft Exterior Cleaning Services Market, Civil Aircraft Exterior Cleaning Services Market forecast, Civil Aircraft ExteriCivil Aircraft Exterior Cleaning Services market research report has incorporated detailed insights highlighting the various aspects of the market. The Civil Aircraft Exterior Cleaning Services report concentrates on providing the client with detailed and robust insights on the macro as well as the micro indicators of growth and revenue. The report provides authentic projections and assesses the ever-evolving business trends and strategies to keep up in the Civil Aircraft Exterior Cleaning Services market domination race.", "topics": "business", "published_date": "2022-02-17 12:46:55", "link": "https://www.openpr.com/news/2555835/civil-aircraft-exterior-cleaning-services-market-size-growth", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217304338_g.jpg", "emotion": "Fear"}, {"title": "Marine Fuel Additives Market Growth Opportunity, Developments and Regional Forecast to 2017", "summary": "Marine Fuel Additives Market Growth Opportunity, Developments and Regional Forecast to 2017 - 2025\n\nhttps://www.transparencymarketresearch.com/marine-fuel-additives-market.html\n\nhttps://www.transparencymarketresearch.com/sample/sample.php?flag=B&rep_id=31862\n\nhttps://www.transparencymarketresearch.com/sample/sample.php?flag=covid19&rep_id=31862\n\nhttps://www.transparencymarketresearch.com/sample/sample.php?flag=T&rep_id=31862\n\nhttps://www.transparencymarketresearch.com/checkout.php?rep_id=31862\n\nhttps://www.", "topics": "business", "published_date": "2022-02-17 12:46:28", "link": "https://www.openpr.com/news/2555834/marine-fuel-additives-market-growth-opportunity-developments", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217746779_g.jpg", "emotion": "Fear"}, {"title": "Ecology Products Market Size, Incredible Growth Possibilities, Regional Analysis and Forecast From 2022-2028", "summary": "Press release Ecology ProductsThe \"Ecology Products Market\" Research Report details key growth drivers and opportunities to drive industry growth from 2022 to 2028. The Ecology Products market report is an intelligence report that has been meticulously conducted to investigate relevant and valuable information. The data surveyed is designed with both existing top players and upcoming competitors, growth prospects and development trends etc. The business strategies of key players and new market industries are being studied in detail.", "topics": "business", "published_date": "2022-02-17 12:45:40", "link": "https://www.openpr.com/news/2555832/ecology-products-market-size-incredible-growth", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217907673_g.jpg", "emotion": "Fear"}, {"title": "it.calibration from NTT DATA Business Solutions Now Available on SAP® Store as Part of SAP's Industry Cloud Portfolio", "summary": "Bielefeld (ots) - it.calibration delivers innovative, vertical solutions to\n\ndrive cost-effective transformation and sustainable growth for the Life Sciences\n\nindustry\n\n\n\nNTT DATA Business Solutions (https://nttdata-solutions.com/de/) announced today\n\nthat its it.calibration solution\n\n(https://store.sap.com/dcp/en/product/display-0000060261_live_v1/it.calibration)\n\nis now available on the SAP® Store (https://store.sap.com/en/) site and is part\n\nof SAP's industry cloud portfolio for the Life Sciences industry.", "topics": "finance", "published_date": "2022-02-17 12:45:07", "link": "https://www.wallstreet-online.de/nachricht/15064168-it-calibration-from-ntt-data-business-solutions-now-available-on-sap-store-as-part-of-sap-39-s-industry-cloud-portfolio", "country": "DE", "media": "https://assets.wallstreet-online.de/_media/6/nachrichtenfeeds/size_645/logo-news-aktuell.png", "emotion": "Fear"}, {"title": "Ares Management Corporation Closes $3.8 Billion Net Lease Acquisition of Capital Automotive", "summary": "Ares Management Corporation ('Ares') (NYSE: ARES) announced today that funds managed by its Alternative Credit strategy and Real Estate Group have acquired Capital Automotive LLC ('CARS') from a Brookfield private real estate fund for $3.8 billion. This latest transaction highlights Ares' increased focus on serving sponsors and companies in need of flexible net lease solutions.\n\n Headquartered in McLean, VA, CARS is a self-managed real estate company that provides highly tailored, sale-leaseback capital to automotive dealers in the U.", "topics": "finance", "published_date": "2022-02-17 12:45:00", "link": "https://www.wallstreet-online.de/nachricht/15064210-ares-management-corporation-closes-3-8-billion-net-lease-acquisition-of-capital-automotive", "country": "DE", "media": "https://assets.wallstreet-online.de/_media/6/nachrichtenfeeds/size_645/logo-business-wire-engl.png", "emotion": "Fear"}, {"title": "Iridium Communications Inc. Q4 Loss decreases, but misses estimates", "summary": "WASHINGTON (dpa-AFX) - Iridium Communications Inc. (IRDM) released Loss for fourth quarter that decreased from the same period last year but missed the Street estimates.The company's earnings came in at -$5.88 million, or -$0.04 per share. This compares with -$7.93 million, or -$0.06 per share, in last year's fourth quarter.Analysts on average had expected the company to earn -$0.03 per share, according to figures compiled by Thomson Reuters. Analysts' estimates typically exclude special items.The company's revenue for the quarter rose 6.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.finanznachrichten.de/nachrichten-2022-02/55270876-iridium-communications-inc-q4-loss-decreases-but-misses-estimates-020.htm", "country": "DE", "media": "https://fns1.de/g/fb.png", "emotion": "Sad"}, {"title": "Cloud Based Storage Market: Future Trends. Industry Size, Demands and Top Vendors Forecasts Report", "summary": "Cloud Based Storage Market: Future Trends. Industry Size, Demands and Top Vendors Forecasts Report\n\nhttps://www.deepresearchreports.com/contacts/request-sample.php?name=2132513\n\nhttps://www.deepresearchreports.com/contacts/purchase.php?name=2132513\n\nThe Cloud Based Storage market research report is proficient and top to bottom research by specialists on the current state of the industry. This statistical surveying report gives the most up to date industry information and industry future patterns, enabling you to distinguish the items and end clients driving income development and benefit.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.openpr.com/news/2555982/cloud-based-storage-market-future-trends-industry-size", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217451283_g.jpg", "emotion": "Sad"}, {"title": "Hot Drinks Packaging Market New Study Offers Insights for 2027", "summary": "Hot Drinks Packaging Market New Study Offers Insights for 2027 | Mondi, Silgan Holdings\n\nhttps://www.globalmarketmonitor.com/request.php?type=1&rid=713461\n\nhttps://www.globalmarketmonitor.com/request.php?type=3&rid=713461\n\nhttps://www.globalmarketmonitor.com/reports/673388-demand-reaction-management-system-market-report.html\n\nhttps://www.globalmarketmonitor.com/reports/673389-metering-software-market-report.html\n\nhttps://www.globalmarketmonitor.com/reports/673390-lottery-software-market-report.html\n\nhttps://www.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.openpr.com/news/2555966/hot-drinks-packaging-market-new-study-offers-insights-for-2027", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217622581_g.jpg", "emotion": "Fear"}, {"title": "ADC Therapeutics SA: ADC Therapeutics Releases its Inaugural Environmental, Social and Governance Report", "summary": "Report documents ESG accomplishments and reflects commitment to corporate responsibilityADC Therapeutics SA (NYSE: ADCT), a commercial-stage biotechnology company improving the lives of those affected by cancer with its next-generation, targeted antibody drug conjugates (ADCs) for patients with hematologic malignancies and solid tumors, today unveiled its first Environmental, Social and Governance (ESG) report detailing the Company's focus on patient care and sustainable innovation. The report marks a milestone in the Company's evolution and provides a benchmark for future progress.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.finanznachrichten.de/nachrichten-2022-02/55270763-adc-therapeutics-sa-adc-therapeutics-releases-its-inaugural-environmental-social-and-governance-report-004.htm", "country": "DE", "media": "https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220217005208r1&sid=gefi2&distro=ftp", "emotion": "Fear"}, {"title": "InsightAce Analytic Pvt. Ltd.: Regional Anesthesia Disposables Market worth $560.5 Million by 2028", "summary": "JERSEY CITY, N.J., Feb. 17, 2022 /PRNewswire/ -- The newly published report titled \"Global Regional Anesthesia Disposables Market - By Trends, Industry Competition Analysis, COVID-19 Impact Analysis, Revenue (US$ Millions) and Forecast Till 2028.\" of InsightAce Analytic Pvt. Ltd. features detailed industry insights and an extensive study on the market analysis, exploring its key factors.According to the latest market intelligence research report, the global regional anesthesia disposables market size was valued at US$ 421.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.finanznachrichten.de/nachrichten-2022-02/55270878-insightace-analytic-pvt-ltd-regional-anesthesia-disposables-market-worth-dollar-560-5-million-by-2028-exclusive-report-by-insightace-analytic-008.htm", "country": "DE", "media": "https://mma.prnewswire.com/media/1729637/InsightAce_Analytic_Logo.jpg", "emotion": "Fear"}, {"title": "Electric Vehicle Infrastructures Market Size 2022 SWOT Analysis by Key Players", "summary": "Electric Vehicle Infrastructures Market Size 2022 SWOT Analysis by Key Players - ChargePoint Inc, DBT-CEV, Chargemaster PLC, ClipperCreek, ABB Electrical Industries, Schneider Electric, Eaton\n\nIntelligence Market Report\n\nhttps://www.intelligencemarketreport.com/report-sample/423992\n\nhttps://www.intelligencemarketreport.com/send-an-enquiry/423992\n\nhttps://www.intelligencemarketreport.com/checkout/423992\n\nwww.intelligencemarketreport.com\n\nIntelligencemarketreport.com Publish a new Market Study on - \"Electric Vehicle Infrastructures Market Global Outlook and Research 2022-2028\".", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.openpr.com/news/2555386/electric-vehicle-infrastructures-market-size-2022-swot", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217834703_g.jpg", "emotion": "Fear"}, {"title": "EQS-News: Vingroup: VinFast teams up with Nas Academy to launch 'Go Boundless' challenge to inspire the electric vehicle revolution", "summary": "Vingroup VinFast teams up with Nas Academy to launch 'Go Boundless' challenge to inspire the electric vehicle revolution 17-Feb-2022 / 13:15 CET/CESTVinFast teams up with Nas Academy to launch 'Go Boundless' challenge to inspire the electric vehicle revolutionHanoi, February 17, 2022 - VinFast teams up with Nas Academy - the world's first creator school for the skills of the future - to launch the 'Go Boundless' video challenge. The contest aims to inspire the transition to electric vehicles and accelerate the global green mobility revolution.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.finanznachrichten.de/nachrichten-2022-02/55270850-eqs-news-vingroup-vinfast-teams-up-with-nas-academy-to-launch-go-boundless-challenge-to-inspire-the-electric-vehicle-revolution-023.htm", "country": "DE", "media": "https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=download2_file&code_str=a629c2b69fa7e8d20b5727d5ed32b4c5", "emotion": "Happy"}, {"title": "Southern Co. Sees Q1 Earnings Below Market, Growth In FY22 Earnings; Backs Long-term View", "summary": "ATLANTA (dpa-AFX) - Southern Co. (SO), a gas and electric utility, Thursday said it sees first-quarter adjusted earnings per share to be $0.90.On average, six analysts polled by Thomson Reuters expect earnings of $0.91 per share for the quarter. Analysts' estimates typically exclude special items.In the preceding fourth quarter, the company's adjusted earnings were $0.36.Further, for fiscal 2022, adjusted earnings guidance range is $3.50 to $3.60 per share, while last year's adjusted earnings were $3.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.finanznachrichten.de/nachrichten-2022-02/55270874-southern-co-sees-q1-earnings-below-market-growth-in-fy22-earnings-backs-long-term-view-020.htm", "country": "DE", "media": "https://fns1.de/g/fb.png", "emotion": "Fear"}], "total": 16}, "IN": {"articles": [{"title": "EV charging stations to be set up in Aurangabad by 2022-end", "summary": "The Aurangabad Municipal Corporation has decided to set up nearly 200 charging stations for electric vehicles in the city by this year-end, a senior official said here in Maharashtra. For this, the civic body will spend about Rs 5 crore of the fund granted under the 15th Finance Commission, municipal commissioner Astik Kumar Pandey told PTI on Wednesday. \"The charging stations will come up at fuel pumps, malls, bus stands, railway stations, business complexes and other locations,\" he said. \"This will encourage people to go for electric vehicles and help in reducing pollution.", "topics": "business", "published_date": "2022-02-17 12:46:16", "link": "https://www.businesstoday.in/auto/story/ev-charging-stations-to-be-set-up-in-aurangabad-by-2022-end-322922-2022-02-17", "country": "IN", "media": "https://akm-img-a-in.tosshub.com/businesstoday/images/story/202202/evs_0-sixteen_nine.png", "emotion": "Happy"}, {"title": "Sony LinkBuds arrive with new intriguing design", "summary": "New Delhi: Japanese tech giant Sony has just launched its LinkBuds TWS earbuds with a rather intriguing design.\n\nAs per GSM Arena, the unique open ring solution promises to let users wear those all day long. Additionally, the company claims a premium audio experience, lots of smarts and a decent price tag for the new gadget.\n\n\n\n\n\nThe earbuds also bring enhanced control to Spotify where users can start playing their favourite music without touching the smartphone.\n\n\n\n\n\nThe wearing experience is called 'Never Off', meaning the buds are ultra-light, while the ring driver unit allows users to effortlessly communicate with those around them while gaming, working from home, or just listening to music.", "topics": "news", "published_date": "2022-02-17 12:46:00", "link": "https://news24online.com/news/gadgets/sony-linkbuds-arrive-new-intriguing-design-fc077361", "country": "IN", "media": "https://cdn.e24bollywood.com/static_dev/static_root/media/2022/02/17/9e543b36-0455-4218-99f6-88fa7c6eb8cb.webp", "emotion": "Surprise"}, {"title": "Apple adds first Lightning iPad to ‘vintage product' list", "summary": "The fourth-generation iPad was announced in November of 2012 and it was twice as fast and had up to three times better graphics than the previous model. San Francisco: Cupertino based tech giant Apple has added the fourth-generation iPad to its absolute list of products. This iPad model was the company's first iPad to introduce the Lightning port.According to MacRumors, the fourth-generation iPad was marked internally at Apple as obsolete in November, but it had not updated its public list to make it official until today.", "topics": "tech", "published_date": "2022-02-17 12:46:00", "link": "https://www.dtnext.in/Lifestyle/Technology/2022/02/17144614/1344153/Apple-adds-first-Lightning-iPad-to-vintage-product-.vpf", "country": "IN", "media": "https://img.dtnext.in/Articles/2022/Feb/202202171446136552_Apple-adds-first-Lightning-iPad-to-vintage-product-list_SECVPF.gif", "emotion": "Surprise"}, {"title": "Pro Kabaddi League: Now-or-never time for top teams in the playoffs race", "summary": "Puneri Paltan will be hoping to get closer to a well-deserved playoff spot in the ongoing Pro Kabaddi League Season 8 with a win against Bengal Warriors on Friday. Representative Image (Image Credit: ANI) Bangalore: Pune staged a remarkable comeback after a poor start of the season, to be in the reckoning to challenge for a playoff spot, but Bengal Warriors will not be easy pushovers. The 2019 champions' ego was hurt after they dropped out of the playoff race and transformed that energy into a mauling of Tamil Thalaivas in their previous outing.", "topics": "sport", "published_date": "2022-02-17 12:46:00", "link": "https://www.dtnext.in/News/Sports/2022/02/17144615/1344154/Pro-Kabaddi-League-Nowornever-time-for-top-teams-in-.vpf", "country": "IN", "media": "https://img.dtnext.in/Articles/2022/Feb/202202171446150785_Pro-Kabaddi-League-Nowornever-time-for-top-teams-in-the_SECVPF.gif", "emotion": "Surprise"}, {"title": "The Congress of leaders of World and Traditional Religious", "summary": "Published: Feb 17,202202:46 PM by ANI On February 13, 2003, at the International Conference of Peace and Harmony, which played an important role in bringing religion, cultures and civilizations closer together, the Congress of Leaders of World and Traditional Religions was initiated in Kazakhstan. Representative Image (Image Credit: ANI) Astana: The world recognition of success and confidence in new initiatives of Kazakhstan is evidenced by the fact that the heads of the United States, Russia, France, Italy, Saudi Arabia, Egypt, Poland, Germany, heads of large international organizations sent their greetings to the Congress.", "topics": "world", "published_date": "2022-02-17 12:46:00", "link": "https://www.dtnext.in/News/World/2022/02/17144617/1344155/The-Congress-of-leaders-of-World-and-Traditional-Religious-.vpf", "country": "IN", "media": "https://img.dtnext.in/Articles/2022/Feb/202202171446166747_The-Congress-of-leaders-of-World-and-Traditional-Religious-_SECVPF.gif", "emotion": "Surprise"}, {"title": "Madhya Pradesh Board Class 12 exams begin in offline mode", "summary": "The Class 12 exams of the Madhya Pradesh Board of Secondary Education began offline on Thursday for over seven lakh students by following COVID-19-appropriate behaviour, an official said.\nDuring the last academic session, the exams were not conducted physically in the wake of the coronavirus pandemic and students were evaluated on the basis of their previous results and marks of internal tests.\nWith the COVID-19 cases now declining, the students are this time appearing for the exams at various centres set up across the state, the education board's public relations officer Mukesh Malviya told PTI.", "topics": "news", "published_date": "2022-02-17 12:46:00", "link": "https://newsd.in/madhya-pradesh-board-class-12-exams-begin-in-offline-mode", "country": "IN", "media": "https://newsd.in/wp-content/uploads/2020/07/sc-exams-cbse_d_l-1.jpg", "emotion": "Surprise"}, {"title": "Wipro appoints Jasjit Singh Kang as head of digital operations & platforms", "summary": "Pune: IT services and consulting firm Wipro has appointed Jasjit Singh Kang as the new head of Digital Operations and Platforms (DOP) of Wipro's iCORE (Integrated Cloud Infrastructure, Digital Operations, Risk and Enterprise Cyber Security Services) business. Kang joined Wipro in 2018 as part of the Alight acquisition and played a key role in integrating the business and leading the Asia Pacific operations. In his new role, he will focus on driving delivery operations and business growth and report to Nagendra Bandaru, Managing Partner - iCORE, Wipro.", "topics": "economics", "published_date": "2022-02-17 12:45:00", "link": "https://economictimes.indiatimes.com/tech/information-tech/wipro-appoints-jasjit-singh-kang-as-head-of-digital-operations-platforms/articleshow/89641779.cms", "country": "IN", "media": "https://img.etimg.com/thumb/msid-89642790,width-1070,height-580,imgsize-10918,overlay-ettech/photo.jpg", "emotion": "Fear"}, {"title": "Gold stablecoins: Should you invest in the latest crypto fad?", "summary": "iStockAccording to some experts, recent tension between Russia and Ukraine, which has increased the bullion's appeal, has also boosted the demand for such tokens.New Delhi: Gold-backed tokens, often called gold stablecoins, are the latest fad among crypto investors given their recent outperformance. Popular crypto tokens in this class are PAX Gold (PAXG) and Tether Gold (XAUT) and are part of the top 300 cryptocurrencies by market capitalization (m-cap). The m-cap of both these tokens has jumped exponentially over the last one year, with the former outperforming the latter.", "topics": "economics", "published_date": "2022-02-17 12:45:00", "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/gold-stablecoins-should-you-invest-in-the-latest-crypto-fad/articleshow/89642924.cms", "country": "IN", "media": "https://img.etimg.com/thumb/msid-89643056,width-1070,height-580,imgsize-67636,overlay-etmarkets/photo.jpg", "emotion": "Happy"}, {"title": "'Minnal Murali' fame Awan Pookot to play Manoj Bajpayee's son in ‘Pahadon Mein'", "summary": "Read Also\n\nRead Also\n\nRead Also\n\nThe entire crew of the Malayalam superhero film ‘ Minnal Murali ' is riding high on its success. The child actor Awan Pookot who played the childhood of Tovino Thomas in the film is making his Bollywood debut with the upcoming Raam Reddy directorial film ‘ Pahadon Mein ' starring actor Manoj Bajpayee in the lead role.In an exclusive conversation with ETimes, Awan Pookot's parents revealed that he will be playing the son of the Bollywood actor Manoj Bajpayee in the family-oriented film.", "topics": "entertainment", "published_date": "2022-02-17 12:45:00", "link": "https://timesofindia.indiatimes.com/entertainment/malayalam/movies/news/minnal-murali-fame-awan-pookot-to-play-manoj-bajpayees-son-in-pahadon-mein-exclusive/articleshow/89641453.cms", "country": "IN", "media": "https://static.toiimg.com/thumb/msid-89641722,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-45018/89641722.jpg", "emotion": "Fear"}, {"title": "HC seeks status report from Delhi govt on plea against mohalla clinic on park land", "summary": "The Delhi High Court on Thursday sought a status report from the Delhi government on a petition against a mohalla clinic coming up on the land of a park in the Govindpuri area of the national capital.Justice V Kameswar Rao directed Advocate Satyakam, Additional Standing Counsel for Delhi Government to file a status report within four weeks. The matter has been listed for hearing on April 21, 2022.The bench observed, \"The grievance of the petitioner is the construction of the mohalla clinic in a park.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://news.webindia123.com/news/Articles/India/20220217/3908634.html", "country": "IN", "media": "https://www.webindia123.com/shared_files/ssl/images/favicon.ico", "emotion": "Fear"}, {"title": "Rare earth prices hit record high in China", "summary": "The price of rare earth hit a record high this week after demand outpaced supply in the world's top producer China, media reports said on Thursday.Rare earth elements are produced in a handful of countries and play an essential role in technology, from microchips to speakers to X-ray imaging.The rate of rare earth oxides and combination products rocketed 99% from about this time last year, setting a new record, Caixin Global reported.This index measuring the prices in China of 21 rare earth oxides and combination products was published by the Association of China Rare Earth Industry.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://news.webindia123.com/news/Articles/World/20220217/3908620.html", "country": "IN", "media": "https://www.webindia123.com/shared_files/ssl/images/favicon.ico", "emotion": "Angry"}, {"title": "Beijing expresses concern over ban on Chinese apps in India, says it damages interests of Chinese companies", "summary": "Beijing has expressed concerns over the ban on more than 220 Chinese mobile applications in India, saying it affected the Chinese companies' interests, reported Sputnik.Chinese Commerce Ministry's spokesperson Gao Feng during a press briefing on Thursday said that the ban damages the legitimate rights and interests of Chinese companies.\"For a certain period of time, the relevant Indian departments have been taking several measures to put pressure on Chinese enterprises and related services in the country, which has seriously damaged the legitimate rights and interests of Chinese companies, with China expressing serious concern in this regard,\" said Gao.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://news.webindia123.com/news/Articles/World/20220217/3908632.html", "country": "IN", "media": "https://www.webindia123.com/shared_files/ssl/images/favicon.ico", "emotion": "Surprise"}], "total": 12}, "PK": {"articles": [{"title": "Finch to continue batting lower as Australia tinker T20 strategy", "summary": "Australia's white-ball captain and longtime opening batsman, Aaron Finch, could bat as low as five if needed, the 35-year-old said as the team experiments with strategies ahead of its Twenty20 World Cup defence on home soil this year. The T20 World Cup is set to be played in October-November, with Australia beginning their title defence with a rematch of last year's final against trans-Tasman rivals New Zealand. Finch said he will stay at the No. 3 spot for the fourth T20 match against Sri Lanka on Friday but is willing to slide further down the batting order for the final match on Sunday or even in the upcoming tours of Pakistan and Sri Lanka.", "topics": "news", "published_date": "2022-02-17 12:46:07", "link": "https://www.brecorder.com/news/40155112", "country": "PK", "media": "https://i.brecorder.com/large/2022/02/620dfd1642b6b.jpg", "emotion": "Surprise"}], "total": 1}, "SA": {"articles": [{"title": "Commercial registrations by Saudi women jump 112% over six years", "summary": "Saudi Gazette reportJEDDAH — The rate of issuing commercial records for businesswomen increased by 112% during the past six years, the Ministry of Commerce revealed.Commercial registrations by Saudi women recorded the largest ever growth rate last year. The ministry issued 139,754 records during 2021 compared to 65,912 records in 2015.The total commercial records registered reached 817,930, which is considered a significant leap.The ministry has been keen on enhancing women's participation in economic activities and has taken a number of initiatives, most notably enabling women to start a commercial activity easily, making it accessible for women to request records, trademarks, dealerships and to practice freelance professions.", "topics": "news", "published_date": "2022-02-17 12:46:00", "link": "https://saudigazette.com.sa/article/617211", "country": "SA", "media": "https://saudigazette.com.sa/uploads/images/2022/02/17/1938266.jpg", "emotion": "Surprise"}], "total": 1}, "US": {"articles": [{"title": "Olympics Live: China talks politics -- finally", "summary": "United States players gather in front of the net before the women's gold medal hockey game against Canada at the 2022 Winter Olympics, Thursday, Feb. 17, 2022, in Beijing. (AP Photo/Matt Slocum) (Associated Press)\n\nBEIJING (AP) — The Latest on the Beijing Winter Olympics:\n\n___\n\nFor two weeks and more, China's stance on questions about its politics and policies has been straightforward: It's the Olympics, and we're not talking about these things.\n\nThat changed Thursday at the Beijing organizing committee's daily news conference, three days before the end of the Games.", "topics": "gaming", "published_date": "2022-02-17 12:45:54", "link": "https://www.newser.com/article/24022d93db481439c83c040fb98efd2f/olympics-live-china-talks-politics-finally.html", "country": "US", "media": "https://img1-azrcdn.newser.com/favicon.ico", "emotion": "Fear"}, {"title": "An odd APB is out in northern Michigan: Police are on the hunt for a cabin", "summary": "NPRThursday, February 17, 2022 Update RequiredTo play audio, update browser or Flash plugin. Copyright 2022 NPR. To see more, visit https://www.npr.org. The owner of the missing cabin says it disappeared from where it stood in Coldsprings Township. Investigators note it was likely taken late last year, and was possibly put on the back of a trailer.View this story on npr.org Follow us for more stories like this CapRadio provides a trusted source of news because of you.  As a nonprofit organization, donations from people like you sustain the journalism that allows us to discover stories that are important to our audience.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "http://www.capradio.org/news/npr/story?storyid=1081387048", "country": "US", "media": "https://www.capradio.org/images/share/placeholder.png", "emotion": "Surprise"}, {"title": "Ukraine fears 'provocation' as shelling in reported in east", "summary": "© Reuters/JOINT FORCES OPERATION A view shows a damaged kindergarten in Stanytsia Luhanska By Dmitry Antonov and Pavel Polityuk MOSCOW/KYIV (Reuters) -Russian-backed rebels and Ukrainian forces traded accusations on Thursday of firing shells across the ceasefire line in eastern Ukraine, and Kyiv said the incidents looked like a \"provocation\" at a time when Russia has troops massed on the frontier. © Reuters/JOINT FORCES OPERATION A view shows a damaged kindergarten in Stanytsia Luhanska Moscow denies Western accusations it is planning to invade its neighbour and said this week it was pulling back some of the more than 100,000 troops it has sent to the area.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "http://www.reuters.com/article/us-ukraine-crisis-idUSKBN2KM107?utm_source=34553&utm_medium=partner", "country": "US", "media": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AATYMZ0.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "emotion": "Sad"}, {"title": "China rejects US trade complaint, criticizes Washington", "summary": "U.S. Trade Representative Katherine Tai on Wednesday said Beijing has \"expanded its state-led, non-market approach\" instead of carrying out market-opening promises made when it joined the World Trade Organization in 2001. That complaint is \"completely at odds with the facts,\" said a Ministry of Commerce spokesman, Gao Feng. FILE - Workers install the nameplate of the Beijing Stock Exchange on the Financial Street in Beijing, Nov. 14, 2021. China on Thursday, Feb. 17, 2022, rejected a U.S. accusation that Beijing is failing to live up to its market-opening commitments in a new round of complaints as companies wait for the two governments to restart talks on ending a tariff war.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.whec.com/national/china-rejects-us-trade-complaint-criticizes-washington/6396293", "country": "US", "media": "https://www.whec.com/apimages/ap4b7b67bb48fd4cf3840a1069535006f4.jpg", "emotion": "Sad"}, {"title": "The Future of Healthcare Cybersecurity Market Economy Size Expected a Growth of USD 15.25 Billion by 2028, According to Vantage Market Research", "summary": "Vantage Market Research, The North Star for the Working World\n\nWASHINGTON, Feb. 17, 2022 (GLOBE NEWSWIRE) -- Vantage Market Research's recent analysis of the global Healthcare Cybersecurity Market finds that growing adoption of IoT technologies and machine learning is expediting market growth. Primarily driven by increasing implementation of cloud computing, the total global Healthcare Cybersecurity Market is estimated to reach USD 15.25 Billion by 2028, up from USD 11.17 Billion in 2021, at a compound annual growth rate (CAGR) of 18.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://finance.yahoo.com/news/future-healthcare-cybersecurity-market-economy-115900694.html", "country": "US", "media": "https://s.yimg.com/uu/api/res/1.2/.1l2dRhMAr9ckt20pkfOtw--~B/aD0yNTY7dz01Mzk7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/globenewswire.com/6f880bf126de30dfde36722a390df3e0", "emotion": "Fear"}, {"title": "Regulations On Working Hours In Vietnam", "summary": "Article 105 of the Labor Code 2019 stipulated that:  \"1. Normal working hours shall not exceed 08 hours per day or 48 hours per week. 2. An employer has the right to determine the daily or weekly working hours and inform the employees accordingly. The daily working hours shall not exceed 10 hours per day and not exceed 48 hours per week where a weekly basis is applied. The State encourages employers to apply 40-hour workweeks. 3. Employers shall limit the time of exposure to harmful elements in accordance with relevant National Technical Regulations and laws.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.mondaq.com/employee-benefits-compensation/1162658/regulations-on-working-hours-in-vietnam", "country": "US", "media": "https://www.mondaq.com/images/Mondaq_Share.jpg", "emotion": "Fear"}, {"title": "Trash on roads", "summary": "To continue, please log in, or sign up for a new account. We offer one free story view per month. If you register for an account, you will get two additional story views. After those three total views, we ask that you support us with a subscription. A subscription to our digital content is so much more than just access to our valuable content. It means you're helping to support a local community institution that has, from its very start, supported the betterment of our society. Thank you very mu", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.smdailyjournal.com/opinion/letters_to_editor/trash-on-roads/article_4bf5d81c-8fa6-11ec-ad81-5301a0135fb0.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/smdailyjournal.com/content/tncms/custom/image/0b0b7a5a-a1d1-11e6-9041-cbc40d61c8f5.jpg?resize=600%2C315", "emotion": "Angry"}, {"title": "Taiwan has proposed new economic espionage laws to assist in preventing China from Stealing their Chip Technology such as TSMC's 2nm process", "summary": "TSMC is a major Apple supplier that provides advanced chips that keeps the iPhone and other Apple devices with a technological lead in performance over their competitors.  Today, Taiwan's government proposed a new law to prevent China from stealing its chip technology, amid rising concern in Taipei that Beijing is stepping up its economic espionage. Tech powerhouse Taiwan makes the majority of the world's most advanced semiconductor chips, used in everything from fighter jets to mobile phones, and the government has long worried about Chinese efforts to copy that success, including through economic espionage, poaching talent and other methods.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.patentlyapple.com/patently-apple/2022/02/taiwan-has-proposed-new-economic-espionage-laws-to-assist-in-preventing-china-from-stealing-their-chip-technology-such-as-tsm.html", "country": "US", "media": "https://www.patentlyapple.com/.a/6a0120a5580826970c0282e144a8ad200b-800wi", "emotion": "Surprise"}, {"title": "PG&E acting on natural gas price surge", "summary": "To continue, please log in, or sign up for a new account. We offer one free story view per month. If you register for an account, you will get two additional story views. After those three total views, we ask that you support us with a subscription. A subscription to our digital content is so much more than just access to our valuable content. It means you're helping to support a local community institution that has, from its very start, supported the betterment of our society. Thank you very mu", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.smdailyjournal.com/opinion/letters_to_editor/pg-e-acting-on-natural-gas-price-surge/article_4c318ba0-8fa6-11ec-b201-5fbaf026f5f1.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/smdailyjournal.com/content/tncms/custom/image/0b0b7a5a-a1d1-11e6-9041-cbc40d61c8f5.jpg?resize=600%2C315", "emotion": "Sad"}, {"title": "Curran to head Health Plan of San Mateo", "summary": "To continue, please log in, or sign up for a new account. We offer one free story view per month. If you register for an account, you will get two additional story views. After those three total views, we ask that you support us with a subscription. A subscription to our digital content is so much more than just access to our valuable content. It means you're helping to support a local community institution that has, from its very start, supported the betterment of our society. Thank you very mu", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.smdailyjournal.com/news/local/curran-to-head-health-plan-of-san-mateo/article_6804d26e-8fa7-11ec-a79c-3b0403f8f5f4.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/smdailyjournal.com/content/tncms/assets/v3/editorial/7/87/7872e3fc-8fa7-11ec-9eae-a3e185c85a77/620dcaa6c0baa.image.jpg?crop=400%2C400%2C0%2C57&resize=200%2C200&order=crop%2Cresize", "emotion": "Fear"}, {"title": "Crime, homelessness drag Newsom's approval down", "summary": "To continue, please log in, or sign up for a new account. We offer one free story view per month. If you register for an account, you will get two additional story views. After those three total views, we ask that you support us with a subscription. A subscription to our digital content is so much more than just access to our valuable content. It means you're helping to support a local community institution that has, from its very start, supported the betterment of our society. Thank you very mu", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.smdailyjournal.com/opinion/guest_perspectives/crime-homelessness-drag-newsom-s-approval-down/article_4b9cd4d8-8fa6-11ec-8a64-f7ac353630c3.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/smdailyjournal.com/content/tncms/custom/image/0b0b7a5a-a1d1-11e6-9041-cbc40d61c8f5.jpg?resize=600%2C315", "emotion": "Happy"}, {"title": "U.S. financial backing for Canada COVID-19 protests targeting American politics, too", "summary": "WASHINGTON – The Canadians who have disrupted travel and trade with the U.S. and occupied downtown Ottawa for nearly three weeks have been cheered and funded by American right-wing activists and conservative politicians who also oppose vaccine mandates and the country's liberal leader.Yet whatever impact the protests have on Canadian society, and the government of Prime Minister Justin Trudeau, experts say the outside support is really aimed at energizing conservative politics in the U.S. Midterm elections are looming, and some Republicans think standing with the protesters up north will galvanize fund-raising and voter turnout at home, these experts say.", "topics": "science", "published_date": "2022-02-17 12:45:00", "link": "https://apnews.com/539e3ad520ede8bd93e067ecd2d6a33d", "country": "US", "media": "https://bloximages.chicago2.vip.townnews.com/tribdem.com/content/tncms/assets/v3/editorial/0/c2/0c26289f-ac46-599f-850c-0e034a7b5eb4/620e20b384f0c.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize", "emotion": "Fear"}, {"title": "Tswelopele by Bonolo Kavula earns the The Norval Sovereign African Art Prize", "summary": "Made of a red shweshwe dress, reminiscent of a family heirloom, the deconstruction and reconstruction of the fabric allows a new design to emerge from the mass of dots. (The Norval Sovereign African Art Prize) The artist's work is focused on abstraction, repetition and design, to create layered and multidimensional installations. Represented by SMAC Gallery, Kavula is the first ever winner of the for contemporary artists from Africa and its diaspora.They were selected from a shortlist of 30 artists hailing from 18 countries.", "topics": "entertainment", "published_date": "2022-02-17 12:45:00", "link": "https://www.news24.com/arts/culture/tswelopele-by-bonolo-kavula-earns-the-the-norval-sovereign-african-art-prize-20220217", "country": "US", "media": "https://cdn.24.co.za/files/Cms/General/d/3093/675c948a09814451b5f1a64d1bcdaa7d.jpg", "emotion": "Sad"}, {"title": "What is 42KL? How is it teaching coding for free? And why should you pay attention?", "summary": "For the majority of us, including myself, it is difficult to get a job without a tertiary education. Getting into a university is not equally easy for everyone, more so for an elite university. Apart from curricular and extracurricular requirements, there is the tuition fee, which can be exorbitantly high for people from lower income group. Even if you manage to get past all that, there is still the challenge of learning subjects you have no interest in just to graduate with distinction which, at least in Malaysia and from personal experience, is commonly the deciding factor for a job offer.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://soyacincau.com/2022/02/17/what-is-42kl-how-is-it-teaching-coding-for-free-and-why-should-you-pay-attention", "country": "US", "media": "https://soyacincau.com/wp-content/uploads/2022/02/220217-42KL-hero-1-scaled.jpg", "emotion": "Happy"}, {"title": "Bills would shift CO2 storage liability, force carbon capture", "summary": "Country\n\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia,", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.wyomingnews.com/laramieboomerang/news/bills-would-shift-co2-storage-liability-force-carbon-capture/article_cf8f8859-dbfc-5164-9d3f-55caf1a7aee9.html", "country": "US", "media": "https://bloximages.chicago2.vip.townnews.com/wyomingnews.com/content/tncms/assets/v3/editorial/4/22/422c2e2a-11e5-5259-a565-973560615ae8/620d2bf08874a.image.jpg?crop=1662%2C873%2C0%2C187&resize=1200%2C630&order=crop%2Cresize", "emotion": "Fear"}, {"title": "For-Site's ‘Lands End' art exhibit offers an edifying journey through time", "summary": "The former Cliff House, San Francisco. Photo: Terrance Emerson / Shutterstock.com\nIt's been said that the finer the view, the worse the restaurant: too touristy and too expensive.\nBut my immigrant Chinese parents were indifferent to trendy hot spots or food fads. For special occasions, they preferred the classics, served up at Transamerica Pyramid's Carnelian Room (RIP, 2009); my husband once arrived without a suit jacket and had to borrow an oversize one from the host. Another night, we thought the blinds were down until the fog lifted and suddenly the glittering view of the city spread out below us.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://datebook.sfchronicle.com/art-exhibits/for-sites-lands-end-art-exhibit-offers-an-edifying-journey-through-time", "country": "US", "media": "https://s3.amazonaws.com/sfc-datebook-wordpress/wp-content/uploads/sites/2/2022/02/MERae8c511264227adf4c0edc2615a8d_hua0217-700x500.jpg", "emotion": "Fear"}, {"title": "‘I'm so sick of it': Rory McIlroy gives withering verdict on Saudi-backed Super Golf League", "summary": "Rory McIlroy is not a fan of the Super Golf League. (Kamran Jebreili/AP) (AP)\n\nRory McIlroy says he is 'sick of' hearing about the Saudi Arabia-backed Super Golf League and has reaffirmed his loyalty to the PGA Tour.\n\nThe 32-year-old has already stated that he would refuse to join the controversial Super League, which aims to take on and conquer the PGA Tour by stealing its highest profile golfers with lucrative financial offers. The likes of Tiger Woods and Collin Morikawa have also said they have no interest in the oil state's alternative circuit, and the PGA has indicated it would permanently ban players who appear in the Super League.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://news.yahoo.com/m-sick-rory-mcilroy-gives-120025745.html", "country": "US", "media": "https://s.yimg.com/uu/api/res/1.2/FG9g73jFVofIKqj5UZfgog--~B/aD03MjA7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_independent_635/f10abf538163e698f221aa3968de1476", "emotion": "Surprise"}, {"title": "U.S. mulls easing COVID-19 restrictions amid regional give-ups", "summary": "© Provided by Xinhua \"We want to give people a break from things like mask-wearing when these metrics are better, and then have the ability to reach for them again should things worsen,\" says Rochelle Walensky.NEW YORK, Feb. 17 (Xinhua) -- The U.S. Centers for Disease Control and Prevention (CDC) is reviewing its mask guidance, shifting its focus to COVID-19 hospitalizations as a key measure of the severity of the outbreak and a future guide for determining whether health safety protocols need to be tightened, according to CDC Director Rochelle Walensky.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.bignewsnetwork.com/news/272307874/us-mulls-easing-covid-19-restrictions-amid-regional-give-ups", "country": "US", "media": "https://cdn.bignewsnetwork.com/xih1645100292.jpg", "emotion": "Fear"}, {"title": "Arkansas' incarceration rate up as other states decline", "summary": "Data: The Marshall Project; Map: Kavya Beheraj/Axios. See an interactive version.\n\nArkansas is one of only four states that had an increase in its incarceration rate between 2010 and 2020, according to an analysis of census data by The Marshall Project.\n\nDriving the news: Gov. Asa Hutchinson supports spending $60-$100 million of the state's 2022 budget surplus to add 500 beds at the North Central Unit at Calico Rock.\n\nStay on top of the latest market trends and economic insights with Axios Markets.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://news.yahoo.com/arkansas-incarceration-rate-other-states-122008868.html", "country": "US", "media": "https://s.yimg.com/ny/api/res/1.2/h71vrm1eciaHx6BvuFycSg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xMDIz/https://s.yimg.com/uu/api/res/1.2/2V6dcmxuTV.lg5y_LggOMg--~B/aD0xMDQwO3c9MTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/axios_articles_623/149b93b421a86a908e562a02863f2cad", "emotion": "Sad"}, {"title": "Mikaela Shiffrin feels like a ‘joke' after third failure to finish in Beijing", "summary": "Mikaela Shiffrin admitted she felt like a 'joke' after failing to finish her third event at the Beijing Olympic Games on Thursday when she skied out during the slalom portion of the women's combined event.\n\nShiffrin, who has won more World Cup slalom races than any other skier in history, arrived in China targeting five medals but crashed out of both the slalom and giant-slalom and finished 18th in the women's downhill.\n\n'Right now, I just feel like a joke,' said Shriffin, who said she was baffled about her inability to finish in three events at the Games, given her previous exemplary record when it comes to getting over the line.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.yahoo.com/now/mikaela-shiffrin-feels-joke-third-120800623.html", "country": "US", "media": "https://s.yimg.com/ny/api/res/1.2/YchAotGxaoDTU4629J4tuQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/uu/api/res/1.2/sl4gVmHimIu96ZzJnGdQyQ--~B/aD00NTA4O3c9ODAxNTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/pa-sport.com/f9c0d26222b1c4745a7d6aa2aa9fdb6b", "emotion": "Happy"}, {"title": "BREAKING: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors", "summary": "The Police Service Commission has called for the immediate suspension of officers attached to the Intelligence Response Team (IRT) under the leadership of disgraced police chief, Abba Kyari. Also, the Commission has directed the Inspector General of Police, Usman Alkali Baba to suspend two other inspectors.\n\n\n\nSaharaReporters Media\n\n\n\nThe suspended commander of the Intelligence Response Team (IRT) was on Monday declared wanted by the National Drug Law Enforcement Agency (NDLEA) for selling cocaine consignment seized by IRT operatives from drug barons at the Enugu airport in January this year.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "http://saharareporters.com/2022/02/17/breaking-police-service-commission-suspends-alleged-cocaine-dealing-cop-abba-kyaris-men", "country": "US", "media": "http://saharareporters.com/sites/default/files/styles/normal_medium/public/Sequence%2002.00_11_22_03.Still009_0.jpg?itok=mF3AwcO5", "emotion": "Fear"}, {"title": "In the thriller 'Severance,' Adam Scott's humanity hangs in the (work-life) balance", "summary": "Make no mistake: That lengthy tracking shot near the top of the first episode of Severance, Apple TV+'s darkly funny, hugely imaginative corporate-thriller series, is all about swagger. The camera follows Adam Scott's Mark through the spare, white, featureless fluorescent halls of Lumon Industries as he walks to his sad little cubicle. And it's a long, circuitous walk, because the floor on which he works appears to contain very few actual workspaces, and instead seems composed almost entirely of those endless, labyrinthine hallways.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "http://www.capradio.org/news/npr/story?storyid=1080798301", "country": "US", "media": "https://media.npr.org/assets/img/2022/02/15/atv_severance_photo_010103-5f8033cc2b219ba64fe265ce893eae4c90e83896.jpg?s=6", "emotion": "Fear"}, {"title": "A New LaCroix Flavor Is Hitting Shelves In March!  KISS 106.7", "summary": "Ryan SeacrestBy Tanya RadFeb 16, 2022Photo: Getty Images North AmericaLaCroix is adding a new flavor to its line! They announced this week that the newest flavor they will be launching is Cherry Blossom! \"Our gift to you,\" the brand wrote on Instagram of the drink, described as \"a botanical twist of sweet and tart, the dazzling taste of blossoming Spring!\" \"For centuries, the cherry blossom has represented freshness, splendor and delicate beauty,\" a spokesperson said. \"The flavor of LaCroix Cherry Blossom uniquely 'blooms' with the bliss, fragrance and calming essence of this brilliant flower.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://kiisfm.iheart.com/featured/tanya-rad/content/2022-02-17-a-new-lacroix-flavor-is-hitting-shelves-in-march", "country": "US", "media": "https://i.iheart.com/v3/re/new_assets/5e6054017b9d2fc6b62712ba?ops=gravity(%22north%22),fit(740,416),quality(65)", "emotion": "Angry"}, {"title": "Stem Cell Global Market Report 2022", "summary": "New York, Feb. 17, 2022 (GLOBE NEWSWIRE) -- Reportlinker.com announces the release of the report \"Stem Cell Global Market Report 2022\" - https://www.reportlinker.com/p06229173/?utm_source=GNW The global stem cell market is expected to grow from $11.59 billion in 2021 to $12.72 billion in 2022 at a compound annual growth rate (CAGR) of 9.8%. The growth is mainly due to the companies resuming their operations and adapting to the new normal while recovering from the COVID-19 impact, which had earlier led to restrictive containment measures involving social distancing, remote working, and the closure of commercial activities that resulted in operational challenges.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.globenewswire.com/news-release/2022/02/17/2387040/0/en/Stem-Cell-Global-Market-Report-2022.html", "country": "US", "media": "https://ml.globenewswire.com/Resource/Download/3e0b82c2-02d7-44c8-b22f-561e0f321f39?size=1", "emotion": "Fear"}, {"title": "Court hears Niehaus addressed gathering breaking Covid-19 rules", "summary": "Carl Niehaus. Gallo Images / Rapport / Deon Raath. The Estcourt Magistrate's Court heard on Thursday that Mkhonto weSizwe Military Veterans Association (MKMVA) spokesperson, Carl Niehaus, addressed a large crowd outside the Estcourt Prison in violation of Covid-19 regulations.A staunch former president Jacob Zuma supporter, Niehaus, went to the prison shortly after the former president was incarcerated in July.Testifying during his trial, state witness, Brigadier Francis Bantham told the court that the MKMVA spokesperson was surrounded by a crowd when he was arrested.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.news24.com/witness/news/kzn/court-hears-niehaus-addressed-gathering-breaking-covid-19-rules-20220217", "country": "US", "media": "https://cdn.24.co.za/files/Cms/General/d/11344/fce84ab2439a4625b0bf8a79bdfd93c3.jpg", "emotion": "Fear"}, {"title": "The Blonds close out New York Fashion Week with sparkly show", "summary": "Phillipe blond shows a piece from the latest collection of The Blonds during fashion week in New York City, New York, U.S., February 16, 2022. REUTERS/Caitlin Ochs February 17, 2022\nBy Alicia Powell\nNEW YORK (Reuters) – The design duo that is The Blonds closed out New York Fashion Week on Wednesday with a runway show that sparkled with hand-sewn outfits covered in laser-cut crystals, glittering heels and jewellery. \n    The brand, which co-designer Phillipe Blond described as extremely over-the-top, sparkly and dangerous, found inspiration in vampires and the Matrix for its Fall 2022 collection.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.oann.com/the-blonds-close-out-new-york-fashion-week-with-sparkly-show", "country": "US", "media": "https://dzm0ugdauank9.cloudfront.net/wp-content/uploads/2022/02/2022-02-17T071441Z_1_LYNXMPEI1G08F_RTROPTP_0_FASHION-NEW-YORK-THE-BLONDS_1.jpg", "emotion": "Happy"}, {"title": "Experts Reveal The Paving Trend Taking Over The Landscaping Industry", "summary": "Edwards Slate and Stone, experts in bluestone pavers Melbourne wide, reveal the top landscaping trend taking yards by storm.\n\nMELBOURNE, Australia, Feb. 17, 2022 /PRNewswire/ -- There's a new landscaping trend that is taking gardens around the country by storm: crazy paving. Melbourne-based tiles and pavers experts Edwards Slate and Stone explain how crazy paving can transform the look and feel of a yard and why landscapers are loving it.\n\n\n\nOutdoor pavers can completely transform the aesthetics of an outdoor area, says Edwards Slate and Stone.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://finance.yahoo.com/news/experts-reveal-paving-trend-taking-120700445.html", "country": "US", "media": "https://s.yimg.com/uu/api/res/1.2/C8hzNT_HFWYOllXmFSdhig--~B/aD0xNjt3PTE2O2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/prnewswire.com/4ddf2682f421458b517e6f11eee46d28", "emotion": "Surprise"}, {"title": "Snow cafe in Indian Kashmir claims to be world's largest dome igloo", "summary": "Snow cafe in Indian Kashmir claims to be world's largest dome igloo\n\n\n\nGuests enjoy their time inside the Igloo Cafe at Gulmarg ski resort in the outskirts of Srinagar, India, 17 February 2022. EFE-EPA/FAROOQ KHAN\n\n\n\n\nPeople sit inside the Igloo Cafe at Gulmarg ski resort in the outskirts of Srinagar, India, 17 February 2022. EFE-EPA/FAROOQ KHAN\n\n\n\n\nA woman walks inside the Igloo Cafe at Gulmarg ski resort in the outskirts of Srinagar, India, 17 February 2022. EFE-EPA/FAROOQ KHAN\n\n\n\n\nA woman sits inside the Igloo Cafe at Gulmarg ski resort in the outskirts of Srinagar, India, 17 February 2022.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "http://www.efe.com/efe/english/destacada/snow-cafe-in-indian-kashmir-claims-to-be-world-s-largest-dome-igloo/50000261-4742261", "country": "US", "media": "https://estaticos.efe.com/efecom/recursos2/imagen.aspx?-P-2fL4Jfo8HOMjj7ghBgsx6Y5j7lQuQro9xfjtWd06V-P-2fll0jlGwEJ5EzDcZigYmb-P-2fKZGb3PDIg1kB3IDNoZjXma-P-2baWiQacj9rz2T12QgUtu0A5kFJpVQdnS3eHKUPkkbFcR", "emotion": "Surprise"}, {"title": "Women at Higher Risk of Serious Adverse Events From Cancer Therapy", "summary": "Women are at higher risk of severe adverse events (AEs) from cancer therapy than men, and this is seen with chemotherapy, targeted agents, and especially with immunotherapy. The finding comes from a review of more than 23,000 participants across 202 trials of various cancers (excluding sex-related cancers) that had been conducted over the past 40 years. The investigators found a 34% increased risk of severe AEs among women compared with men, climbing to a 49% higher risk with immunotherapy. Women had a substantially greater risk of severe symptomatic AEs, including with immune checkpoint inhibitors and targeted tyrosine kinase inhibitors, and were more likely to experience severe hematologic AEs with chemotherapy and immunotherapy.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.medscape.com/viewarticle/968687", "country": "US", "media": "https://img.medscape.com/thumbnail_library/Medscape_News.jpg", "emotion": "Fear"}, {"title": "Made in Italy: At Sigep 'The Dolce World Expo' The Best of A...", "summary": "(MENAFN- Italian Exhibition Group (IEGEXPO)) Star-awarded pastry Chefs, international trends, producers and\n\nsome of the sector's most innovative companies:\n\nfrom 12th to 16th March, in Italy, at Rimini Expo Centre,\n\nthe dolce foodservice will go on show with events and international guests\n\n\n\nRimini (Italy) 17th February 2022 - From 12th to 16th March, the city of Rimini will become the taste and excellence capital of made-in-Italy, artisan dolce products with creations by the most famous masters in the world of Italian pastry, such as Iginio Massari, the excellence of companies that have always stood out in terms of innovation and research, such as Carpigiani, Babbi and Ifi, and a series of events and talks with sector analysts and experts.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://menafn.com/1103716327/Made-in-Italy-At-Sigep-The-Dolce-World-Expo-The-Best-of-Artisan-Dolce-Foodservice", "country": "US", "media": "https://menafn.com/updates/pr/2022-02/17/pr_11803_46547e1a_image_story.jpg", "emotion": "Surprise"}, {"title": "News Stories by Tag", "summary": "February 16, 2022 Ohio University's School of Dance is delighted to mark the in-person return of the annual Winter Dance Concert, on Feb. 25 and 26 at 7:30 p.m. at the Templeton-Blackburn Memorial Auditorium. \n\n \n January 21, 2022 World-renowned pianist Kenny Broberg will perform a recital on Jan. 24 as part of Ohio University's Keyboard Artist Recital Series. \n\n \n October 21, 2021 Coming to Athens, Ohio from Venezuela can be a major culture shock, but for Alejandro Orta, one thing remains the same everywhere – the 88 keys on a piano.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.ohio.edu/news/tag/3121", "country": "US", "media": "https://news.ohio.edu/sites/ohio.edu.news/files/styles/sub_feature_story_thumbnail/public/2022-02/WinterDanceConcert_composite%20image.jpg?itok=_PF5OaTX", "emotion": "Happy"}], "total": 31}, "GB": {"articles": [{"title": "Police investigation launched into crash which left man with serious injuries on A96 near Huntly", "summary": "Police have launched an investigation after a man suffered serious injuries in a two-vehicle crash near Huntly yesterday.\nEmergency services were called to a crash involving a red Honda CR-V car and a green Fiat Ducato van on the A96 Keith to Huntly road at around 9.15am yesterday.\nThe 67-year-old male driver of the car was taken to Aberdeen Royal Infirmary with serious injuries following the collision. The 37-year-old man driving the van also suffered minor injuries, however, he did not require hospital treatment.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.pressandjournal.co.uk/fp/news/aberdeen-aberdeenshire/3966270/crash-a96-huntly-police", "country": "GB", "media": "https://www.pressandjournal.co.uk/wp-content/uploads/sites/2/2022/02/RTC_A96_KEITH_HUNTLY_16FEB2022_-9-Edit_42825088-1j9xhlld7-scaled-e1645011271381.jpg", "emotion": "Surprise"}, {"title": "Storm Dudley and Eunice London live updates", "summary": "As a subscriber, you are shown 80% less display advertising when reading our articles.\n\nThose ads you do see are predominantly from local businesses promoting local services.\n\nThese adverts enable local businesses to get in front of their target audience – the local community.\n\nIt is important that we continue to promote these adverts as our local businesses need as much support as possible during these challenging times.\n\nClose", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.surreycomet.co.uk/news/19931263.storm-dudley-eunice-london-live-updates", "country": "GB", "media": "https://www.surreycomet.co.uk/resources/images/13424563/", "emotion": "Sad"}, {"title": "How to get a Restaurant Hjem table and how much it costs at Michelin Star restaurant", "summary": "Something went wrong, please try again later.\n\nSign up for free to get the latest Northumberland news and updates delivered straight to your inbox\n\nA fine dining restaurant in Northumberland is celebrating retaining its Michelin Star a year on from winning it for the first time.\n\nRestaurant Hjem, in Wall, became the county's only Michelin starred restaurant when inspectors awarded it one in 2021.\n\nNow there are two Michelin-starred restaurants in Northumberland, as Scandinavian-inspired Hjem retain its one star and Pine, in East Wallhouses, won its first one in the 2022 Michelin Guide.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.chroniclelive.co.uk/whats-on/food-drink-news/hjem-hexham-restaurant-michelin-star-23126207", "country": "GB", "media": "https://i2-prod.chroniclelive.co.uk/incoming/article23126497.ece/ALTERNATES/s1200/0_JS185392202.jpg", "emotion": "Surprise"}, {"title": "Singapore Airshow 2022: ST Engineering debuts hospital ship concept", "summary": "14 February 2022 by Tim Ripley \n The Black Sea Fleet's improved ‘Kilo'-class submarine Rostov-na-Donu makes a northbound transit through Istanbul on 13 February en route to the Black Sea. (Cem Devrim Yaylali)\nThe Russian Navy has launched missile and naval gunnery exercises that will close off Ukraine's Black Sea coast for six days from 13 February, according to maritime safety notices posted online.\nThe start of the exercises coincides with growing tension between Moscow and Western countries over Russia's troop buildup around Ukraine.", "topics": "politics", "published_date": "2022-02-17 12:45:00", "link": "https://www.janes.com/defence-news/news-detail/singapore-airshow-2022-st-engineering-debuts-hospital-ship-concept", "country": "GB", "media": "https://www.janes.com/ResourcePackages/Janes/assets/dist/images/placeholder-16-9.jpg", "emotion": "Fear"}, {"title": "Storm Eunice LIVE: Updates as strong winds and heavy snow expected to hit North East", "summary": "12:23 Tom Beattie\n\nTips to storm-proof your home!\n\n5 tips to help storm-proof your home\n\n1 - Secure any possessions outside of the property\n\nObjects such as trampolines and garden furniture often get swept away by strong winds during a storm and have the ability to cause serious damage to buildings and people. Where possible move objects like these into garages and sheds or use ropes and heavy objects to weigh them down.\n\n2 - Check your gutters regularly\n\nGutters are often forgotten about and can soon be built up with dirt and other debris.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.chroniclelive.co.uk/news/north-east-news/weather-live-storm-eunice-updates-23113350", "country": "GB", "media": "https://i2-prod.chroniclelive.co.uk/incoming/article23122989.ece/ALTERNATES/s1200/1_JS257862857.jpg", "emotion": "Happy"}, {"title": "Health bosses to stop publishing Covid deaths by vaccine status after 'misrepresentation' of figures", "summary": "Health bosses will no longer publish Scottish Covid deaths and hospitalisations by vaccine status after data was 'inappropriately misinterpreted'.\nPublic Health Scotland (PHS) announced this week's figures on the topic will be the last for now.\nIt is understood the move comes after anti-vaccine campaigner groups were using Scotland's data to suggest the jabs are dangerous.\nAccording to the report, PHS is currently reviewing the content and frequency of reporting this information.\nIndividual vaccine schedules affect figures\nThe weekly reports usually include data on infection rates, and death and hospitalisation rates between the vaccinated and unvaccinated.", "topics": "science", "published_date": "2022-02-17 12:45:00", "link": "https://www.pressandjournal.co.uk/fp/politics/scottish-politics/3966759/health-bosses-to-stop-publishing-covid-deaths-by-vaccine-status", "country": "GB", "media": "https://www.pressandjournal.co.uk/wp-content/uploads/sites/2/2022/02/11024516d_37003773-4vbjpzj5-scaled-e1638259497523-2vdueba4j.jpg", "emotion": "Fear"}, {"title": "Sheffield Lyceum review", "summary": "Connor Curren (Christopher) and the company. Photo credit Brinkhoff-MoegenburgThe Curious Incident Of The Dog In The Night-Time is based on the best-selling book by Mark Haddon.The play had its opening night in the Lyceum Theatre in Sheffield on Tuesday and the cast, led by main character Christopher (David Breeds), gave a polished performance.Christopher's story starts with the title-giving ‘incident' with the dog - he finds his neighbour's dog killed with a garden fork and embarks on a quest to solve the murder mystery.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.thestar.co.uk/arts-and-culture/theatre-and-stage/review-the-curious-incident-of-the-dog-in-the-night-time-3572489", "country": "GB", "media": "https://www.thestar.co.uk/webimg/b25lY21zOmM3NTQ1M2FjLTAwYjEtNDY1MS1hOWU0LTJiNmYxNzBmYTU2Yzo2YmZhYjdkNS1hNDJlLTRhNTgtOWQ1ZC1iNjZiZGM0M2Q0YzE=.jpg?width=2048&enable=upscale", "emotion": "Happy"}, {"title": "OnlyFans star with 'world's fattest vagina' – Mary Magdalene before and after surgery", "summary": "Something went wrong, please try again later.\n\nSign up for the Hot Topics newsletter for hot style and sex tips\n\nThe quest to have the world's fattest vagina has been conquered, ending a question around since the dawn of time. Probably.\n\nIn the bible, Jesus is believed to have said of Mary Magdalene when facing stoning: \"He that is without sin among you, let him first cast a stone at her.\"\n\nNow, a modern interpretation would surely read: \"She who has not spent their mortgage on cosmetic surgery, remain without the world's fattest vagina.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.dailystar.co.uk/real-life/onlyfans-star-worlds-fattest-vagina-26255269", "country": "GB", "media": "https://i2-prod.mirror.co.uk/incoming/article26255832.ece/ALTERNATES/s1200/0_arymagdalena_240086294_915112019079509_6864516025607091416_n.jpg", "emotion": "Happy"}, {"title": "Moody's Corporation – Consensus Indicates Potential 29.6% Upside", "summary": "", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.directorstalkinterviews.com/moodys-corporation---consensus-indicates-potential-29.6-upside/4121053503", "country": "GB", "media": null, "emotion": "Sad"}, {"title": "Sex offender from Newcastle who is on the run was refused parole five times after assault on woman", "summary": "Something went wrong, please try again later.\n\nSign up for our regular free newsletter for court stories sent straight to your inbox\n\nA sex offender from Newcastle who is on the run after absconding from prison was refused parole five times after assaulting a woman.\n\nPaul Robson, 56, who was born in Newcastle, absconded from HMP North Sea Camp in Boston, Lincolnshire on Sunday, February 13.\n\nDescribed as a \"particular danger to women and young children\", Robson is serving a life sentence for attempted rape and indecent assault.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.chroniclelive.co.uk/news/north-east-news/paul-robson-newcastle-prison-abscond-23124404", "country": "GB", "media": "https://i2-prod.chroniclelive.co.uk/incoming/article23123485.ece/ALTERNATES/s1200/3_paul-robson.jpg", "emotion": "Sad"}, {"title": "Final days of the Zhik sale! Free Beanie with Cell™ Jacket", "summary": "Jump onboard LawConnect\n\nTake a look at the Zhik kit that will keep them warm, dry and protected\n\nWith the Sydney Hobart Yacht Race edging closer, the LawConnect crew are prepared for all conditions. Take a look at the Zhik kit that will keep them warm, dry and protected through 628 nautical miles of unpredictable ocean racing.?", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.sail-world.com/news/246334/Final-days-of-the-Zhik-sale", "country": "GB", "media": "https://www.sail-world.com/Library/Images/yy200.png", "emotion": "Happy"}, {"title": "UK's biggest family expecting new baby soon as Millie Radford tries to induce labour", "summary": "We have more newsletters\n\nThank you for subscribing!\n\nSomething went wrong, please try again later.\n\nSign up for the Hot Topics newsletter for hot style and sex tips\n\nBritain's biggest family is set to get even larger any day now as Millie Radford is due to have her second child.\n\nFollowers were shocked to discover that the 20-year-old was pregnant this week when she announced the fact on her due date.\n\nMillie, from Morecambe, Lancashire, delivered her first child, Ophelia, in September of 2020, but has kept her recent pregnancy under wraps until now.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.dailystar.co.uk/real-life/uks-biggest-family-expecting-new-26254831", "country": "GB", "media": "https://i2-prod.dailystar.co.uk/incoming/article26255040.ece/ALTERNATES/s1200/1_Millie-Radfordjpgie.jpg", "emotion": "Happy"}, {"title": "Calling all scone lovers: The farm shop serving up mouthwatering scones with a dollop of community spirit", "summary": "Caring, kind-hearted and thoughtful to a T, Michelle Clark didn't think twice about providing free meals to children during lockdown.\nFar from just a business, Kemnay Farm Shop proved to be a lifeline for the community during the dark days of the pandemic.\nNot only did Michelle's kind actions relieve some of the pressures families faced, her compassion for the community was evident as she took time to check-in on customers, bringing them comfort through her delicious homebaking.\nSociety was thrilled to catch up with Michelle and find out all about her amazing farm shop.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.pressandjournal.co.uk/fp/lifestyle/society/3953991/kemnay-farm-shop-afternoon-tea-cakes-scones-burgers-aberdeenshire", "country": "GB", "media": "https://www.pressandjournal.co.uk/wp-content/uploads/sites/2/2022/02/PGX-140222-01-009_42797406-r7artn-scaled-e1644846903860.jpg", "emotion": "Sad"}, {"title": "FERMA livestock trade fair in Poland restarts", "summary": "Conferences and events Markets & policy \n\n The trade fair will take place 25–27 February 2022 \n 17 February 2022 1 minute read By: Global Ag Media \n With a new location venue in Bydgoszcz in northwest Poland, the FERMA livestock trade fair will restart on 25–27 February 2022, after a one year pandemic-related hiatus.\nAn annual international trade fair for cattle, pigs and poultry producers and breeders in Poland, FERMA is organised by DLG Agrofood Sp., DLG's (German Agricultural Society) subsidiary in Poland.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.thepoultrysite.com/news/2022/02/ferma-livestock-trade-fair-in-poland-restarts", "country": "GB", "media": "https://cdn.globalagmedia.com/poultry%2Ffallbacks%2Fgeneral.jpeg?scale.option=fill&scale.width=1200&scale.height=630&crop.width=1200&crop.height=630&crop.y=center&crop.x=center", "emotion": "Happy"}, {"title": "Shetland space port hit by further planning delay", "summary": "A decision on whether the planned space port at Saxa Vord in Unst will get planning permission has again been delayed.\nIt had been anticipated that the application would go before the council's planning committee on Monday (21 February) after Historic Environment Scotland withdrew its objection to the development on the site of Second World War radar station at Lamba Ness.\nHowever, when the planning papers for Monday's meeting were published earlier this week the Saxa Vord item did not appear on the agenda.", "topics": "business", "published_date": "2022-02-17 12:45:00", "link": "https://www.pressandjournal.co.uk/fp/business/local/3966630/shetland-space-port-hit-by-further-planning-delay", "country": "GB", "media": "https://www.pressandjournal.co.uk/wp-content/uploads/sites/2/2022/02/Rory-rocket.jpg_38113751-1thg0ztnh-e1645096675535.jpg", "emotion": "Angry"}, {"title": "Burger King customer fuming to find worker 'secretly charged' her £11 extra", "summary": "The video will auto-play soon 8 Cancel\n\nWe have more newsletters\n\nThank you for subscribing!\n\nSomething went wrong, please try again later.\n\nSign up for the Hot Topics newsletter for hot style and sex tips\n\nA Burger King customer confronted a worker after realising she was \"secretly charged twice\" – so the employee could allegedly pocket £11.77.\n\nThe diner, from Michigan, posted a video on TikTok to expose the employee as she showed a receipt of a $34.95 (£25.71) on camera.\n\nShe ordered a few items from the fast food joint said she paid $16 (£11.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.dailystar.co.uk/real-life/burger-king-customer-fuming-find-26253959", "country": "GB", "media": "https://i2-prod.dailystar.co.uk/incoming/article26254177.ece/ALTERNATES/s1200/0_JS258037699.jpg", "emotion": "Happy"}, {"title": "Many UK exporters say Brexit trade deal not helping; more price rises loom – business live", "summary": "LIVE – Updated at 12:19 Rolling coverage of the latest economic and financial news. Consumer goods company Reckitt, which makes household brands including Dettol, Nurofen and Strepsils, is also planning to pass rising costs onto consumers. Reckitt said it had faced on average 11% cost increases during 2021, and predicted these would climb even higher this year- echoing the message from Nestlé this morning. The Berkshire-based firm, formerly known as Reckitt Benckiser, said it was absorbing some of its increased costs, but was increasing prices of some of its products.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.theguardian.com/business/live/2022/feb/17/uk-exporters-brexit-trade-stock-markets-ftse-inflation-economy-consumers-us-jobs-business-live", "country": "GB", "media": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AATYu6K.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "emotion": "Surprise"}, {"title": "MacCallum's bar fire: Crews battle blaze at city centre bar in Inverness", "summary": "Emergency services are currently at the scene of a fire at an Inverness bar.\nThree fire appliances were deployed to MacCallum's Bar on Union Street at around 9.30am following reports of a blaze at the premises.\nA police spokeswoman has confirmed they are aware of the incident and officers remain at the scene to assist with traffic management as fire crews tackle the flames. The street was cordoned off from Academy Street to Church Street for about an hour and a half with officers seen taking off police tape at around 10.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.pressandjournal.co.uk/fp/news/3966435/fire-crews-at-the-scene-of-blaze-at-city-centre-bar-in-inverness", "country": "GB", "media": "https://www.pressandjournal.co.uk/wp-content/uploads/sites/2/2022/02/PJ6_2157_42841482-2wsdlgyju-scaled-e1645095100573.jpg", "emotion": "Happy"}, {"title": "Killer still protected by 'wall of silence' decades after Highlands murder", "summary": "A village in the Highlands still holds its murder secrets, after labourer Jimmy Hassard was found beaten to death in February 1989.\nDespite interviewing about 4,000 people, along with various local and London leads and anonymous tip-offs over the years, police were unable to make an arrest.\nHis loved ones were left without answers.\nMr Hassard, 47, was on an extended holiday from London and had been staying with his sister May and her family in the village of Caol where he grew up.\nHe was drinking in the Lochaber Bar at Caol on February 17 1989.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.pressandjournal.co.uk/fp/past-times/3965208/jimmy-hassard-highlands-murder", "country": "GB", "media": "https://www.pressandjournal.co.uk/wp-content/uploads/sites/2/2022/02/James-Hassard-Murder-Nostalgia-3362oin2i-2wj6ty9ei.jpg", "emotion": "Happy"}, {"title": "Georgia state official accused of faking pregnancies to get out of work, collect pay", "summary": "ATLANTA — A state official is accused of faking multiple pregnancies and using at least one of those ruses to get out of work and be paid for the time off.A Fulton County grand jury indicted Robin Folsom, former director of external affairs for the Georgia Vocational Rehabilitation Agency, on three felony counts of making false statements. She's also charged with one count of identity fraud, also a felony.Folsom, 43, had supervised the agency's marketing and media communications.In October 2020, Folsom told human resources officials that she was pregnant, and then announced that she had given birth in May 2021, according to the state Office of the Inspector General.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.nbcnews.com/news/us-news/georgia-state-official-accused-faking-pregnancies-get-work-collect-pay-rcna16618", "country": "GB", "media": "https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png", "emotion": "Sad"}], "total": 20}, "IE": {"articles": [{"title": "Waterford News and Star — Tottenham squad weakened by January transfer business – Antonio Conte", "summary": "Thursday, February 17, 2022 \n\nBy Jonathan Veal, PA\nTottenham boss Antonio Conte claims the January transfer window was 'not easy' for his club and that his squad was technically 'weakened'.\nThe Italian was desperate for reinforcements last month but, after the club missed out on deals for Adama Traore and Luis Diaz, they only brought in Juventus pair Dejan Kulusevski and Rodrigo Bentancur on deadline day.\nOn the same day Conte saw the club's two most expensive players – Tanguy Ndombele and Giovani Lo Celso – leave on loan, with Dele Alli joining Everton on a free transfer and Bryan Gil going to Valencia less than six months after his £25million arrival from Sevilla.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://waterford-news.ie/2022/02/17/tottenham-squad-weakened-by-january-transfer-business-antonio-conte", "country": "IE", "media": "https://image.assets.pressassociation.io/v2/image/production/b346a1437c9f08cd828b9e130afad5d5Y29udGVudHNlYXJjaGFwaSwxNjQ1MTM2OTg0/2.50107484.jpg?w=640", "emotion": "Fear"}, {"title": "World's whales facing increasing threats along migration ‘superhighways'", "summary": "THE WORLD'S WHALES are facing increasing threats in their key habitats and the 'blue corridors' they use to migrate through the oceans, a report has warned.\nConservation charity WWF is calling for action by countries to safeguard the marine mammals along their 'whale superhighways'.\nWhales play key roles in maintaining the health of the oceans and fish populations, as well as carbon storage, but six of the 13 great whale species are endangered or vulnerable to extinction despite decades of protection from whaling.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.thejournal.ie/whales-face-threat-along-migration-pathway-5685596-Feb2022", "country": "IE", "media": "https://img2.thejournal.ie/article/5685596/river/?height=400&version=5685607", "emotion": "Angry"}], "total": 2}, "GH": {"articles": [{"title": "'Vals On Wheels'; Ghana Post brings new excitement in courier services", "summary": "", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.graphic.com.gh/news/general-news/vals-on-wheels-ghana-post-brings-new-excitement-in-courier-services.html", "country": "GH", "media": "https://www.graphic.com.gh/images/2022/feb/obour.png", "emotion": "Sad"}], "total": 1}, "NO": {"articles": [{"title": "US sanctions on Afghanistan could be deadlier than 20 years of war", "summary": "But if more Americans knew how many innocent civilians actually die as a result of these sanctions, would the worst of them be permitted?\nWe may be about to find out in Afghanistan. Sanctions currently imposed on the country are on track to take the lives of more civilians in the coming year than have been killed by 20 years of warfare. There's no hiding it any more.\nProjections through the winter estimate that 22.8 million people will face 'high levels of acute food insecurity.' This is 55% of Afghanistan's population, the highest ever recorded in the country.", "topics": "world", "published_date": "2022-02-17 12:45:00", "link": "https://internationalviewpoint.org/spip.php?article7526", "country": "NO", "media": "https://internationalviewpoint.org/squelettes/logo-IV-eng.png", "emotion": "Happy"}, {"title": "Profitbase søker Chief Marketing Officer (CMO)", "summary": "Responsibility\n\nYou will be the key person for marketing @ Profitbase. You will have personal ownership of the brand, the marketing strategy, and the execution. We expect you to create and execute the plan that will see Profitbase grow.\n\n\n\n\n\nYou will have ownership of:\n\nBuilding the Profitbase brand externally\n\nEmployee brand management\n\nMarketing and communication strategy\n\nEstablish and predicate brand tone of voice\n\nSocial media strategy and execution\n\nLeads generation and qualifications\n\nGenerating demand for our products\n\nScaling and improving our marketing team and processes over time.", "topics": "economics", "published_date": "2022-02-17 12:45:00", "link": "https://kampanje.com/jobb/Jobb-liste/2022/2022/profitbase-soker-chief-marketing-officer-cmo", "country": "NO", "media": "https://kampanje.com/contentassets/db07abaa61dc43f089927e8926cf0fb2/imagebhdu4.png", "emotion": "Fear"}], "total": 2}, "CA": {"articles": [{"title": "BCM Resources Corp Receives DOGM Approval for 3 New Diamond Drill Holes", "summary": "VANCOUVER, BC / ACCESSWIRE / February 17, 2022 / BCM Resources Corp is pleased to inform shareholders that the company has received approval from the Utah Department of Oil, Gas, and Mining (DOGM) for an additional 3 Diamond Drill Holes.\nPresident Dr. Sergei Diakov stated, 'We are very excited about the mineralised porphyry we are drilling, drill hole TK3a is currently at a depth of ~1,040 metres and will continue to permit depth of 1,100 metres with ~460 metres of mineralisation. We will continue aggressively drilling this mineralised porphyry with these newly permitted drill holes.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.digitaljournal.com/pr/bcm-resources-corp-receives-dogm-approval-for-3-new-diamond-drill-holes", "country": "CA", "media": "https://www.accesswire.com/img.ashx?id=689230", "emotion": "Happy"}, {"title": "Mundoro Provides Corporate and Project Portfolio Update", "summary": "Vancouver, British Columbia–(Newsfile Corp. – February 17, 2022) – Mundoro Capital Inc. (TSXV: MUN) (OTCQB: MUNMF) (www.mundoro.com) ('Mundoro' or the 'Company') is pleased to provide an update on the Company's corporate activities in Q4-2021 as well as outlook for 2022.\nTeo Dechev, CEO and President, commented: 'Mundoro grew its number of properties optioned to partners in 2021 to a record total of eight. This demonstrates (i) the continuing interest by global mining companies for Mundoro's district scale copper-gold exploration properties, and (ii) the value of Mundoro's exploration and operational experience in well-established mineral regions which remain underexplored.", "topics": "world", "published_date": "2022-02-17 12:45:00", "link": "https://www.digitaljournal.com/pr/mundoro-provides-corporate-and-project-portfolio-update", "country": "CA", "media": "https://www.newsfilecorp.com/newsinfo/114064/356", "emotion": "Happy"}], "total": 2}, "MY": {"articles": [{"title": "Kossan Q4 earnings weighed down on lower revenue from glove, TRP and clean room divisions", "summary": "PETALING JAYA: Kossan Rubber Industries Bhd's net profit for the fourth quarter ended Dec 31, 2021 fell 59.76% to RM218.67 million from RM543.42 million a year ago in tandem with the decrease in revenue from its glove, technical rubber products (TRP) and clean room divisions. The group's revenue decreased by 29.26% to RM924.56 million as compared with RM1.31 billion in Q4'20 due to lower revenue from all three divisions. For FY21, its net profit more than doubled to RM2.85 billion as compared with RM1.", "topics": "business", "published_date": "2022-02-17 12:45:00", "link": "https://www.thesundaily.my/business/kossan-q4-earnings-weighed-down-on-lower-revenue-from-glove-trp-and-clean-room-divisions-FF8869610", "country": "MY", "media": "https://www.thesundaily.my/binrepository/500x250/10c0/480d250/none/11808/YMAK/img-wisma-kossan_2182574_20220217200327.jpg", "emotion": "Fear"}, {"title": "Russia says pulling back more troops despite US claims", "summary": "MOSCOW: Russia on Thursday announced more troop pullbacks from the Ukrainian border as Washington insisted that Moscow is still building up forces for a potential invasion of its pro-Western neighbour. After previously announced withdrawals earlier this week, the United States, NATO and Ukraine all said they had seen no evidence of a pullback. The Russian defence ministry said units of the southern military district were returning to bases from Moscow-annexed Crimea and that tank units of the western military district had departed on a military train for their bases 1,000 kilometres (620 miles) away.", "topics": "world", "published_date": "2022-02-17 12:45:00", "link": "https://www.thesundaily.my/world/russia-says-pulling-back-more-troops-despite-us-claims-GF8869338", "country": "MY", "media": "https://www.thesundaily.my/binrepository/480x320/0c35/480d250/none/11808/LENK/ukraine-military-afp_2182417_20220217182317.jpg", "emotion": "Surprise"}, {"title": "US VP Harris to meet world leaders in Munich amid Ukraine tension", "summary": "WASHINGTON: US Vice President Kamala Harris will meet world leaders including Ukrainian President Volodymyr Zelenskiy in Munich this week, her highest-profile foreign trip yet, as the Biden administration tries to prevent a Russian invasion of Ukraine. Senior U.S. officials said on Wednesday they suspect Russia has increased its already heavy presence on the Ukraine border by up to 7,000 troops in the last few days, and they did not believe Russia's assertion it is withdrawing troops. Harris will arrive at the Munich Security Conference on Friday.", "topics": "world", "published_date": "2022-02-17 12:45:00", "link": "https://www.thesundaily.my/world/us-vp-harris-to-meet-world-leaders-in-munich-amid-ukraine-tension-FF8869474", "country": "MY", "media": "https://www.thesundaily.my/binrepository/480x332/0c3/480d250/none/11808/MLBH/kamala-harris-reuters_2182555_20220217191625.jpg", "emotion": "Happy"}], "total": 3}, "AE": {"articles": [{"title": "Top regional banks sound wake-up call for the traditional banking system in the new book 'Disruption'", "summary": "UAE, Dubai: Disruption, a new book from leading business publisher LID, explores the future of banking in a market where the rules have fundamentally changed. The authors - Ignacio Garcia Alves, Philippe de Backer and Juan Gonzalez - are leading thinkers from one of the world's top management consulting firms, Arthur D. Little, and draw on many years of experience and insight to outline the challenges that traditional banks face from new competitors and propose a model for change and survival.Disruption includes original interviews and stimulating insights from executives and major players from the world of banking, who openly share their views on the future of financial services and the banking sector.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.zawya.com/mena/en/press-releases/story/Top_regional_banks_sound_wakeup_call_for_the_traditional_banking_system_in_the_new_book_Disruption-ZAWYA20220217120458", "country": "AE", "media": "https://www.zawya.com/resources/img/zawya-logo-en-social.png", "emotion": "Fear"}, {"title": "Bill Gates visits Pakistan to discuss polio eradication with PM Khan", "summary": "Microsoft Corp co-founder turned philanthropist Bill Gates visited Pakistan on Thursday, meeting with Prime Minister Imran Khan to discuss polio eradication in one of the last two countries of the world where the virus is endemic.\"This is the final, and hardest, phase of the eradication effort, but by keeping up the momentum and staying vigilant, Pakistan has an opportunity to make history by ending polio for good,\" Gates said in a statement. \"Pakistan's commitment to ending polio is inspiring.\"The Bill & Melinda Gates Foundation, of which Gates is co-chair, is part of the Global Polio Eradication Initiative (GPEI), a major project between governments and international organisations.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.zawya.com/mena/en/life/story/Bill_Gates_visits_Pakistan_to_discuss_polio_eradication_with_PM_Khan-TR20220217nL4N2US1X9X1", "country": "AE", "media": "https://www.zawya.com/images/cia/zAmp/191120092453APSF.jpeg", "emotion": "Happy"}, {"title": "UAE announces 895 new COVID-19 cases in last 24 hours", "summary": "The Ministry of Health and Prevention (MoHAP) announced that it conducted 408,075 additional COVID-19 tests over the past 24 hours, using state-of-the-art medical testing equipment.In a statement, the Ministry stressed its aim to continue expanding the scope of testing nationwide to facilitate the early detection of coronavirus cases and carry out the necessary treatment. As part of its intensified testing campaign, MoHAP announced 895 new coronavirus cases, bringing the total number of recorded cases in the UAE to 872,210.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.zawya.com/mena/en/life/story/UAE_announces_895_new_COVID19_cases_in_last_24_hours-WAM20220217111711925", "country": "AE", "media": "https://www.zawya.com/images/cia/zAmp/201010063645KRPW.jpg", "emotion": "Happy"}, {"title": "Copper falls as Russia-Ukraine tensions rise", "summary": "LONDON- Copper prices fell on Thursday, with wider markets in cautious mood as reports of artillery fire in east Ukraine heightened fears of conflict between Russia and Ukraine.Stock markets edged lower, bond prices rose and the dollar strengthened slightly, making metals costlier for buyers outside the United States. Benchmark copper on the London Metal Exchange (LME) was down 0.5% at $9,939.50 a tonne at 1141 GMT having earlier fallen as much as 1.7%.Copper reached a record high of $10,747.50 a tonne in May but has since bumbled along between around $9,000 and $10,000 as the economy of China, the largest metals consumer, slowed.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.zawya.com/mena/en/story/Copper_falls_as_RussiaUkraine_tensions_rise-TR20220217nL1N2US0VDX1", "country": "AE", "media": "https://www.zawya.com/resources/img/zawya-logo-en-social.png", "emotion": "Happy"}], "total": 4}, "CN": {"articles": [{"title": "Plum blossoms in full bloom in snow", "summary": "2022-02-17 08:40:11 GMT2022-02-17 16:40:11(Beijing Time) Sina English Plum blossoms are seen in full bloom in snow at a park in Anqing, Anhui Province, Feb. 17, 2022. Blossoming plum blossoms were covered by snowflake, forming a magical winter scene. (Photo: China News Service/Wu Junqi) Plum blossoms are seen in full bloom in snow at a park in Anqing, Anhui Province, Feb. 17, 2022. Blossoming plum blossoms were covered by snowflake, forming a magical winter scene. (Photo: China News Service/Wu Junqi) Plum blossoms are seen in full bloom in snow at a park in Anqing, Anhui Province, Feb.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "http://english.sina.com/china/o/2022-02-17/detail-ikyakumy6467502.shtml", "country": "CN", "media": "http://n.sinaimg.cn/spider20220217/700/w900h600/20220217/1016-a0c681fcf5ea86bf7ceb6e15741a9f2f.jpg", "emotion": "Happy"}], "total": 1}, "ZA": {"articles": [{"title": "What's Happening at the Courthouse? A permit scam and a suspicious drug arrest", "summary": "In this week's \"What's Happening at the Courthouse\", Rameez Khan speaks to two people at the Mitchells Plain Magistrates' Court.The first person, a troubled teacher, was scammed by a colleague while the second insists the drugs found in his home were not his. TROUBLED TEACHER SCAMMED BY COLLEAGUE Looking to get her South African Council for Educators (SACE) permit, but not wanting to wait too long, this woman put her trust in a colleague who said she could get the permit within 2 days.After paying her colleague the money, she was given an excuse instead of a permit.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://kfm.co.za/articles/2022/02/17/scammed-by-a-colleague-and-a-questionable-drug-arrest", "country": "ZA", "media": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/v1645087815/jrdb5todedza8ay53lvh.jpg", "emotion": "Fear"}], "total": 1}}}