{"countries": {"DE": {"article": {"title": "ADC Therapeutics SA: ADC Therapeutics Releases its Inaugural Environmental, Social and Governance Report", "summary": "Report documents ESG accomplishments and reflects commitment to corporate responsibilityADC Therapeutics SA (NYSE: ADCT), a commercial-stage biotechnology company improving the lives of those affected by cancer with its next-generation, targeted antibody drug conjugates (ADCs) for patients with hematologic malignancies and solid tumors, today unveiled its first Environmental, Social and Governance (ESG) report detailing the Company's focus on patient care and sustainable innovation. The report marks a milestone in the Company's evolution and provides a benchmark for future progress.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.finanznachrichten.de/nachrichten-2022-02/55270763-adc-therapeutics-sa-adc-therapeutics-releases-its-inaugural-environmental-social-and-governance-report-004.htm", "country": "DE", "media": "https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220217005208r1&sid=gefi2&distro=ftp", "top_emotion": "Fear"}}, "IN": {"article": {"title": "The Congress of leaders of World and Traditional Religious", "summary": "Published: Feb 17,202202:46 PM by ANI On February 13, 2003, at the International Conference of Peace and Harmony, which played an important role in bringing religion, cultures and civilizations closer together, the Congress of Leaders of World and Traditional Religions was initiated in Kazakhstan. Representative Image (Image Credit: ANI) Astana: The world recognition of success and confidence in new initiatives of Kazakhstan is evidenced by the fact that the heads of the United States, Russia, France, Italy, Saudi Arabia, Egypt, Poland, Germany, heads of large international organizations sent their greetings to the Congress.", "topics": "world", "published_date": "2022-02-17 12:46:00", "link": "https://www.dtnext.in/News/World/2022/02/17144617/1344155/The-Congress-of-leaders-of-World-and-Traditional-Religious-.vpf", "country": "IN", "media": "https://img.dtnext.in/Articles/2022/Feb/202202171446166747_The-Congress-of-leaders-of-World-and-Traditional-Religious-_SECVPF.gif", "top_emotion": "Surprise"}}, "PK": {"article": {"title": "Finch to continue batting lower as Australia tinker T20 strategy", "summary": "Australia's white-ball captain and longtime opening batsman, Aaron Finch, could bat as low as five if needed, the 35-year-old said as the team experiments with strategies ahead of its Twenty20 World Cup defence on home soil this year. The T20 World Cup is set to be played in October-November, with Australia beginning their title defence with a rematch of last year's final against trans-Tasman rivals New Zealand. Finch said he will stay at the No. 3 spot for the fourth T20 match against Sri Lanka on Friday but is willing to slide further down the batting order for the final match on Sunday or even in the upcoming tours of Pakistan and Sri Lanka.", "topics": "news", "published_date": "2022-02-17 12:46:07", "link": "https://www.brecorder.com/news/40155112", "country": "PK", "media": "https://i.brecorder.com/large/2022/02/620dfd1642b6b.jpg", "top_emotion": "Surprise"}}, "SA": {"article": {"title": "Commercial registrations by Saudi women jump 112% over six years", "summary": "Saudi Gazette reportJEDDAH — The rate of issuing commercial records for businesswomen increased by 112% during the past six years, the Ministry of Commerce revealed.Commercial registrations by Saudi women recorded the largest ever growth rate last year. The ministry issued 139,754 records during 2021 compared to 65,912 records in 2015.The total commercial records registered reached 817,930, which is considered a significant leap.The ministry has been keen on enhancing women's participation in economic activities and has taken a number of initiatives, most notably enabling women to start a commercial activity easily, making it accessible for women to request records, trademarks, dealerships and to practice freelance professions.", "topics": "news", "published_date": "2022-02-17 12:46:00", "link": "https://saudigazette.com.sa/article/617211", "country": "SA", "media": "https://saudigazette.com.sa/uploads/images/2022/02/17/1938266.jpg", "top_emotion": "Surprise"}}, "US": {"article": {"title": "Olympics Live: China talks politics -- finally", "summary": "United States players gather in front of the net before the women's gold medal hockey game against Canada at the 2022 Winter Olympics, Thursday, Feb. 17, 2022, in Beijing. (AP Photo/Matt Slocum) (Associated Press)\n\nBEIJING (AP) — The Latest on the Beijing Winter Olympics:\n\n___\n\nFor two weeks and more, China's stance on questions about its politics and policies has been straightforward: It's the Olympics, and we're not talking about these things.\n\nThat changed Thursday at the Beijing organizing committee's daily news conference, three days before the end of the Games.", "topics": "gaming", "published_date": "2022-02-17 12:45:54", "link": "https://www.newser.com/article/24022d93db481439c83c040fb98efd2f/olympics-live-china-talks-politics-finally.html", "country": "US", "media": "https://img1-azrcdn.newser.com/favicon.ico", "top_emotion": "Fear"}}, "GB": {"article": {"title": "Police investigation launched into crash which left man with serious injuries on A96 near Huntly", "summary": "Police have launched an investigation after a man suffered serious injuries in a two-vehicle crash near Huntly yesterday.\nEmergency services were called to a crash involving a red Honda CR-V car and a green Fiat Ducato van on the A96 Keith to Huntly road at around 9.15am yesterday.\nThe 67-year-old male driver of the car was taken to Aberdeen Royal Infirmary with serious injuries following the collision. The 37-year-old man driving the van also suffered minor injuries, however, he did not require hospital treatment.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.pressandjournal.co.uk/fp/news/aberdeen-aberdeenshire/3966270/crash-a96-huntly-police", "country": "GB", "media": "https://www.pressandjournal.co.uk/wp-content/uploads/sites/2/2022/02/RTC_A96_KEITH_HUNTLY_16FEB2022_-9-Edit_42825088-1j9xhlld7-scaled-e1645011271381.jpg", "top_emotion": "Surprise"}}, "IE": {"article": {"title": "Waterford News and Star — Tottenham squad weakened by January transfer business – Antonio Conte", "summary": "Thursday, February 17, 2022 \n\nBy Jonathan Veal, PA\nTottenham boss Antonio Conte claims the January transfer window was 'not easy' for his club and that his squad was technically 'weakened'.\nThe Italian was desperate for reinforcements last month but, after the club missed out on deals for Adama Traore and Luis Diaz, they only brought in Juventus pair Dejan Kulusevski and Rodrigo Bentancur on deadline day.\nOn the same day Conte saw the club's two most expensive players – Tanguy Ndombele and Giovani Lo Celso – leave on loan, with Dele Alli joining Everton on a free transfer and Bryan Gil going to Valencia less than six months after his £25million arrival from Sevilla.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://waterford-news.ie/2022/02/17/tottenham-squad-weakened-by-january-transfer-business-antonio-conte", "country": "IE", "media": "https://image.assets.pressassociation.io/v2/image/production/b346a1437c9f08cd828b9e130afad5d5Y29udGVudHNlYXJjaGFwaSwxNjQ1MTM2OTg0/2.50107484.jpg?w=640", "top_emotion": "Fear"}}, "GH": {"article": {"title": "'Vals On Wheels'; Ghana Post brings new excitement in courier services", "summary": "", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.graphic.com.gh/news/general-news/vals-on-wheels-ghana-post-brings-new-excitement-in-courier-services.html", "country": "GH", "media": "https://www.graphic.com.gh/images/2022/feb/obour.png", "top_emotion": "Sad"}}, "NO": {"article": {"title": "Profitbase søker Chief Marketing Officer (CMO)", "summary": "Responsibility\n\nYou will be the key person for marketing @ Profitbase. You will have personal ownership of the brand, the marketing strategy, and the execution. We expect you to create and execute the plan that will see Profitbase grow.\n\n\n\n\n\nYou will have ownership of:\n\nBuilding the Profitbase brand externally\n\nEmployee brand management\n\nMarketing and communication strategy\n\nEstablish and predicate brand tone of voice\n\nSocial media strategy and execution\n\nLeads generation and qualifications\n\nGenerating demand for our products\n\nScaling and improving our marketing team and processes over time.", "topics": "economics", "published_date": "2022-02-17 12:45:00", "link": "https://kampanje.com/jobb/Jobb-liste/2022/2022/profitbase-soker-chief-marketing-officer-cmo", "country": "NO", "media": "https://kampanje.com/contentassets/db07abaa61dc43f089927e8926cf0fb2/imagebhdu4.png", "top_emotion": "Fear"}}, "CA": {"article": {"title": "BCM Resources Corp Receives DOGM Approval for 3 New Diamond Drill Holes", "summary": "VANCOUVER, BC / ACCESSWIRE / February 17, 2022 / BCM Resources Corp is pleased to inform shareholders that the company has received approval from the Utah Department of Oil, Gas, and Mining (DOGM) for an additional 3 Diamond Drill Holes.\nPresident Dr. Sergei Diakov stated, 'We are very excited about the mineralised porphyry we are drilling, drill hole TK3a is currently at a depth of ~1,040 metres and will continue to permit depth of 1,100 metres with ~460 metres of mineralisation. We will continue aggressively drilling this mineralised porphyry with these newly permitted drill holes.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.digitaljournal.com/pr/bcm-resources-corp-receives-dogm-approval-for-3-new-diamond-drill-holes", "country": "CA", "media": "https://www.accesswire.com/img.ashx?id=689230", "top_emotion": "Happy"}}, "MY": {"article": {"title": "Kossan Q4 earnings weighed down on lower revenue from glove, TRP and clean room divisions", "summary": "PETALING JAYA: Kossan Rubber Industries Bhd's net profit for the fourth quarter ended Dec 31, 2021 fell 59.76% to RM218.67 million from RM543.42 million a year ago in tandem with the decrease in revenue from its glove, technical rubber products (TRP) and clean room divisions. The group's revenue decreased by 29.26% to RM924.56 million as compared with RM1.31 billion in Q4'20 due to lower revenue from all three divisions. For FY21, its net profit more than doubled to RM2.85 billion as compared with RM1.", "topics": "business", "published_date": "2022-02-17 12:45:00", "link": "https://www.thesundaily.my/business/kossan-q4-earnings-weighed-down-on-lower-revenue-from-glove-trp-and-clean-room-divisions-FF8869610", "country": "MY", "media": "https://www.thesundaily.my/binrepository/500x250/10c0/480d250/none/11808/YMAK/img-wisma-kossan_2182574_20220217200327.jpg", "top_emotion": "Fear"}}, "AE": {"article": {"title": "Top regional banks sound wake-up call for the traditional banking system in the new book 'Disruption'", "summary": "UAE, Dubai: Disruption, a new book from leading business publisher LID, explores the future of banking in a market where the rules have fundamentally changed. The authors - Ignacio Garcia Alves, Philippe de Backer and Juan Gonzalez - are leading thinkers from one of the world's top management consulting firms, Arthur D. Little, and draw on many years of experience and insight to outline the challenges that traditional banks face from new competitors and propose a model for change and survival.Disruption includes original interviews and stimulating insights from executives and major players from the world of banking, who openly share their views on the future of financial services and the banking sector.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://www.zawya.com/mena/en/press-releases/story/Top_regional_banks_sound_wakeup_call_for_the_traditional_banking_system_in_the_new_book_Disruption-ZAWYA20220217120458", "country": "AE", "media": "https://www.zawya.com/resources/img/zawya-logo-en-social.png", "top_emotion": "Fear"}}, "CN": {"article": {"title": "Plum blossoms in full bloom in snow", "summary": "2022-02-17 08:40:11 GMT2022-02-17 16:40:11(Beijing Time) Sina English Plum blossoms are seen in full bloom in snow at a park in Anqing, Anhui Province, Feb. 17, 2022. Blossoming plum blossoms were covered by snowflake, forming a magical winter scene. (Photo: China News Service/Wu Junqi) Plum blossoms are seen in full bloom in snow at a park in Anqing, Anhui Province, Feb. 17, 2022. Blossoming plum blossoms were covered by snowflake, forming a magical winter scene. (Photo: China News Service/Wu Junqi) Plum blossoms are seen in full bloom in snow at a park in Anqing, Anhui Province, Feb.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "http://english.sina.com/china/o/2022-02-17/detail-ikyakumy6467502.shtml", "country": "CN", "media": "http://n.sinaimg.cn/spider20220217/700/w900h600/20220217/1016-a0c681fcf5ea86bf7ceb6e15741a9f2f.jpg", "top_emotion": "Happy"}}, "ZA": {"article": {"title": "What's Happening at the Courthouse? A permit scam and a suspicious drug arrest", "summary": "In this week's \"What's Happening at the Courthouse\", Rameez Khan speaks to two people at the Mitchells Plain Magistrates' Court.The first person, a troubled teacher, was scammed by a colleague while the second insists the drugs found in his home were not his. TROUBLED TEACHER SCAMMED BY COLLEAGUE Looking to get her South African Council for Educators (SACE) permit, but not wanting to wait too long, this woman put her trust in a colleague who said she could get the permit within 2 days.After paying her colleague the money, she was given an excuse instead of a permit.", "topics": "news", "published_date": "2022-02-17 12:45:00", "link": "https://kfm.co.za/articles/2022/02/17/scammed-by-a-colleague-and-a-questionable-drug-arrest", "country": "ZA", "media": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/v1645087815/jrdb5todedza8ay53lvh.jpg", "top_emotion": "Fear"}}}}