{"countries": {"US": {"articles": [{"_id": "68f54e0f4986a1e87a1e04759af72af6", "title": "20 Tweets About 'Buffy The Vampire Slayer' That Prove It Still Has Fans In A Chokehold", "summary": "Get all the best moments in pop culture & entertainment delivered to your inbox.", "topics": "entertainment", "published_date": "2022-02-24 05:46:03", "link": "https://www.buzzfeed.com/jessg/buffy-the-vampire-slayer-anniversary-tweets", "country": "US", "media": "https://img.buzzfeed.com/buzzfeed-static/static/2022-02/22/1/enhanced/67871b422d9e/original-7190-1645493252-3.jpg?crop=1245:652;5,0%26downsize=1250:*"}, {"_id": "1170b16c5a4c225c55b21b178f195598", "title": "Hyundai Among the Leaders in Safety with Eight 2022 IIHS TOP SAFETY PICK and TOP SAFETY PICK+ Awards", "summary": "FOUNTAIN VALLEY, Calif., Feb. 24, 2022 /PRNewswire/ -- Hyundai Motor America is one of the leaders in vehicle safety, earning eight 2022 Insurance Institute for Highway Safety (IIHS) TOP SAFETY PICK and TOP SAFETY PICK+ awards. Hyundai's current SUV products each hold a TSP or TSP+ rating designation when equipped with specific headlights and for the 2022 Santa Fe, built after July 2021. Additionally, of the eight Hyundai products awarded thus far for 2022, five include eco-friendly powertrain options.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.wfmz.com/news/pr_newswire/pr_newswire_automotive/hyundai-among-the-leaders-in-safety-with-eight-2022-iihs-top-safety-pick-and-top/article_3c55dd97-913a-5c10-8dd1-239d824b08d2.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/wfmz.com/content/tncms/assets/v3/editorial/b/eb/bebf9fcf-aa05-5d73-82d7-db8234f51d7d/6217136517a59.image.jpg?crop=1710%2C898%2C0%2C42&resize=1200%2C630&order=crop%2Cresize"}, {"_id": "a739c045a7950b90f7f5f305f6bccea8", "title": "Asian stocks plunge after Putin announces action in Ukraine", "summary": "BEIJING (AP) — Asian stock markets plunged and oil prices surged to nearly $100 a barrel Thursday after President Vladimir Putin announced Russian military action in Ukraine.\n\nMarket benchmarks in Tokyo and Seoul fell 2%. Hong Kong and Sydney lost more than 3%.\n\nOil prices jumped more than $4 on anxiety about possible disruptions of Russian supplies. The ruble fell 5% against the dollar.\n\nWall Street futures fell. The future for Germany's benchmark DAX index lost more than 4% and London's FTSE 100 was off 2.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://news.yahoo.com/asian-stocks-plunge-putin-announces-051520094.html", "country": "US", "media": "https://s.yimg.com/ny/api/res/1.2/R5L6itE87O_c0IbA0.rkow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/d6q.VHIjzEMiqb9WaT19Ug--~B/aD0zMzk4O3c9NTA5NzthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/1f41abf39ab1a878a4aa41ea014b249c"}, {"_id": "129a7086485f959e7f86abf61cecfc59", "title": "Europe warns airlines not to fly over or near Ukraine", "summary": "The Hill\n\nRussian President Vladimir Putin said in a speech announcing a military operation in Ukraine that countries that interfere with Russian actions will face \"consequences you have never seen,\" The Associated Press reported. Russia almost immediately launched an invasion into the country.Putin says the operation is to protect citizens from Ukraine aggression and to demilitarize the country, a continuation of the disinformation about which western...", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://news.yahoo.com/europe-warns-airlines-not-fly-045143652.html", "country": "US", "media": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png"}, {"_id": "01f88e1acf0043201cf72b05e0cd12c2", "title": "The Latest: UN chief warns Russian actions could devastate", "summary": "The Latest: UN chief warns Russian actions could devastate\n\nThe latest on the Russia-Ukraine crisis:\n\n___\n\nUNITED NATIONS — U.N. Secretary-General Antonio Guterres says Russia's attack on Ukraine — as he appealed for President Vladimir Putin to stop his troops — was 'the saddest moment' of his five-year tenure.\n\nThe U.N. chief opened the emergency Security Council meeting late Wednesday by urgently appealing to Putin: 'In the name of humanity, bring your troops back to Russia.\"\n\nBut during the meeting, Putin announced that he was launching a 'special military operation' in eastern Ukraine.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://isp.netscape.com/news/world/story/0001/20220224/08ae29f98152817b1b503b4b957c63f1", "country": "US", "media": "https://o.aolcdn.com/pslca/fotosrch/2/a16537837f91494d8558e558ae94b18f.jpg"}]}, "DE": {"articles": [{"_id": "dbbace79f3ba267f603fc5afb1d49eb2", "title": "WBG Power Devices Market New Study Offers Insights for 2027", "summary": "WBG Power Devices Market New Study Offers Insights for 2027 | Mitsubishi, STMicro\n\nhttps://www.globalmarketmonitor.com/request.php?type=1&rid=702939\n\nhttps://www.globalmarketmonitor.com/request.php?type=3&rid=702939\n\nhttps://www.globalmarketmonitor.com/reports/328115-vacuum-solenoid-market-report.html\n\nhttps://www.globalmarketmonitor.com/reports/328116-fluspirilenes-market-report.html\n\nhttps://www.globalmarketmonitor.com/reports/328117-outdoor-furniture-market-report.html\n\nhttps://www.globalmarketmonitor.", "topics": "business", "published_date": "2022-02-24 05:46:03", "link": "https://www.openpr.com/news/2562029/wbg-power-devices-market-new-study-offers-insights-for-2027", "country": "DE", "media": "https://cdn.openpr.com/V/2/V224419841_g.jpg"}]}, "GB": {"articles": [{"_id": "12eea56e07140d745f1062d1e30eba58", "title": "Bahrain removes testing requirements for British travellers", "summary": "Bahrain is ready and welcoming Brits back once again.\n\nFrom this week, UK travellers entering Bahrain regardless of the vaccination status, no longer need to conduct a PCR test on arrival at Bahrain International Airport.\n\nADVERTISEMENT\n\nPrecautionary quarantine requirements for all passengers arriving in the kingdom have also been removed.\n\nKnown for its glorious white-sand beaches, crystal-clear waters, the F1 and top-class dining and hotel facilities, Bahrain is the perfect destination for travellers seeking a place to 'detach and relax,' a statement confirming the news said.", "topics": "news", "published_date": "2022-02-24 05:45:59", "link": "https://www.breakingtravelnews.com/news/article/bahrain-removes-testing-requirements-for-british-travellers", "country": "GB", "media": "https://www.breakingtravelnews.com/images/sized/images/uploads/tourism/Bahrain_-_NS_6_2019-700x406.jpg"}, {"_id": "2651243a6e9f1af2c5fa478f73cf2d4b", "title": "Legal requirement to isolate with Covid-19 comes to an end in England", "summary": "Something went wrong, please try again later.\n\nNever miss breaking news by signing up to our free email updates\n\nAll coronavirus laws in England including the legal requirement for people who test positive to isolate will end on Thursday.\n\nOn Monday, Prime Minister Boris Johnson set out the strategy for 'living with Covid', which also includes plans to scrap free universal testing in April.\n\nThose who receive a positive Covid-19 test will still be advised to stay at home for at least five days, but from today will not be obliged to under law.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.birminghammail.co.uk/news/uk-news/legal-requirement-isolate-covid-19-23200408", "country": "GB", "media": "https://i2-prod.walesonline.co.uk/incoming/article23157864.ece/ALTERNATES/s1200/1_PA-65415113.jpg"}, {"_id": "02293120af8610553aa5a1a4957632ac", "title": "Joe Biden: The world will hold Russia accountable for Ukraine incursion", "summary": "Something went wrong, please try again later.\n\nSubscribe today to get the latest headlines straight to your inbox with our free email updates\n\nUS President Joe Biden has denounced Russia's decision to conduct a military operation in Ukraine as an 'unprovoked and unjustified attack', declaring 'the world will hold Russia accountable'.\n\nRussian President Vladimir Putin announced the action during a televised address early on Thursday morning, saying the move was a response to threats from Ukraine.\n\nMr Biden said in a statement: 'The prayers of the entire world are with the people of Ukraine tonight as they suffer an unprovoked and unjustified attack by Russian military forces.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.coventrytelegraph.net/news/uk-world-news/biden-world-hold-russia-accountable-23200420", "country": "GB", "media": "https://i2-prod.walesonline.co.uk/incoming/article23081644.ece/ALTERNATES/s1200/1_biden-1.jpg"}, {"_id": "e8c07f910af622df3c60d23e113cacb7", "title": "It's Freedom Day – but will our fear ever lift?", "summary": "The most obvious popular concern to address is of catching Covid and getting sick, or making others dangerously ill. Almost 19 million cases of Covid have been reported in Britain since March 2020, with many more going unrecorded. But for millions, Covid remains a terrifying unknown. 'It just scares me,' says Aman Kaur Dhut, a 22-year-old graduate from Leamington Spa. 'What if I go to a public place and get sick; what if I give it to my dad, who is really vulnerable? Is it worth the risk? It's such an overwhelming feeling.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.telegraph.co.uk/news/2022/02/24/freedom-day-will-fear-ever-lift", "country": "GB", "media": "https://www.telegraph.co.uk/content/dam/news/2022/02/23/2302_FREEDOM_DIGI_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpg?impolicy=logo-overlay"}]}, "PA": {"articles": [{"_id": "5e43a6db9ec92a199eff8e19afacd0d1", "title": "Stress and poker", "summary": "#1\n\n\n\n\nFebruary 22nd, 2022, 8:55 AM\n\n\n\n\n\n \n\n\n\n\nStress and poker\n \n\nHow to you deal with the stress that comes with the swings in poker? I get so stressed out when playing poker. When i run good its awesome but it really hurts when i take a big loss. The stress really geta to me too. It gets hard to sleep and sometimes i dont eat. Does anyone have any tips for dealing with the stress that comes with poker?\n\n\n__________________\n\n\n\n\n\n\n\nMulti-Quote\n\n\n\n\n\nQuote & Reply\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n#2\n\n\n\n\nFebruary 22nd, 2022, 9:05 AM\n\n\n\n\n\n \n\n\n\n\n\nI wouldn't say that I feel stress during the game, it's probably more that the wrong decision-making is pressing.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.cardschat.com/forum/general-poker-13/stress-poker-499938", "country": "PA", "media": "https://www.cardschat.com/images/cc.png"}]}, "AE": {"articles": [{"_id": "225b94c7cc75acaf39182e1d0d40086b", "title": "Death toll in Brazil's Petropolis mudslides, floods hits 198", "summary": "WAM 24th February 2022, 19:00 GMT+11RIO DE JANEIRO, 24th February, 2022 (WAM) -- The death toll following the storms that assailed the city of Petropolis, in the highland region north of Rio de Janeiro, now stands at 198, reported Agencia Brasil.Reported among fatalities were 119 women and 79 men. Of these, 37 were underage.By 7:40 am February 23, 181 victims had been identified, and 170 had been released for funeral homes. The police experts are also testing body fragments for the DNA. Thus far, 69 missing individuals have been reported.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.wam.ae/en/details/1395303023962", "country": "AE", "media": "https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg"}]}, "JP": {"articles": [{"_id": "b71563b1f2ab6e32a679965f399655bd", "title": "Death toll from flooding and landslides tops 200 in Brazil's Petropolis", "summary": "More than 200 people are confirmed dead in the flooding and massive landslides caused by last week's heavy rains in Petropolis, near Brazil's Rio de Janeiro. Rescue workers are continuing their search for those still missing. The local government said on Wednesday that it had confirmed 204 deaths from the rains that hit the city on February 15. Around 50 others remain unaccounted for. Petropolis is a highland resort area where many homes are built on mountainsides. It is said that almost 20 percent of the city is located in areas at high risk of landslides or other natural hazards.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www3.nhk.or.jp/nhkworld/en/news/20220224_13", "country": "JP", "media": "https://www3.nhk.or.jp/nhkworld/common/sns_images/nhkworld_1200x630.png"}, {"_id": "c40712a057688600c0ceb4ef603ef5c6", "title": "45 killed in 3 months in accidents while clearing snow in Japan", "summary": "Snow-clearing accidents killed 45 people in the three months through January, emergency authorities said Thursday, as Japan's snowy regions have been hit by heavier falls than usual this winter.\nMany of the victims in 10 prefectures including Aomori died after being buried by snow falling from the roofs of their homes, the Fire and Disaster Management Agency said.\n\n A man removes snow in Sapporo, Hokkaido, northern Japan, on Feb. 23, 2022, after heavy snow. (Kyodo) ==Kyodo\n\nAomori Prefecture in northeastern Japan saw the largest number of deaths at 11, followed by Hokkaido in the country's north at 10.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://english.kyodonews.net/news/2022/02/81d226d9475f-45-killed-in-3-months-in-accidents-while-clearing-snow-in-japan.html", "country": "JP", "media": "https://img.kyodonews.net/english/public/images/posts/e951d33b612659ed396435ac5122287d/photo_l.jpg"}]}, "LK": {"articles": [{"_id": "54033fb6c2b993c88887e8b9e2a09f6d", "title": "Putin announces military operation in Ukraine", "summary": "Russian President Vladimir Putin announced a military operation in the Donbas region of eastern Ukraine early Thursday local time.\n\nIn the address, broadcast on Russian national television, Putin urged Ukrainian forces to lay down their arms and go home, saying all responsibility for possible bloodshed will be entirely on the conscience of the Ukrainian government.\n\nBut he added: \"Our plans are not to occupy Ukraine, we do not plan to impose ourselves on anyone.\"\n\nPutin's speech came as concerns mounted of an imminent full-scale Russian invasion.", "topics": "world", "published_date": "2022-02-24 05:45:00", "link": "http://www.dailynews.lk/2022/02/24/world/273394/putin-announces-military-operation-ukraine", "country": "LK", "media": "https://www.dailynews.lk/sites/default/files/styles/node-detail/public/news/2022/02/24/Putin%20announces%20military%20operation%20in%20Ukraine.PNG?itok=zbopT_8a"}]}, "CA": {"articles": [{"_id": "f219fb0c1c62b2a5510162318624b09f", "title": "Suzuki scores two, Montrembeault grabs first shutout; Canadiens crush Sabres", "summary": "Suzuki scores two, Montrembeault grabs first shutout; Canadiens crush Sabres\n\nBuffalo Sabres left wing Brandon Biro (46) and Montreal Canadiens goalie Sam Montembeault watch the puck during first period NHL hockey action in Montreal on Wednesday, Feb. 23, 2022. THE CANADIAN PRESS/Peter McCabe\n\nOriginal Publication Date February 23, 2022 - 7:36 PM\n\nMONTREAL - Confidence couldn't possibly be higher in the Montreal Canadiens locker room.\n\nSeven games into Martin Louis' tenure as interim head coach, the Canadiens have found their first winning streak of the season.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://infotel.ca/newsitem/hkn-sabres-canadiens/cp1523306912", "country": "CA", "media": "https://infotel.ca/favicon.ico?v=1"}, {"_id": "55c034bbddc393409a783698a641343f", "title": "Syria says Israeli strike near Damascus kills 3 soldiers", "summary": "Syria says Israeli strike near Damascus kills 3 soldiers\n\nDAMASCUS, Syria (AP) — Israel fired several missiles toward Syrian military positions near the capital Damascus early Thursday, killing three soldiers and causing material damage, state media reported.\n\nState TV quoted an unnamed Syrian military official as saying that most of the Israeli missiles were shot down by Syrian air defenses. It added that some military positions near Damascus were hit, leaving three soldiers dead.\n\nThe attack came a day after Syria said that several missiles from northern Israel struck areas around the southern town of Quneitra, causing only material damage.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://infotel.ca/newsitem/ml-syria-israel/cp406767519", "country": "CA", "media": "https://infotel.ca/favicon.ico?v=1"}, {"_id": "6032ece7f7b2c7e9e2ed379cafba6f80", "title": "Phosphate Fertilizer Market Worth, Size Analysis, Industry Outlook, and Region Forecast, 2021-2027", "summary": "The global Phosphate Fertilizer Market is forecast to reach USD 76.23 Billion by 2027, according to a new report by Reports and Data. The growing demand from emerging markets will help the Phosphate Fertilizer Market to maintain a stable growth rate over the forecast period. The adoption of modern farming techniques will provide strength to the Phosphate Fertilizer Market and will also help in its growth over the forecasted period.\nDue to the pandemic, there are high chances of disruption in the supply chain and influence ingredients and raw material supplies.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.digitaljournal.com/pr/phosphate-fertilizer-market-worth-size-analysis-industry-outlook-and-region-forecast-2021-2027-reports-and-data", "country": "CA", "media": "https://secure.gravatar.com/avatar/96305a6c756cd9f5e9224f6a36ec4a08?s=150&d=blank&r=pg"}, {"_id": "b811215a83e49ac07e2043e789b03152", "title": "B.C. RCMP called to Nunavut to assist in extreme underwater recovery", "summary": "Penticton News B.C. RCMP called to Nunavut to assist in extreme underwater recovery\n\nThe B.C. RCMP's Underwater Recovery Team was called up to Nunavut to help with a recovery operation. Image Credit: SUBMITTED/B.C. RCMP\n\nThe B.C. RCMP Underwater Recovery Team helped their counterparts in Nunavut recover a body in extremely challenging circumstances.\n\nThe victim was building an ice road over the Arctic Ocean in a bulldozer when the ice broke from underneath and he became submerged along with the machine, according to an RCMP press release.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://infotel.ca/newsitem/bc-rcmp-called-to-nunavut-to-assist-in-extreme-underwater-recovery/it89125", "country": "CA", "media": "https://infotel.ca/news/medialibrary/image/hd-mediaitemid89125-4054.jpg"}, {"_id": "6409da06d47c29313b12f7cbbcb40a7a", "title": "Two S. Korean authors win prizes at the 2022 BolognaRagazzi AwardsNews", "summary": "Two South Korean authors have won prizes at this year's BolognaRagazzi Awards.Announced Wednesday, Lee Suzy's \"Summer\" won a Special Mention in the Fiction category, marking her second-consecutive win at the event.Another Korean piece, \"Father's big hands\" by Choi Deok-kyu also received a Special Mention in the Non-Fiction category.Dubbed as the 'Nobel Prize of picture books', the annual awards honors the world's finest illustrated children's books.The prize-giving ceremony will take place at the Bologna Children's Book Fair on March 21st.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "http://www.arirang.com/news/News_View.asp?nseq=294050", "country": "CA", "media": "http://www.arirang.com/arirang_blue.png"}]}, "IN": {"articles": [{"_id": "a43b3ba47a8e4f04d8736e91dcd9f691", "title": "Kanhaiya Ram vs The State Of Bihar on 23 February, 2022", "summary": "Try out our Premium Member services: Virtual Legal Assistant, Query Alert Service and an ad-free experience. Free for one month and pay only if you like it. Patna High Court - Orders\nKanhaiya Ram vs The State Of Bihar on 23 February, 2022 IN THE HIGH COURT OF JUDICATURE AT PATNA\n CRIMINAL MISCELLANEOUS No.272 of 2022\n Arising Out of PS. Case No.-255 Year-2017 Thana- TAJPUR District- Samastipur\n ======================================================\n KANHAIYA RAM SON OF SHIVAM RAM R/O VILLAGE-\n BHIKHANPUR SALEMPUR, P.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://indiankanoon.org/doc/108202752", "country": "IN", "media": ""}, {"_id": "7005d43d1c9b5e6d87b8b741270722b8", "title": "Lexus' EV supercar to launch by 2030", "summary": "Lexus is developing an electric supercar that will serve as a spiritual successor to the LFA, and is expected to launch by 2030. Originally shown in concept form as part of the shock unveiling of 15 new Toyota and Lexus EV concepts, the new model will be one of the EVs launched by Lexus as it phases out combustion engines. The brand has now revealed a full suite of images, giving a good look at the futuristic Rimac Nevera rival from all angles.Lexus will sell only electric cars after 2035Supercar could be the first EV with solid state batteriesLexus' first EV, a crossover, will launch this yearLexus will offer an EV in all segments by 2030, by which point it will sell only electric cars in China, Europe and North America, and in 2035, it will end ICE car sales altogether.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.autocarindia.com/car-news/lexus-ev-supercar-to-launch-by-2030-423552", "country": "IN", "media": "https://cdni.autocarindia.com/ExtraImages/20220217090939_Lexus_BEV_Sport_Concept_2021_1600_02.jpg"}, {"_id": "8d714eea90c7a302d407cc3e00a726a4", "title": "Ram Autar Paswan vs State Of Bihar on 23 February, 2022", "summary": "Try out our Premium Member services: Virtual Legal Assistant, Query Alert Service and an ad-free experience. Free for one month and pay only if you like it. Patna High Court - Orders\nRam Autar Paswan vs State Of Bihar on 23 February, 2022 IN THE HIGH COURT OF JUDICATURE AT PATNA\n CRIMINAL APPEAL (DB) No.203 of 1995\n======================================================\nSHIBESHWAR DAS\n\n ... ... Appellant/s\n Versus\nSTATE OF BIHAR\n\n ... ... Respondent/s\n======================================================\n with\n CRIMINAL APPEAL (DB) No.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://indiankanoon.org/doc/89875995", "country": "IN", "media": ""}, {"_id": "a8bda9ab4a7455952a97dcae5aac612f", "title": "‘Bheeshma Parvam' Trailer: Mammootty starrer gives a glimpse of late actors Nedumudi Venu and KPAC Lalitha", "summary": "Left ArrowRight ArrowKPAC Lalitha is a name that stands synonymous with the word artist. Born as Maheshwari Amma, she ventured into acting at the age of 10, through plays. After a successful stint in theatre, she shifted focus to movies. She debuted in the movie industry in 1969 with ‘Kootukudumbam' directed by KS Sethumathavan. From working with the who's who of Malayalam cinema to finding her better half filmmaker Bharathan, Malayalam cinema has been her life.KPAC Lalitha's demise has left a void that is irreversible, but she will live in the hearts of the cinèastes forever, through her eternal performances.", "topics": "entertainment", "published_date": "2022-02-24 05:45:00", "link": "https://timesofindia.indiatimes.com/entertainment/malayalam/movies/news/bheeshma-parvam-trailer-mammootty-starrer-gives-a-glimpse-of-late-actors-nedumudi-venu-and-kpac-lalitha/articleshow/89790954.cms", "country": "IN", "media": "https://static.toiimg.com/thumb/msid-89790972,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-23084/89790972.jpg"}, {"_id": "b4f5aaaedba0257890ed76e1fe9e4166", "title": "Nurturing a heartache: 5 years with a Ducati 899 Panigale", "summary": "There's something supernatural about my bike and alignment of stars. She's been out of action pretty soon after the last service. Like I mentioned I changed her spark plugs 7 months ago, within 10 15 kms, she got lumpy a few hundred metres from home as i began to ride. Limping home, i tried to make out what could be wrong. Since she was serviced recently, my doubt rested on things that may have got disturbed during servicing her. She was vibey, asthmatic and was putting out probably 20 25 bhp . \nAfter a little brainstorming, throttle body cleaning and injector cleaning, the fault finally was found out to be in a failed spark plug.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.team-bhp.com/forum/superbikes-imports/218612-nurturing-heartache-5-years-ducati-899-panigale-3.html", "country": "IN", "media": "http://www.team-bhp.com/themes/bhp/images/team-bhp-logo.png"}]}, "NZ": {"articles": [{"_id": "badbd6226778090333e88d830c6e664d", "title": "Russia has invaded Ukraine. Here's what you need to know", "summary": "Russia has invaded Ukraine after President Vladimir Putin authorised a military operation in the Eastern European country. The invasion follows months of Moscow massing troops near Ukraine.Despite Western states repeatedly expressing fears of just such an outcome, Russia had continued to deny any such plans.The Kremlin had demanded guarantees from the West that NATO would not accept Ukraine and other former Soviet nations as members, halt weapon deployments there and roll back its forces from Eastern Europe — demands the US and NATO rejected as nonstarters.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://home.nzcity.co.nz/news/article.aspx?id=349566", "country": "NZ", "media": null}, {"_id": "6b1d6abc276d71e038643a152b3c440a", "title": "Yikun Zhang denies being a Chinese Communist Party member", "summary": "As name suppressions lifts, a statement says Zhang caught up in a misguided prosecution.\n Wealthy businessman Yikun Zhang has been named as one of six people charged in relation to donations made to the Labour Party. Name suppression for Zhang was lifted in the \n Choose your best value subscription option here.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.nbr.co.nz/story/yikun-zhang-says-he-not-chinese-communist-party-member", "country": "NZ", "media": "https://d3tq6tj0ymyeum.cloudfront.net/sites/default/files/styles/article_featured_image/public/2022-02/Zhang%20Yikun%20made%20a%20MNZM%20%20by%20Dame%20Patsy%20Reddy.jpg?itok=k16KgIKf"}, {"_id": "0be3601c5ebe690292e95eddb1a67c2b", "title": "Defendants in National Party donations scandal revealed", "summary": "Jami-Lee Ross and Yikun Zhang among those facing SFO charges.\n Former National Party member Jami-Lee Ross and prominent philanthropist Yikun Zhang are two of four men facing allegations over two donations made to the National Party. The defendants' identities, previously \n Choose your best value subscription option here.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.nbr.co.nz/story/defendants-national-party-donations-scandal-revealed", "country": "NZ", "media": "https://d3tq6tj0ymyeum.cloudfront.net/sites/default/files/styles/article_featured_image/public/2020-02/Zhang%20Yikun%20made%20a%20MNZM%20%20by%20Dame%20Patsy%20Reddy.jpg?itok=_wfpWlwB"}]}, "IL": {"articles": [{"_id": "023d84b5e1aa7479adecfb71561ed670", "title": "Why I Chose March 16th as My Son's Birthdate", "summary": "Edit Facebook Twitter email Print Please note that the posts on The Blogs are contributed by third parties. The opinions, facts and any media content in them are presented solely by the authors, and neither The Times of Israel nor its partners assume any responsibility for them. Please contact us in case of abuse. In case of abuse, Report this post. On Tuesday, February 15, 2022, I read Hadassah's recent policy statement. It was released as, Policy Statement | Reaffirming Support for Reproductive Choice.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://blogs.timesofisrael.com/why-i-chose-march-16th-as-my-sons-birthdate", "country": "IL", "media": "https://static.timesofisrael.com/blogs/uploads/2022/02/Reproductive_Flowers-Getty1206955505-1.jpg"}]}, "CN": {"articles": [{"_id": "b745399ba350c9d25923f6948835de98", "title": "China-Laos Railway to run additional passenger trains", "summary": "A 120 km/h air-conditioned passenger train arrives in Vientiane Station of China-Laos Railway in Vientiane, Laos, Feb. 22, 2022.(Photo: Xinhua)  Photo taken on Feb. 9, 2022, shows the Luang Prabang Station along the China-Laos Railway in Luang Prabang, Laos. The Laos-China Railway Company (LCRC) has announced it will operate slower-speed trains in addition to the two existing high-speed EMU (electric multiple unit) trains to meet the growing needs of passengers.(Photo: Xinhua)  Photo taken on Feb.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.globaltimes.cn/page/202202/1253043.shtml", "country": "CN", "media": "https://www.globaltimes.cn/Portals/0/attachment/2022/2022-02-24/31c97ceb-7e5d-48e3-9504-52ec45b98cd9.jpeg"}, {"_id": "76990a1ce88f89db320a3ea69644b536", "title": "Feature: Fashion college in London aims to nurture diversity in industry", "summary": "by Martina Fuchs LONDON, Feb. 24 (Xinhua) -- Changing the fashion business and bringing a more diverse representation in relation to race, gender and body starts in the classroom, said leading industry educators, advocates and creatives, as the curtain has fallen on London Fashion Week in the British capital. In the heart of central London's energetic and eclectic nightlife district Soho on Tuesday evening, the Conde Nast College of Fashion & Design launched its \"Global Fashion Perspectives\" initiative in a bid to better promote diversity and inclusion across the sector.", "topics": "world", "published_date": "2022-02-24 05:45:00", "link": "http://www.china.org.cn/world/Off_the_Wire/2022-02/24/content_78069082.htm", "country": "CN", "media": null}]}, "AU": {"articles": [{"_id": "90a1003ef8c080bcfd1e0bbda504eded", "title": "Olympus Discovery Center Brings Advanced Microscopy to Brain Research", "summary": "Olympus continues to demonstrate its commitment to advancing bioscience research with the opening of the new Olympus Discovery Center at the University of Montreal's Centre interdisciplinaire de recherche sur le cerveau et l'apprentissage (Center for Interdisciplinary Research on Brain and Learning, or CIRCA). The new facility helps ensure researchers have access to the cutting-edge microscopy tools they require to progress their research.\n\nUniversité de Montreal Campus. Image Credit: Olympus Scientific Solutions Americas - Industrial Microscopy\n\nImproving Learning by Studying Processes at the Neural Level\n\nComprising over 60 researchers from seven faculties, CIRCA works to accelerate interdisciplinary brain science research and its applications through disciplines that operate in practice settings.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "https://www.azom.com/news.aspx?newsID=58332", "country": "AU", "media": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_58332_16456793986213396.jpg"}]}, "KR": {"articles": [{"_id": "d55866d06c5d00de01d5076732e2b204", "title": "BTS to hold concerts in Las Vegas in April", "summary": "Feb 24, 2022, 09:56 am 1BTS will hold offline concerts in Las Vegas in April.On February 23, BTS announced through its fan community platform Weverse, 'BTS permission to dance on stage will be held in Las Vegas.The concerts will be held on April 8, 9 15 and 16 at the Allegiant Stadium in Las Vegas. The shows can be viewed right outside the stadium in a ‘Live Play' area near MGM Grand Garden Arena where fans can watch the concert on a large screen and take part in on-ground events. The concert to be held on April 16 will be streamed live for those who want to watch online.", "topics": "news", "published_date": "2022-02-24 05:45:00", "link": "http://en.asiatoday.co.kr/view.php?key=20220224000955135", "country": "KR", "media": "https://img.asiatoday.co.kr/file/2022y/02m/24d/20220224000955135_1.jpg"}]}}, "last_fetched": "2022:02:24 05:47:10 UTC +0000"}