{"countries": {"DE": {"articles": [{"id": "e227fbccf36fa03949369749dc64b998", "title": "Direct To Consumer Pharmaceutical Advertising Market is Going to Boom", "summary": "Press release Latest released the research study on Global Direct To Consumer Pharmaceutical Advertising Market, offers a detailed overview of the factors influencing the global business scope. Direct To Consumer Pharmaceutical Advertising Market research report shows the latest market insights, current situation analysis with upcoming trends and breakdown of the products and services. The report provides key statistics on the market status, size, share, growth factors of the Direct To Consumer Pharmaceutical Advertising.", "topics": "business", "published_date": "2022-02-17 11:45:28", "link": "https://www.openpr.com/news/2555690/direct-to-consumer-pharmaceutical-advertising-market-is-going", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217916205_g.jpg"}, {"id": "825b6433c783e9561106654870d014ed", "title": "Online Payment API: Market 2022 Huge Demand by Globally with Top Key Player", "summary": "Online Payment API: Market 2022 Huge Demand by Globally with Top Key Player | PayPal, BlueSnap, Adyen, Boleto Bancario\n\nOnline Payment API\n\nhttps://www.qurateresearch.com/report/sample/BnF/global-online-payment-api-market/QBI-MR-BnF-1081269\n\nhttps://www.qurateresearch.com/report/buy/BnF/global-online-payment-api-market/QBI-MR-BnF-1081269\n\nhttps://www.qurateresearch.com/\n\nThe technique applied to derive the market share of the Online Payment API Market 2022 built on the end-user sector and market area is bottom-up forecasting.", "topics": "business", "published_date": "2022-02-17 11:45:09", "link": "https://www.openpr.com/news/2555689/online-payment-api-market-2022-huge-demand-by-globally-with-top", "country": "DE", "media": "https://cdn.openpr.com/V/2/V217292456_g.jpg"}, {"id": "e0e550e918b836bc77c206901da3d7e1", "title": "The GEO Group Inc. Q4 Earnings Summary", "summary": "WASHINGTON (dpa-AFX) - Below are the earnings highlights for The GEO Group Inc. (GEO):Earnings: -$49.80 million in Q4 vs. $11.91 million in the same period last year. EPS: -$0.41 in Q4 vs. $0.10 in the same period last year. Excluding items, The GEO Group Inc. reported adjusted earnings of $45.48 million or $0.38 per share for the period. Revenue: $557.54 million in Q4 vs. $578.12 million in the same period last year. -Guidance: Next quarter EPS guidance: $0.48 - $0.50 Next quarter revenue guidance: $550 - $555 MlnCopyright(c) 2022 RTTNews.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.finanznachrichten.de/nachrichten-2022-02/55270093-the-geo-group-inc-q4-earnings-summary-020.htm", "country": "DE", "media": "https://fns1.de/g/fb.png"}], "total": 3}, "IN": {"articles": [{"id": "40706d971f811dae1cf785c767ac0a80", "title": "Nigeria to seek damages from suppliers of gasoline with too much methanol", "summary": "The normal methanol level is 2-3% but the off-spec fuel had levels of 20%, which can damage engines. There have been reports to this effect and the Nigerian government has promised to assess the vehicles.ABUJA: Nigerian National Petroleum Corp (NNPC) will seek damages from suppliers of gasoline with levels of methanol that were too high, its managing director has told a House of Representatives committee meeting.Five vessels with fuel that didn't meet requirements on methanol levels had been rejected by NNPC, Mele Kyari, chief executive of the state oil firm, also said, helping create shortages with motorists queuing for hours in the country's two biggest cities.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://auto.economictimes.indiatimes.com/news/oil-and-lubes/nigeria-to-seek-damages-from-suppliers-of-gasoline-with-too-much-methanol/89638994", "country": "IN", "media": "https://etimg.etb2bimg.com/thumb/msid-89638994,imgsize-78466,width-1200,height-628,overlay-etauto/nigeria-to-seek-damages-from-suppliers-of-gasoline-with-too-much-methanol.jpg"}, {"id": "f92346d92714e382c2da6a9a14c2fd14", "title": "Throwback Thursday: When Ranbir Kapoor revealed his life-changing moment", "summary": "Ranbir Kapoor is one of the finest actors in the Hindi film industry as the actor has delivered superior performances in films like 'Rockstar', 'Tamasha', 'Barfi!', and 'Jagga Jasoos'. Ranbir made his acting debut in Sanjay Leela Bhansali's romantic drama 'Saawariya', which also marked the Bollywood debut of Sonam Kapoor. But do you know that Kapoor had already worked with the director before in his career? In a 2018 video shared by Film Companion, Ranbir recalled assisting Bhansali on the sets of 'Black' and called it his life-changing moment.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.dnaindia.com/bollywood/report-throwback-thursday-when-shamshera-ranbir-kapoor-revealed-his-life-changing-moment-sanjay-leela-bhansali-black-2934821", "country": "IN", "media": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/02/17/1021612-ranbir-kapoor.jpg"}, {"id": "96c46454442d19481f6aada607937619", "title": "Czech car production falls 11% in January as chip shortage weighs", "summary": "Czech passenger car production fell by 11.4% year-on-year to 92,657 vehicles in January, posting its lowest result for that month since 2010 as the chip shortage continued to weigh, the Czech Automotive Industry Association (AutoSAP) said on its website on Thursday.AutoSAP said, though, it expected the situation to stabilise in 2022 and show a rebound in full-year figures. Also Read:Volvo's fourth-quarter operating profit fell to 3.7 billion Swedish crowns ($396.4 million) from 4.9 billion a year ago, compared to a 4.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://auto.economictimes.indiatimes.com/news/passenger-vehicle/cars/czech-car-production-falls-11-in-january-as-chip-shortage-weighs/89640874", "country": "IN", "media": "https://etimg.etb2bimg.com/thumb/msid-89640874,imgsize-142918,width-1200,height-628,overlay-etauto/czech-car-production-falls-11-in-january-as-chip-shortage-weighs.jpg"}, {"id": "9e7902552b0c3c6f38cd853e939769fa", "title": "Shruti Haasan reacts to her net worth, says she 'died laughing' after googling beau Shantanu Hazarika", "summary": "In a new interview, Shruti Haasan answered the most often googled questions about herself. Her phone number, net worth, and relationship status were among the questions she was asked. Shruti is now preparing for her digital debut in Amazon Prime's thriller series ‘Bestseller'. Arjan Bajwa, Gauahar Khan, Mithun Chakraborty, Sonalee Kulkarni, and others appear in the show. Shruti answered questions about herself in an interview with Mashable India. When asked about her personal phone number, she responded with a witty remark.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.dnaindia.com/bollywood/report-shruti-haasan-reacts-to-her-net-worth-says-she-died-laughing-after-googling-beau-shantanu-hazarika-2934811", "country": "IN", "media": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/02/17/1021603-shruti-haasan.jpg"}, {"id": "cfa36d3dc38a3e470515a00510e14675", "title": "Rajasthan: 2 children killed, 40 injured in school bus accident in Jaisalmer", "summary": "A tragic bus accident in Rajasthan's Jaisalmer city has led to the deaths of two children and left several more injured, as reported by news agency PTI. The school bus was filled with children, and the accident took place on Thursday morning, as per the authorities. Two children were killed and 40 others injured when the school bus they were travelling overturned in Jaisalmer district of the state, officials said. The accident took place on Sheo road under the Phalsund police station area when the bus was on its way to the school.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.dnaindia.com/india/report-rajasthan-2-children-killed-40-injured-in-school-bus-accident-in-jaisalmer-2934823", "country": "IN", "media": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/02/17/1021614-674666-road-accident.jpg"}, {"id": "3764bd13bc0e42c64a2b24aebccb4d82", "title": "UK reports first case of Deltacron—a hybrid of Omicron and Delta Covid virus: Report", "summary": "© Provided by WION \n\nA new type of Coronavirus that is a hybrid form of Delta and Omicron has been detected in the United Kingdom, health officials said. The UK Health Security Agency officials (UKHSA), however, said they are yet not worried about it as the cases are low. According to MailOnline, the hybrid ‘Deltacron' was developed in a patient who caught both variants, Delta and Omicron, at the same time. The officials are probing whether it was imported or originated in Britain. They also said that they are yet to determine how infectious or severe the newly evolved virus is or whether it will impact vaccine performance.", "topics": "world", "published_date": "2022-02-17 11:45:00", "link": "https://www.wionews.com/node/454026", "country": "IN", "media": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AATsoXS.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg"}, {"id": "a15d6b86a54aaf6e73bc0301ff6208a0", "title": "Georgina Maddox-The Hindu", "summary": "Cover Story\n\nArt\nNovember 1 , 2021\nNFT\n\nArt\nOctober 20 , 2021", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.thehindu.com/profile/author/Georgina-Maddox-1646", "country": "IN", "media": "https://www.thehindu.com/theme/images/og-image.png"}, {"id": "3f0f49ad1742c02183a6d95d2f13d66f", "title": "Italy to support Stellantis battery plant with 369 million euros", "summary": "A deal between Rome and the group has not yet been reached but in an interview on Sunday Giorgetti said an agreement for the battery plant would be signed shortly.ROME: Rome will give hundreds of millions of euros of support to a battery plant in southern Italy planned by automaker Stellantis, the industry minister said, adding the government intended to back the automotive business in the country.\"We are convinced that Stellantis should continue to be engaged in Italy and the gigafactory in Termoli which (Rome) will support with 369 million euros ($420 million) of public money demonstrates this,\" Giancarlo Giorgetti told daily Il Sole 24 Ore in an interview published on Thursday, without clarifying the overall investment expected for the plant.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://auto.economictimes.indiatimes.com/news/auto-components/italy-to-support-stellantis-battery-plant-with-369-million-euros-il-sole-24-ore/89637790", "country": "IN", "media": "https://etimg.etb2bimg.com/thumb/msid-89637790,imgsize-294226,width-1200,height-628,overlay-etauto/italy-to-support-stellantis-battery-plant-with-369-million-euros-il-sole-24-ore.jpg"}, {"id": "ca5cdb07e552782927e8d0becc0667be", "title": "Maruti Suzuki Subscribe partners with Quiklyz by Mahindra Finance", "summary": "Launched in July 2020, Maruti Suzuki Subscribe is a programme where a customer can own a car without buying it.New Delhi: Maruti Suzuki India Limited (MSIL) has partnered with Quiklyz by Mahindra Finance for its Subscribe programme and extended the programme to the Kolkata market. MSIL has three other partners for the programme: Orix, Myles, and ALD. It also provides the customers with an added option of choosing either white or black registration plates, thus offering further flexibility to the car ownership experience, the company said in a media release on Thursday.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://auto.economictimes.indiatimes.com/news/aftermarket/maruti-suzuki-subscribe-partners-with-quiklyz-by-mahindra-finance/89635735", "country": "IN", "media": "https://etimg.etb2bimg.com/thumb/msid-89635735,imgsize-104132,width-1200,height-628,overlay-etauto/maruti-suzuki-subscribe-partners-with-quiklyz-by-mahindra-finance.jpg"}, {"id": "62cd6292979caade6d82311bc2706934", "title": "Throwback! Anushka Sharma's date with two cups of hot coffee, Read to know more", "summary": "News Bollywood's new mommy Anushka Sharma seems to enjoy parenthood with daughter Vamika who turned a year old recently\n \n\n\n Follow us on Google news to get the best breaking news\n\nMUMBAI: It has been a little over a year since Anushka Sharma and Virat Kohli welcomed their first child Vamika. While Vamika has changed Anushka and Virat's life for good, the actress could not help but look back on more peaceful times. Anushka recently shared a photo of herself chilling in the lawn.In the picture, the actress had two cups of coffee in front of her, a phone in her hand, and can be seen relaxing as the sun shines.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.tellychakkar.com/movie/movie-news/throwback-anushka-sharma-s-date-two-cups-of-hot-coffee-read-know-more-220217", "country": "IN", "media": "https://www.tellychakkar.com/sites/www.tellychakkar.com/files/images/movie_image/2022/02/17/anushka.jpg"}], "total": 10}, "US": {"articles": [{"id": "d23d9b166f233987f7f5bb91d4c57bf4", "title": "New York State Needs Assistant Forest Rangers, Apply Here", "summary": "There is a great job that is waiting for anyone who wants a career that gets you outside in the fresh air everyday. In a post on their Facebook page, The New York State Department of Environmental Conservation is looking for individuals to apply to become Assistant New York State Forest Rangers.We are looking to hire approximately 25 Assistant Forest Rangers (AFRs) from mid-May to early Fall and you can be one of them! AFRs help with search and rescues, monitor trails, interact with the public, and much more.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://wyrk.com/new-york-state-forest-rangers", "country": "US", "media": "https://townsquare.media/site/10/files/2022/02/attachment-gettyimages-112933729-594x594.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89"}, {"id": "c3e7c16c6bb07170fd93ca96c865ec0b", "title": "Mudslides and floods kill at least 94 people after 26cm (10 inches) of rain falls in just 3 hours on the city of Petropolis, Brazil (UPDATE)", "summary": "© Silvia IzquierdoRescue workers and residents search for victims in an area affected by landslides in Petropolis, Brazil, on Feb. 16, 2022.At least 18 people have died in mudslides and floods after a mountainous region of Rio de Janeiro saw almost a month's worth of rain fall in just three hours.\n\nThe state fire department said more than 180 soldiers were involved in a rescue mission in the city of Petropolis where 25.8cm (just over 10in) fell on Tuesday - close to the same quantity that fell during the previous 30 days combined.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.sott.net/article/464498-Mudslides-and-floods-kill-at-least-94-people-after-26cm-10-inches-of-rain-falls-in-just-3-hours-on-the-city-of-Petropolis-Brazil-UPDATE", "country": "US", "media": "https://www.sott.net/image/s31/637216/full/1200x_1.jpg"}, {"id": "c9fa45bc9c2740a1e512dbde1b5a6020", "title": "Naeslund claims Olympic skicross gold, ends Canada's reign", "summary": "Champaign, IL (61820)\n\nToday\n\nA wintry mix this morning, becoming all snow for the afternoon. Windy. Morning high of 39F with temps falling to near 25. Winds N at 25 to 35 mph. Chance of precip 100%. 5 to 8 inches of snow and ice expected. Higher wind gusts possible..\n\nTonight\n\nSnow along with gusty winds this evening. Then becoming partly cloudy late. Low -2F. Winds NW at 20 to 30 mph. Chance of snow 70%. Snow accumulations less than one inch. Higher wind gusts possible.", "topics": "world", "published_date": "2022-02-17 11:45:00", "link": "https://www.news-gazette.com/news/nation-world/naeslund-claims-olympic-skicross-gold-ends-canadas-reign/article_12c8cd77-c0f5-5793-9e79-290d45e05525.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/news-gazette.com/content/tncms/custom/image/3d3bfbd4-3cf5-11ec-9461-574a9d514a20.jpg?resize=600%2C315"}, {"id": "7fe692f859e082d262712b80f216551a", "title": "Column: Support education Monday at the statehouse during public schools week", "summary": "Public Schools Week is Feb. 21 through 25, and it's appropriate that it follows Valentine's Day.\n\nOur schools deserve our love. In a school near you, a child brings letters together to form words for the first time. A friend offers comfort to a peer in distress. A social studies class explores world religions. Middle schoolers design a backdrop for a school play. High schoolers measure pollution in a local stream. A teacher patches a child's sweatshirt during her prep period; another slips a granola bar to one who comes to school hungry.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://news.yahoo.com/column-support-education-monday-statehouse-110152952.html", "country": "US", "media": "https://s.yimg.com/ny/api/res/1.2/amr1PYLBX_gF6MN4sxaWPQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02OTY-/https://s.yimg.com/uu/api/res/1.2/xEAr9.TVLDuVdL7J4ZGEtw--~B/aD0xMTE0O3c9MTkyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the-herald-times/f72e6ed543b9064c3a4c594b6d785b61"}, {"id": "c4ab509813f1e03aabfcbb57abec16c8", "title": "BeBranded Agency Can Help You Establish Your Brand and Stand Out from the Competition", "summary": "BeBranded Agency is a full-service digital marketing company that offers everything from web design, SEO services, social media, branding packages, and more. (L to R): Lexi and Jackie Jawdat. Photo by: BeBranded Agency In the ultra-competitive business landscape, standing out amongst your peers can at times seem like a nigh-impossible task. However, a new Smithtown-based company is showing that finding your voice and establishing a recognizable brand is not only very possible, but the best way for you to grow your business into the success you've always dreamed of.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.longisland.com/news/02-16-22/bebranded-agency-can-help-you-establish-your-brand-and-stand-out-from-the-competition.html", "country": "US", "media": "https://www.longisland.com/site_media/images/article/subarticle_image/12_Business-Headshot-e1613058630122.jpg"}, {"id": "bc4c2a92020734ee0a271873ebacf5f2", "title": "Color of Winter at 203Fine Art", "summary": "The Taos News delivered to your Taos County address every week for a full year! We offer our lowest mail rates to zip codes in the county. Click Here to See if you Qualify. Plan includes unlimited website access and e-edition print replica online. Your auto pay plan will be conveniently renewed at the end of the subscription period. You may cancel at anytime.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.taosnews.com/tempo/arts/color-of-winter-at-203fine-art/article_24c24d37-7033-51cf-a93f-c1a8e03076c1.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/taosnews.com/content/tncms/assets/v3/editorial/2/d4/2d44579f-0b7d-579b-888e-7ab60e5f895a/620ad1161a634.image.jpg?crop=1280%2C672%2C0%2C80&resize=1200%2C630&order=crop%2Cresize"}, {"id": "b159f32ea2a8f0cdff2358ab4b090023", "title": "Shanna Moakler: I'm not obsessed with Travis and Kourtney", "summary": "Country\n\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia,", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.southernminn.com/around_the_web/community/article_6f917e31-6d96-5a82-ad2a-6d0416386bb2.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/southernminn.com/content/tncms/assets/v3/editorial/d/68/d687ea82-9ace-5932-ad57-3a6e2da8c255/620e20402bd55.image.jpg?crop=1000%2C525%2C0%2C62&resize=1000%2C525&order=crop%2Cresize"}, {"id": "51600d0b79d3c0dad2afd53b1a8c2618", "title": "Snow cafe in Indian Kashmir claims to be world's largest dome igloo", "summary": "By Shah Abbas\nSrinagar, India, Feb 17 (EFE).- A snow cafe on top of a popular ski resort in India-administered Kashmir is enthralling visitors in the troubled Himalayan region amid claims by its builders that it is the largest igloo of its kind in the world.\nThe snow structure has been created in the western Himalayas of the Gulmarg hill resort, situated 2,650-meter (nearly 8,700 feet) above sea level.\nThe massive igloo houses tables and chairs also made of snow to host 40 guests at a time.\nFor some warmth amid sub-zero temperatures that can plummet as low as minus 10 degrees these days, the creators have covered the chairs with sheep hides for visitors enjoying a steaming cup of qahwa, Kashmiri saffron tea, inside the icy edifice.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.laprensalatina.com/snow-cafe-in-indian-kashmir-claims-to-be-worlds-largest-dome-igloo", "country": "US", "media": "https://www.laprensalatina.com/wp-content/uploads/2022/02/58c68cd8832274369af0a14883f2a2697bcfe2eaw.jpg"}, {"id": "eca4864a9e0ae05cc472994257af3a10", "title": "Adjuncts often find ladder leads to nowhere in California community colleges", "summary": "As many adjuncts have bitterly learned over the years, few bootstrapping dreams come true.\n Click here to read all stories in this investigation.\n\nAdjuncts say the path through community college districts to full-time jobs is steep, perilous and often fruitless. Designed as steppingstones toward a better life for Californians, community colleges often don't give many of those who teach those students their own way ahead.\nAfter working as an adjunct English instructor for about five years at several East Bay districts, Tobey Kaplan, with a master's degree and a growing portfolio of published poems and prose, began applying for tenure-track jobs.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://edsource.org/2022/adjuncts-often-find-ladder-leads-to-nowhere-in-california-community-colleges/667635", "country": "US", "media": "https://edsource.org/wp-content/uploads/2022/02/Tobey3-1-1024x576.jpg"}, {"id": "e471169c6b0e9f093c6207c274d4ec82", "title": "Freedom of Choice in the Age of COVID", "summary": "Freedom of choice — the door that's always open, the fork in the road, the opportunity to determine the trajectory of our own lives — is a quintessential American principle and privilege. We all support that precious freedom, but we often find it difficult to agree on when and where to apply it. Today's raging debate over COVID protective measures is no exception. The Biden administration and some state authorities — evidently deeming the COVID situation too grave to let individuals choose how best to protect themselves and others — insist on imposing vaccination and masking mandates.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://patriotpost.us/articles/86303-freedom-of-choice-in-the-age-of-covid-2022-02-17", "country": "US", "media": "https://img.patriotpost.us/01FRR4XGH7Y1CJ2G5ZWJXQA8JA.jpeg?w=1200&h=600"}, {"id": "c9f5b27bfa47ab6255c804df01a23109", "title": "Microsoft to retire Xbox Live services on Windows Phones", "summary": "Share this articleMicrosoft has announced that it will stop supporting Xbox Live services via its Windows Phone series on May 16, 2022.From that date, in-game achievements and cloud saves earned on a Windows Phone will no longer be recorded to a player's Xbox Live profile, as spotted by Windows Central. Some games will likely still be playable, even if the online capabilities will no longer work.\"Starting May 16, 2022, Xbox features will no longer be supported on Windows Phone devices,\" the company said in an app notification.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.gamesindustry.biz/articles/2022-02-17-microsoft-to-retire-xbox-live-services-on-windows-phones", "country": "US", "media": "https://images.gnwcdn.com/2022/articles/2022-02-17-10-42/xbox.jpg"}, {"id": "18b8afc33519ef847541143d7201ec11", "title": "Firearms may be planted in Ottawa to discredit protest, convoy organizers warn -- Sott.net", "summary": "© Dave Chan/AFP via Getty ImagesSupporters of the Freedom Convoy protest against COVID-19 vaccine mandates and restrictions in front of Parliament of Canada, in Ottawa, Canada, on Jan. 28, 2022. A convoy of truckers started off from Vancouver on Jan. 23, 2022, on its way to protest against the mandate in the capital city of Ottawa.Organizers of the Freedom Convoy in the Canadian capital say they have notified police after being told that \"nefarious elements\" are planning to plant weapons at the Ottawa COVID-19 mandate demonstrations as a \"pretext to forcibly remove peaceful protestors.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.sott.net/article/464526-Firearms-may-be-planted-in-Ottawa-to-discredit-protest-convoy-organizers-warn", "country": "US", "media": "https://www.sott.net/image/s31/637278/full/GettyImages_1238044115_1200x80.jpg"}, {"id": "50c7c0219b6a4860c2419ed8695b442b", "title": "Taoseños shocked by 1950 robbery using explosives", "summary": "Rick Romancito for the Taos NewsLa Mariposa building at 314 Paseo del Pueblo Norte, the site of a robbery using explosives in 1950.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.taosnews.com/opinion/columns/taose-os-shocked-by-1950-robbery-using-explosives/article_14412436-75a0-5ada-ad65-ffc9e8b9ac16.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/taosnews.com/content/tncms/assets/v3/editorial/3/80/38079fb4-b9a5-574d-b619-689aa9dfab58/620d732b6a32f.image.jpg?crop=1500%2C788%2C0%2C168&resize=1200%2C630&order=crop%2Cresize"}, {"id": "35b92963b3415e27b6c243f2653f0231", "title": "Elevate your art this spring", "summary": "Courtesy imageEntries are being accepted for the banner art competition.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.taosnews.com/tempo/arts/elevate-your-art-this-spring/article_61431723-76c6-5a06-b1c4-32c696d0a937.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/taosnews.com/content/tncms/assets/v3/editorial/0/15/0158026d-9519-5550-93c6-fea28f6c8182/620ad095a43f1.image.jpg?crop=681%2C358%2C0%2C570&resize=681%2C358&order=crop%2Cresize"}, {"id": "c018704714b90f1a4b52dfd1bbe73c41", "title": "Maple Corner to become Fountain County courthouse annex", "summary": "COVINGTON, Ind. — It's going to be a new chapter for the Maple Corner building.It will no longer be a restaurant, or wedding and event venue space as it most recently had been used. It's to become a Fountain County courthouse annex.'We're trying to move this county forward, hence the purchase of this building for a courthouse annex,' said Fountain County Commissioner Tim Shumaker.A name for the building will be determined later.The commissioners said it could be the Fountain County Annex or Fountain County Maple Corner Annex.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.commercial-news.com/news/maple-corner-to-become-fountain-county-courthouse-annex/article_c2518ad0-8dd3-11ec-99dd-1f18f3d8cfe0.html", "country": "US", "media": "https://bloximages.chicago2.vip.townnews.com/commercial-news.com/content/tncms/assets/v3/editorial/e/43/e431bc20-8e7c-11ec-81af-5fd0aa94915e/620bd7a0ed066.image.jpg?crop=1662%2C873%2C0%2C187&resize=1200%2C630&order=crop%2Cresize"}, {"id": "4cd3ed8091b34fa9fd93afe1f305249a", "title": "Wi-Fi is Powering Americans' Most Meaningful Moments – Here's How", "summary": "Country\n\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia,", "topics": "tech", "published_date": "2022-02-17 11:45:00", "link": "https://www.rockymounttelegram.com/online_features/tech_talk_and_innovation/wi-fi-is-powering-americans-most-meaningful-moments-here-s-how/article_e726bf46-ae60-561e-9ce5-ac6823dc1d13.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/rockymounttelegram.com/content/tncms/assets/v3/editorial/0/2e/02e7f593-6c4f-5479-8d07-6d8a76309717/620dfb2c29a6b.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize"}, {"id": "345b312eeac21798cf006b6104f5a52a", "title": "Letter: Vandalizing, killing, lying -- that's all 'legitimate' now?", "summary": "Lawmakers evacuate the floor as protesters try to break into the House Chamber at the U.S. Capitol on Wednesday, Jan. 6, 2021, in Washington. AP Photo/J. Scott Applewhite", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.yakimaherald.com/opinion/letter-vandalizing-killing-lying----thats-all-legitimate-now/article_8ff69961-88f1-554e-b656-093425f03524.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/yakimaherald.com/content/tncms/assets/v3/editorial/4/8b/48b0d205-5709-544d-a7cb-e45d37c60c00/5ff676a09a26f.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize"}, {"id": "82e4b755724083f7d4deb920d45ae994", "title": "Improve Wellness with Affordable Bathroom Upgrades", "summary": "Spearfish, SD (57783)\n\nToday\n\nSunny to partly cloudy. High 39F. Winds WSW at 10 to 20 mph..\n\nTonight\n\nCloudy skies early, followed by partial clearing. Low 33F. Winds W at 15 to 25 mph. Winds could occasionally gust over 40 mph.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.bhpioneer.com/online_features/home_improvement/improve-wellness-with-affordable-bathroom-upgrades/article_0c08552c-8543-5bc9-bde7-d22b52f46140.html", "country": "US", "media": "https://bloximages.chicago2.vip.townnews.com/bhpioneer.com/content/tncms/assets/v3/editorial/0/bd/0bd3a426-ac63-562e-8efe-058bb7df0cbd/620a220222deb.image.jpg?resize=200%2C200"}, {"id": "5f73ae639e2b6197be0b24ede59d0710", "title": "Area fires offer safety lessons", "summary": "Over the course of four days this week, three families lost their homes in Columbia County. Thankfully, no one lost their lives in any of the three fires....", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.pressenterpriseonline.com/daily/021722/page/15/story/area-fires-offer-safety-lessons", "country": "US", "media": "https://www.pressenterpriseonline.com/sites/all/themes/press_enterprise/images/services-print.jpg"}, {"id": "e3143eb5d793c63eeefca1142e1dd3c8", "title": "12 Acts Of Kindness Anyone From Buffalo Can Do", "summary": "February 17 is Random Acts of Kindness Day, but that shouldn't be the only day of the year when you go out of your way to do something nice for someone else. There are a ton of ways to be a Good Neighbor today, and you probably have done a few of them in recent weeks, just to be a good person.We can get caught up in our own little world sometime and that causes us to always be in a rush, so much so that we never slow down for a second, even if it means making someone's entire day.Try to be mindful of others today, and if you can, spread some kindness around Western New York with one of these 12 random acts of kindness.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://wyrk.com/buffalo-is-kind", "country": "US", "media": "https://townsquare.media/site/10/files/2022/02/attachment-gettyimages-1233760023.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89"}, {"id": "09d25c6ae38a0e97817bd567251ea92b", "title": "Plane hit rig on highway", "summary": "LEXINGTON, N.C. (AP) — An airplane crashed into a tractor-trailer Wednesday on a North Carolina highway, sparking a small fire, officials said. There was no...", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.pressenterpriseonline.com/daily/021722/page/4/story/plane-hit-rig-on-highway", "country": "US", "media": "https://www.pressenterpriseonline.com/sites/all/themes/press_enterprise/images/services-print.jpg"}, {"id": "5d8ddbd9700f33f935a83bbcc1f40b49", "title": "Gov. Baker to Announce Plans for State's First Offshore Wind Site", "summary": "What has been dubbed the first offshore wind manufacturing site in Massachusetts will replace the old coal power plant in Somerset. The company, Prysmian, plans to build a new facility at Brayton Point to manufacture transmission cables. Late last year, the state announced two offshore wind projects – Mayflower Wind and Vineyard Wind were moving forward to contract negotiations. The two farms would provide 1,600 megawatts of energy. Offshore wind energy is not without controversy. The Cape Wind project off Nantucket Sound faced fierce opposition from environmentalists and residents for years before it was eventually abandoned.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.nbcboston.com/news/local/gov-baker-to-announce-plans-for-states-first-offshore-wind-site/2647339", "country": "US", "media": "https://media.necn.com/2021/10/AP20181626985105.jpeg?quality=85&strip=all&crop=0px%2C106px%2C3756px%2C2113px&resize=1200%2C675"}, {"id": "275e7f4c0e91e3643f2b07f38b7d8c09", "title": "US funds for Canada protests may sway American politics too", "summary": "Country\n\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia,", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.hjnews.com/nation/us-funds-for-canada-protests-may-sway-american-politics-too/article_c0073fb8-cef2-5821-a163-98cef59e960a.html", "country": "US", "media": "https://bloximages.chicago2.vip.townnews.com/hjnews.com/content/tncms/assets/v3/editorial/6/6b/66baa7a3-858c-56d8-b339-ad4e1706f971/620e084028247.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize"}, {"id": "081b075ade422aaf768e200cb1c6824a", "title": "Revere Beach", "summary": "A man in Revere, Massachusetts, found a rare fish on the beach. After reporting it, state officials are looking into how the endangered species ended up there. 'It looked like prehistoric, like a living dinosaur. I've never seen something that looked that way,' said Erik Haigh, who lives near Revere Beach. At first, he thought it was a tire... \n \n The famous Revere International Sand Sculpting Festival is returning this weekend, and perfect beach weather's on tap.\n \n \n Residents of Wareham contacted NBC10 Boston about the trash piling up near Onset Beach.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.necn.com/tag/revere-beach", "country": "US", "media": "https://media.necn.com/2022/02/14865969839-1080pnbcstations.jpg?quality=85&strip=all&resize=850%2C478"}, {"id": "c43f304ab5f8aa4a8503ea8720c91bb9", "title": "Pruyne resigns as North Towanda Township Secretary", "summary": "North Towanda Township Supervisor Gerald Sheets and Secretary/Treasurer Laurie Pruyne look over the treasurer's report Tuesday. Review Photo/Matt Jennings", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.thedailyreview.com/news/local/pruyne-resigns-as-north-towanda-township-secretary/article_ae9fd5a0-0326-5d72-b02a-7744450ff972.html", "country": "US", "media": "https://bloximages.chicago2.vip.townnews.com/thedailyreview.com/content/tncms/assets/v3/editorial/0/56/05697be5-130a-51fb-a5ab-c56a17c9c415/620d6f37a7fe7.image.jpg?crop=1662%2C873%2C0%2C187&resize=1200%2C630&order=crop%2Cresize"}, {"id": "44b74c3bedf9beb971acccc38bdf0f59", "title": "The Witch Head Nebula", "summary": "Courtesy Charles McMillanWitch Head Nebula (IC 2118) near Rigel, the brightest star in the constellation Orion the Hunter. If not for astrophotography, we wouldn't be able to see this deep space object. This image was taken by Charles McMillan in early February from his home near Angel Fire New Mexico.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.taosnews.com/opinion/columns/the-witch-head-nebula/article_767b4e83-1ef3-5971-b7b4-397d0597960f.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/taosnews.com/content/tncms/assets/v3/editorial/4/ab/4abb9606-9a94-5c2f-858f-75221013a5bb/620c2e762e2e5.image.jpg?crop=891%2C468%2C0%2C516&resize=891%2C468&order=crop%2Cresize"}, {"id": "8ec706cee3297bf234a9a3fc89114074", "title": "Binance Halts Activities in Israel Following Regulator Intervention: Report", "summary": "Israel's Capital Markets Authority, the regulator responsible for crypto-exchange licensing, has asked Binance to clarify its activities in the Israeli market, according to a report in local news outlet Globes.\n\nIsrael's Capital Markets Authority, the regulator responsible for crypto-exchange licensing, has asked Binance to clarify its activities in the Israeli market, the report said.\n\nThe authority has asked Binance for clarification regarding the type of services it provides to Israelis and the licenses under which it operates, Globes said.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://news.yahoo.com/binance-halts-activities-israel-following-111158086.html", "country": "US", "media": "https://s.yimg.com/uu/api/res/1.2/dcQawtWEDuwn9AHDUZ64EA--~B/aD02MDA7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/coindesk_75/579b52a1d31c370f5e1e80c8a45e43f5"}, {"id": "a615f84dac50432cbdafde74b4d41b86", "title": "Thank-you to Reese Creek donors", "summary": "Country\n\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia,", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.belgrade-news.com/opinion/letters_to_editor/thank-you-to-reese-creek-donors/article_c61673a0-b29d-55a6-acb1-801a317ea74f.html", "country": "US", "media": "https://bloximages.chicago2.vip.townnews.com/belgrade-news.com/content/tncms/custom/image/661cbbf6-e161-11e5-9e96-634c1ad9e214.jpg?resize=600%2C315"}, {"id": "562fce2c239849690dc3d2a3841b90c1", "title": "Business owner wins seat on board", "summary": "BLOOMSBURG — A business owner and parent beat out four other candidates to take an open seat on the school board here during a special meeting Wednesday night...", "topics": "business", "published_date": "2022-02-17 11:45:00", "link": "https://www.pressenterpriseonline.com/daily/021722/page/1/story/business-owner-wins-seat-on-board", "country": "US", "media": "https://www.pressenterpriseonline.com/sites/all/themes/press_enterprise/images/services-print.jpg"}, {"id": "537a5622a689a30a96879c4957d199f9", "title": "House GOP ups the ante in tax-cutting debate", "summary": "House Republicans unveiled the Capitol's most aggressive tax-cutting plan to date Wednesday, pitching a combination of ongoing and one-time relief worth more than $700 million and centered on middle-income households and small and mid-sized businesses. Republicans also called for further investigations into the contracting practices of Gov. Ned Lamont's administration and other initiatives to enhance government transparency. \n'I think overall the affordability in the state of Connecticut is one of the biggest concerns that residents have,' said House Minority Leader Vincent J.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.hartfordbusiness.com/article/house-gop-ups-the-ante-in-tax-cutting-debate", "country": "US", "media": "https://www.hartfordbusiness.com/themes/mainebiz/images/favicon/hbj/HBJ_favicon_1200x1200.png"}, {"id": "b7a104e4099b9ba04140eeec41eaff49", "title": "North Carolina Supreme Court decision on electoral maps gets candidates running again. But when?", "summary": "A sign directs voters Tuesday at Elon Elementary School. Deadlines make it impossible to report election results in Wednesday's Times-News. For complete results and other stories and photos, visit www.thetimesnews.com.\n\nAfter being delayed for months, it looks like the filing for the 2022 elections will resume next week.\n\nFiling for both the delayed 2021 municipal elections and the 2022 general election will begin Feb. 24 and end March 4. These include elections for city council, county commissioners, N.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://news.yahoo.com/north-carolina-supreme-court-decision-110225284.html", "country": "US", "media": "https://s.yimg.com/ny/api/res/1.2/ubWlhbENfUxnma6ZPr53gw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/0WWAfL3JhEQW6Nb8XMK9hA--~B/aD04MTY7dz0xMjI0O2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/times-news/4a252993e3043ca20409f1dfb5c978b2"}, {"id": "51a74eaf36f31355e4732bbb7c746727", "title": "RE: Ebony and Jet", "summary": "click to enlarge\n\n\nUploaded by lkellett\n\n\nLorna Simpson, \"Blue Love,\" installation view, Contemporary Art Museum St. Louis, September 3, 2021–February 24, 2022\n\n\n \n\nAs a complement to the exhibition Lorna Simpson: Heads, RE: Ebony and Jet explores the roles of these preeminent Black publications in visual culture and media.\nCAM encourages attendees to arrive for the discussion with their own ideas, memories, and anecdotes to share relating to the meaning of Ebony and Jet in their lives, responding to the question: What do Ebony and Jet mean to you?\n\n\n\n\n \n\n \n\n3750 Washington Blvd.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.riverfronttimes.com/stlouis/re-ebony-and-jet/Event?oid=37133065", "country": "US", "media": "https://media1.riverfronttimes.com/riverfronttimes/imager/u/slideshow/37133064/lorna_simpson_dusty_kessler_2.jpg"}, {"id": "0d491a43352409ab6f94dbaf95a6e2e4", "title": "In Brief: Lesson of the Palin Verdict", "summary": "Earlier this month, we argued that former Alaska Governor and vice presidential candidate Sarah Palin ought to win a libel and defamation lawsuit against The New York Times. The paper blamed her for the 2011 murderous attack in Tucson. As we feared, however, such cases are extremely hard to win for public figures, and the judge threw it out one day before the jury found in favor of the Times. The Wall Street Journal editorial board reflects: \nThe New York Times won a legal victory Tuesday against Sarah Palin's libel suit, but the cost has been steep.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://patriotpost.us/articles/86302-in-brief-lesson-of-the-palin-verdict-2022-02-17", "country": "US", "media": "https://img.patriotpost.us/01FW1TND2QRDKEE8PFW55KJZWM.jpeg?w=1200&h=600"}, {"id": "7471510531d151d8b0d890c21e40acfa", "title": "Visual Studio 2022 update improves search, Git integration", "summary": "Microsoft has made Visual Studio 2022 version 17.1 generally available for production use. At the same time, the company has released a preview of Visual Studio 2022 version 17.2.Both were announced February 15. Visual Studio 2022 version 17.1 brings improvements in search, debugging, and Git-related capabilities. Visual Studio 2022 version 17.2 also enhances the Git experience while adding new C# features. Visual Studio 2022 version 17.1 follows the November release of Visual Studio 2022 version 17.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.infoworld.com/article/3650530/visual-studio-2022-update-improves-search-git-integration.html", "country": "US", "media": "https://images.idgesg.net/images/article/2017/07/code_programming_software_astract_background_thinkstock_537331500-100729677-large.jpg?auto=webp&quality=85,70"}, {"id": "319c4c69c9609f05f7a3c37caab2e06f", "title": "Crosby's legacy more than goals", "summary": "PITTSBURGH — Sidney Crosby felt the pressure. He always does. The Pittsburgh Penguins star could sense it as he crept closer and closer to 500 career goals....", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.pressenterpriseonline.com/daily/021722/page/11/story/crosbys-legacy-more-than-goals", "country": "US", "media": "https://www.pressenterpriseonline.com/sites/all/themes/press_enterprise/images/services-print.jpg"}, {"id": "f27e54e0f74e39de8f2b273a685b0e4f", "title": "BEIJING SNAPSHOT: N. Korea not at Games but diplomat remains", "summary": "Country\n\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia,", "topics": "world", "published_date": "2022-02-17 11:45:00", "link": "https://www.rockymounttelegram.com/news/world/beijing-snapshot-n-korea-not-at-games-but-diplomat-remains/article_b80e00ff-8d97-54d6-aed7-7031e55a1c05.html", "country": "US", "media": "https://bloximages.newyork1.vip.townnews.com/rockymounttelegram.com/content/tncms/assets/v3/editorial/1/dc/1dcd104d-9b9a-5afa-a7ec-5dd1181d7143/620e1d45dccfe.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize"}, {"id": "482b3c8d3268ccb4d3bc5ca56a733bfa", "title": "Victor Searfoss, 63", "summary": "Victor Searfoss, 63, of Gillett, PA, passed away on Tuesday, February 15, 2022.Victor was born on April 1, 1958, to Richard (Dick) and Joyce Cobb Searfoss, and lived in the Valley and Barclay Mountain for many years before settling in Gillett, PA.Vic is survived by his sisters, Mari (Rich) Barrett of Gillett, PA, and Theresa Brown of Monroeton, PA, brothers, Roger and companion Julie of Bath, NY, and Ron of Monroeton, PA, many nieces and nephews including special niece Noelle Searfoss, who he enjoyed discussing politics with, and nephew Matthew Barrett, who moved in to help Vic so he could be at home.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.thedailyreview.com/obituaries/victor-searfoss-63/article_a4702643-358d-5e64-9b4d-d1b7badd9f14.html", "country": "US", "media": "https://bloximages.chicago2.vip.townnews.com/thedailyreview.com/content/tncms/assets/v3/editorial/3/81/381aa2e9-7478-50bc-9b1a-af19995582c7/620dd1a569255.image.jpg?crop=720%2C378%2C0%2C301&resize=720%2C378&order=crop%2Cresize"}, {"id": "c74b85f56099287d36d9428bd7d586c8", "title": "Chris Cuomo fired after CNN learned of alleged sex attack during office 'lunch': report -- Sott.net", "summary": "© CNNChris Cuomo was fired after allegedly attacking a female ABC News temp. Chris Cuomo allegedly attacked a female ABC News temp worker when she denied his proposition for sex during a \"lunch\" in his office, it was revealed on Tuesday.\n\nThe accusation was made to CNN lawyers in December hours after Cuomo was suspended for advising his brother, then-Gov. Andrew Cuomo, how to dodge his own sexual harassment accusations, according to the New York Times. The CNN host was fired days later.\n\nThe unnamed accuser had come forward after Chris Cuomo was suspended from the network on Nov.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.sott.net/article/464530-Chris-Cuomo-fired-after-CNN-learned-of-alleged-sex-attack-during-office-lunch-report", "country": "US", "media": "https://www.sott.net/image/s31/637299/full/chris_cuomo.jpg"}, {"id": "025d0d33d1e87d4bf79d566faec2b03b", "title": "The Strait of Malacca: From Sultanates to Singapore", "summary": "By Adam Greco\nFor centuries, merchant vessels have passed from the Indian Ocean to Eastern Asia through a small waterway nestled inside Southeast Asia. The Strait of Malacca (SoM) is the Strait south of the Malay Peninsula through which passes over a quarter of the world's trade.\nThe Strait of Malacca highlighted on a map of South Asia (Wikimedia Commons).\nThree littoral states—Singapore, Malaysia, and Indonesia—border the Strait. the Strait's importance derives from its status as one of the quickest routes connecting the Indian Ocean with the Pacific Ocean.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://cimsec.org/the-strait-of-malacca-from-sultanates-to-singapore", "country": "US", "media": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Strait_of_malacca.jpg"}], "total": 39}, "AE": {"articles": [{"id": "f46194e272a99bcea6eb9c9e4bf49ee7", "title": "Ukraine tensions drive Indian shares lower in volatile trading", "summary": "Indian shares closed lower in volatile trading on Thursday as tensions over Ukraine outweighed the impact of the U.S. Federal Reserve's less-than-feared hawkish stance, reflected in the minutes of its last policy meet.The NSE Nifty 50 index  fell 0.1% at 17,304, while the S&P BSE Sensex  was down 0.18% at 57,892.01Russian-backed rebels and Ukrainian forces traded accusations on Thursday that each had fired across the ceasefire line in eastern Ukraine, raising alarm at a time when Western countries have warned of the possibility of a Russian invasion any day.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.zawya.com/mena/en/markets/story/Ukraine_tensions_drive_Indian_shares_lower_in_volatile_trading-TR20220217nL4N2US243X1", "country": "AE", "media": "https://www.zawya.com/images/cia/zAmp/210904161727DLEU.jpg"}, {"id": "5880487bea71e032d4934378b2662e3b", "title": "Hong Kong's COVID fight intensifies as cases multiply by 60 times", "summary": "HONG KONG - Hong Kong's coronavirus battle intensified on Thursday as authorities reported new cases had multiplied by 60 times so far this month and media reported that testing would become compulsory for everyone in the global financial hub from March.Hospitals are overwhelmed with some patients, including elderly, left lying on beds outside in chilly, sometimes rainy weather, in shocking scenes that prompted an apology from authorities in the Chinese controlled city.Schools, gyms cinemas and most public venues are shut.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.zawya.com/mena/en/life/story/Hong_Kongs_COVID_fight_intensifies_as_cases_multiply_by_60_times-TR20220217nL1N2US04WX2", "country": "AE", "media": "https://www.zawya.com/images/cia/zAmp/220217100410MVLA.JPG"}, {"id": "359821950816e78f366b986c61ad7245", "title": "Facing Texas pushback, BlackRock says it backs fossil fuels", "summary": "BOSTON - At the risk of being dropped from Texas pension funds, BlackRock Inc has ramped up its message that the world's largest asset manager is a friend of the oil and gas industries.As a large and long-term investor in fossil fuel companies, \"we want to see these companies succeed and prosper,\" BlackRock executives wrote in a letter that a spokesman confirmed was sent at the start of the year to officials, trade groups and others in energy-rich Texas.\"We will continue to invest in and support fossil fuel companies, including Texas fossil fuel companies,\" states the memo, signed by Dalia Blass, BlackRock's head of external affairs, and Mark McCombe, BlackRock's chief client officer.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.zawya.com/mena/en/story/Facing_Texas_pushback_BlackRock_says_it_backs_fossil_fuels-TR20220217nL1N2UR2C9X1", "country": "AE", "media": "https://www.zawya.com/resources/img/zawya-logo-en-social.png"}, {"id": "ca8afe76c98e3de560332967ee084c52", "title": "Europe and Mideast crude premiums soar, with few options for buyers", "summary": "SINGAPORE- Spot premiums for crude oil produced in Europe and the Middle East have rocketed to record highs this month, tracking a rally in global prices as refiners snap up supplies and producers struggle to ramp up output to meet rising demand.In Asia, refining margins are back at 2018 highs as demand for most oil products has rebounded to pre-pandemic levels or higher. DUB-SIN-REF urn:newsml:reuters.com:*:nL1N2UK10QHowever, most producers in the Organization of the Petroleum Exporting Countries (OPEC) are already short of spare capacity as they play catch-up with the sharp rebound in global fuel consumption.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.zawya.com/mena/en/story/Europe_and_Mideast_crude_premiums_soar_with_few_options_for_buyers-TR20220217nL4N2US219X1", "country": "AE", "media": "https://www.zawya.com/images/cia/zAmp/210927123710JJJQ.jpg"}, {"id": "20cda5ab0e3e3bfdb5ba83ffba4b3446", "title": "MBRIF cohort member Hawa Water wins Spinneys 2021 Local Business Incubator Award", "summary": "Innovative approach eliminates reliance on existing water bodies to ensure sustainable and consistent access to drinking waterMBRIF supports Hawa Water innovative model through its accelerator program Dubai: Hawa Water, a Mohammed Bin Rashid Innovation Fund (MBRIF) accelerator program member, announced that it has won the Spinneys 2021 Local Business Incubator award for their premium drinking water. As one of the winning local F&B producers, hawa® water is introducing new glass bottles, which are now available at Spinneys stores in the UAE.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.zawya.com/mena/en/press-releases/story/MBRIF_cohort_member_Hawa_Water_wins_Spinneys_2021_Local_Business_Incubator_Award-ZAWYA20220217105549", "country": "AE", "media": "https://www.zawya.com/pr/images/2022/FPR_3656_2022_02_17.jpg"}, {"id": "bdcc8684854256a306664912d76efd8c", "title": "Oil falls, caught between Iran talks and Ukraine crisis", "summary": "Oil prices fell on Thursday as talks to resurrect a nuclear deal with Iran entered their final stages, but losses were capped by heightened tensions between top energy exporter Russia and the West over Ukraine.Brent crude traded down $1.26, or 1.3%, at $93.55 a barrel by 0914 GMT. U.S. West Texas Intermediate (WTI) crude was down $1.34, or 1.4%, at $92.32.Both contracts fell more than 2% earlier in the session.\"(The) oil market is locked in a tug of war between Iranian sanctions relief and Russian-Ukraine tensions,\" said Stephen Brennock at brokerage PVM Oil.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.zawya.com/mena/en/markets/story/Oil_falls_caught_between_Iran_talks_and_Ukraine_crisis-TR20220217nL4N2US0D4X1", "country": "AE", "media": "https://www.zawya.com/images/cia/zAmp/200610082028PJJN.jpg"}], "total": 6}, "GB": {"articles": [{"id": "058354118cea36147c3daaa833d6c7fc", "title": "New partner joins leading Cumbrian law firm", "summary": "Naren Deen joins Baines Wilson \nA new partner has joined leading Cumbrian law firm Baines Wilson. \nIt has appointed Naren Deen to the commercial property team. \nNaren said: 'I have connections with Cumbria. I really like the area and my wife runs a local business so I've been looking to relocate.\n'Baines Wilson gave me a fantastic opportunity to take on quality, interesting work that I enjoy doing close to home.'\nNaren began his legal career in London, working on acquisitions and portfolio management for a property fund that invested in shopping centres and offices.", "topics": "business", "published_date": "2022-02-17 11:45:00", "link": "https://cumbriacrack.com/2022/02/17/new-partner-joins-leading-cumbrian-law-firm", "country": "GB", "media": "https://cumbriacrack.com/wp-content/uploads/2022/02/Baines-Wilson.jpg"}, {"id": "d1d65ce4ab0f394ad5d9184e2e71b976", "title": "Three cancer red flags you can spot when you wake up according to pharmacist", "summary": "Something went wrong, please try again later.\n\nSign up to our newsletter for daily updates and breaking news delivered direct to your inbox\n\nA pharmacist has warned there are cancer red flags you may spot first thing in the morning that you should never ignore.\n\nThe key to the best outcome for many types of cancer is spotting the symptoms early and getting medical help.\n\nAccording to Abbas Kanani, pharmacist at Chemist Click, some of the signs can be spotted when you wake up - and you should take action.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.getreading.co.uk/news/uk-world-news/three-cancer-red-flags-you-23124304", "country": "GB", "media": "https://i2-prod.walesonline.co.uk/news/uk-news/article23124302.ece/ALTERNATES/s1200/0_pexels-kampus-production-7556586.jpg"}, {"id": "d0a8a4daae3f506ab543aaa256b56235", "title": "Primer On Carbon Markets", "summary": "In the last five years, awareness on the negative and adverse impacts on climate change via excessive carbon emissions have gained significant traction in line with the acceptance and popularity on sustainability investing in the financial markets; ESG (Environmental, Social and Governance) where carbon emissions come under the 'E' category of ESG. In addition, the heightened regulatory push seen in the past year for corporations to accept and embrace ESG principles has been reinforced by the influence of the current progressive Democrats in the US Congress.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.cmcmarkets.com/en-nz/news-and-analysis/primer-on-carbon-markets", "country": "GB", "media": "https://assets.cmcmarkets.com/images/RBC-CarbonPricing_medium.jpg"}, {"id": "9343969afa8fa682c81c5b648451caec", "title": "Mum uses doorbells in kitchen cupboard to communicate with her kids", "summary": "We have more newsletters\n\nThank you for subscribing!\n\nSomething went wrong, please try again later.\n\nSign up to our newsletter for daily updates and breaking news delivered direct to your inbox\n\nA mum has shared her 'genius' hack to call her kids for dinner without shouting - by installing doorbells inside her kitchen linked to speakers in their bedrooms.\n\nLaura Cuniff, 30, shared the insight on her social media account @inside_our_riverside.\n\nInstead of calling her children down for dinner, she has installed doorbells inside her kitchen cupboard with each linked to a speaker in their bedrooms.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.getreading.co.uk/news/uk-world-news/mum-uses-doorbells-kitchen-cupboard-23126893", "country": "GB", "media": "https://i2-prod.walesonline.co.uk/news/uk-news/article23126879.ece/ALTERNATES/s1200/1_ding-dong-a-mum-793277.jpg"}, {"id": "3c0e1447d426ba95ec0c94215696ee8e", "title": "New look for Low Wood Bay Resort's restaurant", "summary": "Craig Harrison and Sam Rees, Low Wood Bay Resort & Spa \nA Lake District spa resort has marked the reopening of its refurbished restaurant with a new head chef.\nThe W, at Low Wood Bay Resort and Spa at Windermere has undergone a major revamp and at the helm will be Sam Rees. \nSam has moved from the resort's sister restaurant Blue Smoke on the Bay to work with a team of 18. \nSam said: 'The W offers diners an array of new signature dishes including fillet of beef Wellington, starter classics such as CoquillesSt Jacques, and of course the famous Low Wood Bay sticky toffee pudding.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://cumbriacrack.com/2022/02/17/new-look-for-low-wood-bay-resorts-restaurant", "country": "GB", "media": "https://cumbriacrack.com/wp-content/uploads/2022/02/Craig-Harrison-and-Sam-Rees.jpg"}, {"id": "e684e30ac6f65d41dcbed4c10de08b24", "title": "Whitehaven students have walk on the wild side", "summary": "The Whitehaven Academy students with Soo Redshaw and Holly Burns, of British Exploring Society.\nStudents at The Whitehaven Academy had a wild time getting a taste for overseas adventure.\nThe school linked up with British Exploring Society for a workshop that introduces young people to the idea of striking out on an adventure and developing key life skills.\nThe youth development charity, which this year celebrates its 90th birthday, specialises in leading expeditions to some of the wildest and most remote destinations in the world, including the Namibian desert, Indian Himalayas and Amazon rainforest.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://cumbriacrack.com/2022/02/17/whitehaven-students-have-walk-on-the-wild-side", "country": "GB", "media": "https://cumbriacrack.com/wp-content/uploads/2022/02/British-Exploring-Society-1.jpeg"}, {"id": "27ee02f09d9425e8b807015d5e980bd6", "title": "Nvidia and Jaguar Land Rover sign partnership agreement", "summary": "Jaguar Land Rover has signed a multi-year strategic partnership agreement with NVIDIA to jointly develop and deliver next-generation automated driving systems plus AI-enabled services and experiences for its customers. Starting in 2025, all new Jaguar and Land Rover vehicles will be built on the NVIDIA DRIVE software-defined platform, that is capable of delivering a wide spectrum of active safety, automated driving and parking systems as well as driver assistance systems. Inside the vehicle, the system will deliver AI features, including driver and occupant monitoring, as well as advanced visualisation of the vehicle's environment.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.newelectronics.co.uk/articles/nvidia-and-jaguar-land-rover-sign-partnership-agreement", "country": "GB", "media": "https://www.newelectronics.co.uk/media/t4ipvpky/nvidia-orin.jpg"}, {"id": "8559903a8f87ecd30f6674a3d995fce6", "title": "Red Alert: Met Office issues highest level of warning for Storm Eunice", "summary": "The video will auto-play soon 8 Cancel\n\nWe have more newsletters\n\nThank you for subscribing!\n\nSomething went wrong, please try again later.\n\nSign up to our newsletter for daily updates and breaking news delivered direct to your inbox\n\nThe Met Office has issued a Red Warning for Storm Eunice, coming into force at 7am on Friday.\n\nStorm Eunice will cause significant disruption and dangerous conditions due to extremely strong winds on Friday - with a five hour red warning across a swathe of the country.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.getreading.co.uk/news/uk-world-news/red-alert-met-office-issues-23127084", "country": "GB", "media": "https://i2-prod.walesonline.co.uk/news/uk-news/article23127099.ece/ALTERNATES/s1200/1_weatheraPNG.png"}, {"id": "ff96dce6ccf3cbde2859d3f8b80037c9", "title": "Tickle your funny bone at Brewery Arts' Comedy Club", "summary": "Welcome back to another of Brewery Arts' highly successful stand-up comedy clubs!\nMarch's comedy line-up contains lashings of Jonathan Mayor, Lloyd Griffith, Chris Kehoe and Lindsay Santoro!\nGrab a pizza before the comedy begins! Place your order at our foyer bar or upstairs in the main bar. \nTell us what you would like along with your table number and we will deliver it directly to your table. \nPizza orders must be made before 7.40pm on the night!\n To book your tickets, click here: https://www.breweryarts.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://cumbriacrack.com/2022/02/17/tickle-your-funny-bone-at-brewery-arts-comedy-club", "country": "GB", "media": "https://cumbriacrack.com/wp-content/uploads/2022/02/March-Comedy-Club-crop.jpg"}, {"id": "245b2a9bd3ef8ff95b8675d23d6171f5", "title": "Size-reduced MOSFET gate driver", "summary": "Toshiba Electronics Europe has introduced a MOSFET gate driver IC, the TCK421G that controls the gate voltage of external N-channel MOSFETs based upon the input voltage.\n\nThe MOSFET gate driver is suitable for configuring a power multiplexer or a load switch circuit equipped with reverse-current blocking by being combined with a back-to-back connection of external N-channel MOSFETs.\n\n\n\nThe TCK421G incorporates a charge pump circuit that supports a wide range of input voltages (VIN) from 2.7 to 28.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.newelectronics.co.uk/content/product-launches/size-reduced-mosfet-gate-driver", "country": "GB", "media": "https://www.newelectronics.co.uk/media/ykeie0aa/7377_lr.jpg"}, {"id": "e1e2eb1610f7d80d8514fbdf04e727ef", "title": "Thug slashed woman's throat because she 'messed up' Euro 2020 recordings", "summary": "Something went wrong, please try again later.\n\nSign up to our newsletter for daily updates and breaking news delivered direct to your inbox\n\nA thug slashed a woman's throat because she 'messed up' his TV recordings of Euro 2020.\n\nAlcoholic Ian Hensworth, 63, flew into a rage and attacked Linsey Perry with a craft knife in front of their horrified friends.\n\nHe accused her of breaking his Digibox, which he had used to record the Euro 2020 football matches on TV.\n\nMrs Perry, 41, was rushed to hospital in a critical condition and survived the attack, but suffered horrific injuries.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.getreading.co.uk/news/uk-world-news/thug-slashed-womans-throat-because-23127059", "country": "GB", "media": "https://i2-prod.birminghammail.co.uk/incoming/article23127017.ece/ALTERNATES/s1200/0_football-thug-a-793363.jpg"}, {"id": "62ace69b387bacbb79b324e5df9edc7f", "title": "Hugs in mug for Kendal townsfolk to combat loneliness", "summary": "Hug in a Mug with Herdy and Kendal neighbourhood chaplains\nPeople in Kendal can nominate someone for a hug in a mug, thanks to a local church and businesses. \nThe neighbourhood chaplains of Gateway Church have been putting together the gifts after donations from Herdy and Farrer's Tea and Coffee Merchants. \n Herdy gave 400 branded mugs to the project and the seven volunteer chaplains have filled them with goodies including hot chocolate, tea and coffee, Kendal mint cake, biscuits and chocolates.\nGateway Church's community connector, the Rev Jonny Gios, said: 'We are aware even before the COVID pandemic started that loneliness and isolation was a huge challenge in our community.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://cumbriacrack.com/2022/02/17/hugs-in-mug-for-kendal-townsfolk-to-combat-loneliness", "country": "GB", "media": "https://cumbriacrack.com/wp-content/uploads/2022/02/hug-2.jpg"}, {"id": "7c9a5006ad3ad091de5617dc88636d2c", "title": "World Pangolin Day 2022 – it's time to pile on more pressure for better pangolin protection", "summary": "As a child growing up in Malaysia in the early 2000s, I listened in wonderment as my mother told me how she had encountered at least one wild pangolin every month in the 1970s. \nShe relayed a particular occasion when a friend phoned her to describe an odd, scaly, rolled-up creature sleeping in the drain outside their home in what is now a heavily urbanised area. Her response was simply 'It's a pangolin, just leave it be'.\nFast-forward to 2020, I began working on pangolin conservation and trade issues at the first wildlife K9 unit in Malaysia.", "topics": "world", "published_date": "2022-02-17 11:45:00", "link": "https://eia-international.org/blog/world-pangolin-day-2022-its-time-to-pile-on-more-pressure-for-better-pangolin-protection", "country": "GB", "media": "https://eia-international.org/wp-content/uploads/pangolin-button02.jpg"}, {"id": "4455078857f4ad86065c7376d76caa05", "title": "Action group set up to tackle parking problems in Lake District village", "summary": "traffic in Lake District \nAn action group has been set up to tackle parking around a village near Keswick. \nAround 30 people from Portinscale have set up the group to look at vehicle numbers, on-road parking and road safety in and around Portinscale and on the west of Derwentwater. \nThe Derwent Safe and Sustainable Traffic Action Group will be holding its first public meeting at 7pm on February 24 in Portinscale Village Hall to explain its aims and encourage other people to get involved.\nThey say they have set up the group because in recent years, there has been a surge in visitor numbers to Portinscale.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://cumbriacrack.com/2022/02/17/action-group-set-up-to-tackle-parking-problems-in-lake-district-village", "country": "GB", "media": "https://cumbriacrack.com/wp-content/uploads/2022/02/tailbacks.jpg"}, {"id": "4d432a72284cb61fe4aec02bfc0f81fc", "title": "Former Barrow favourite Paddy Lacey signs for Warrington Rylands", "summary": "Paddy Lacey\nWarrington Rylands, chasing Workington for the NPL West title and promotion, have signed former Barrow favourite Paddy Lacey.\nThe tenacious mid-fielder – who has also stepped into the ring for a fledgling professional boxing career – has joined ambitious Rylands from Chester.\nLacey, 28, has reshaped his life after a short spell in prison following a visit to the Glastonbury Festival when he was found with drugs and counterfeit notes.\nWhen he was released from prison he turned to boxing and has also revived his football career which had temporarily stalled.", "topics": "sport", "published_date": "2022-02-17 11:45:00", "link": "https://cumbriacrack.com/2022/02/17/former-barrow-favourite-paddy-lacey-signs-for-warrington-rylands", "country": "GB", "media": "https://cumbriacrack.com/wp-content/uploads/2022/02/Paddy-Lacey.jpg"}, {"id": "0219858b971c416da78951e2174fd6ba", "title": "Universities act to address student mental health issues", "summary": "KENYA\r Kenya News Agency  17 February 2022 Kenya's University of Nairobi has resolved to start hiring its needy students for contractual jobs as a way of reducing depression brought about by financial challenges at the institution, writes Muoki Charles for Kenya News Agency. Vice-Chancellor Professor Stephen Kiama said the dean of students and the career office have been charged to identify deserving students to be given the jobs, while still undertaking their studies. He said empowering their students with jobs that they can do for a small amount of money made more sense than giving the jobs to outsiders.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.universityworldnews.com/post.php?story=20220217064315674", "country": "GB", "media": "https://www.universityworldnews.com/images/uwn-ball-320.png"}], "total": 16}, "CA": {"articles": [{"id": "fdde285b151122f69129a804a823e3ba", "title": "St. John's Man Charged with Murder to Make Court Appearance", "summary": "A St. John's man charged with murder in the death of a woman two days after Christmas returns to court today.\n20-year-old David Quirke faces a single charge of second-degree murder in the death of 42-year-old Rayna Dove.\nEarly on December 27, police were called to a home on Cookstown Road where they found Quirke and the victim, who had reportedly been stabbed.\nShe died at the scene.\nQuirke has been in custody at the Bishop's Falls correctional centre since then.\nHe was scheduled to apply for judicial interim release, or bail, last week, but the matter did not proceed.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://vocm.com/2022/02/17/st-johns-man-charged-with-murder-to-make-court-appearance", "country": "CA", "media": "https://media.socastsrm.com/wordpress/wp-content/blogs.dir/900/files/2021/12/rnc-cookstown-road.jpg"}, {"id": "6cb3b02616928482821afab77b2e279b", "title": "Author Jim Hendleman's New Book, ‘The Civil War That Destroyed the World's Greatest Ever Civilization' is an Epic Trilogy Conclusion", "summary": "Recent release \"The Civil War That Destroyed The World's Greatest Ever Civilization\" from Covenant Books author Jim Hendleman is a compelling tale of ancient societies as well as what led to the conclusion and demise of their great civilization.\n \n FARMINGTON, Utah – February 17, 2022 – (Newswire.com)\n\nJim Hendleman, a talented author has completed his new book, 'The Civil War That Destroyed The World's Greatest Ever Civilization': a gripping tale of ancient civilizations.\nHendleman shares, 'This book concludes my trilogy of the Jaredite civilization and enumerates some of their many achievements and accomplishments.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.digitaljournal.com/pr/author-jim-hendlemans-new-book-the-civil-war-that-destroyed-the-worlds-greatest-ever-civilization-is-an-epic-trilogy-conclusion", "country": "CA", "media": "https://cdn.newswire.com/files/x/76/b9/0b6766dff84e85ce1391f6107fc4.jpg"}], "total": 2}, "IE": {"articles": [{"id": "28af410705027469e2fdb9102db4159c", "title": "Former member says Garda Reserve should be used much more", "summary": "Garda management should be using the Garda Reserve more, particularly at community level.\n\nThat's according to a former member of the Reserve, who spoke to Greg Hughes on the Nine til Noon Show today following calls yesterday from Cllr Albert Doherty for more gardai to address antisocial behaviour in Carndonagh.\n\nDonal, who had to retire from the Reserve two years ago because of his age, says the numbers fell by more than 50% during his time with the service, and he can't understand why the Commissioner and senior officers aren't doing more to use this resource………….", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://highlandradio.com/2022/02/17/former-member-says-garda-reserve-should-be-used-much-more", "country": "IE", "media": "https://highlandradio.com/wp-content/uploads/2018/02/garda-reserve.jpg"}], "total": 1}, "TV": {"articles": [{"id": "da86149acde9ef2cd8a035abc8725ba5", "title": "Legislation on WACOG to ensure national energy security: Hammad", "summary": "ISLAMABAD (APP) - Minister for Energy Hammad Azhar Thursday termed passing of Weighted Average Cost of Gas (WACOG)-Bill by Senate a ‘historic and long-pending reform' that would help ensure energy security in the country.\n\n'We are now able to embark upon the reform of the gas pricing structure, remove anomalies and enhance supplies of imported gas,' the minister tweeted after the passage of the bill from the Upper House of the Parliament.\n\n'This reform is as significant as the approval of the IGCEP [Indicative Generation Capacity Expansion Plan] model for power purchase [granted] a couple of months ago,' he said.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://dunyanews.tv/en/Pakistan/641684-Legislation-on-WACOG-to-ensure-national-energy-security-Hammad", "country": "TV", "media": "https://img.dunyanews.tv/news/2022/February/02-17-22/news_big_images/641684_36671386.jpg"}, {"id": "b3686a8f9cf5ed19d6722957ef727471", "title": "Macron says 'hidden aims' of junta forced Mali pullout", "summary": "PARIS (AFP) - French President Emmanuel Macron on Thursday said the attitudes of Mali s ruling junta had forced France to pull out and denied that its almost decade-long deployment had ended in failure.\n\n\"We cannot remain militarily engaged alongside de-facto authorities whose strategy and hidden aims we do not share,\" Macron told reporters, adding he \"completely\" rejected the idea that France had failed in its former colony.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://dunyanews.tv/en/World/641679-Macron-hidden-aims-junta-forced-Mali-pullout", "country": "TV", "media": "https://img.dunyanews.tv/news/2022/February/02-17-22/news_big_images/641679_16940300.jpg"}, {"id": "15ed795f677fe3fc159acb57b867fe85", "title": "Shehbaz Sharif to be charged for his corruption soon: Farrukh Habib", "summary": "Farrukh Habib said that Shehbaz Sharif is going to be charged for his corruption very soon.\n\nMANDI BAHAUDDIN (Dunya News) - Pakistan Tehreek-e-Insaf (PTI) Minister of State for Information and Broadcasting Farrukh Habib said that Opposition Leader in National Assembly (NA) Shehbaz Sharif is going to be charged for his corruption very soon.\n\nWhile talking to the media in Mandi Bahauddin, the PTI leader said that opposition is a group of blackmailers and PML-N holds special top position in forgery.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://dunyanews.tv/en/Pakistan/641686-Shehbaz-Sharif-to-be-charged-for-his-corruption-soon-Farrukh-Habib", "country": "TV", "media": "https://img.dunyanews.tv/news/2022/February/02-17-22/news_big_images/641686_26284885.jpg"}], "total": 3}, "IR": {"articles": [{"id": "4bd934f8d0119627118e6dd3f51ac45f", "title": "IPL: Tehran Derby Date Revealed", "summary": "The organization released the fixture of the Iran Professional League (IPL) Matchweek 23, in which the Iranian popular football teams will meet each other on March 17 in Tehran's Azadi Stadium.Esteghlal and Persepolis sit first and second place of the 2021-22 season respectively.Esteghlal and Persepolis have played each other 97 times with Esteghlal narrowly leading the encounters by 26 wins to 25 with 46 draws.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.tasnimnews.com/en/news/2022/02/17/2664157/ipl-tehran-derby-date-revealed", "country": "IR", "media": "https://www.tasnimnews.com/Static/img/tasnim-main-logo.jpg"}], "total": 1}, "ZW": {"articles": [{"id": "d171e112b44b554c23f2324810285174", "title": "Gwanda Women Overcomes Tragedy to Find Resilience and Success", "summary": "Gender stereotypes and roles have hindered women's potential as leaders, with the assumption of leadership roles by women often contested.\n\nIt has not been an easy journey for Nobusa Mabusa (24) as she narrates a story of how she found resilience and success despite her troubled childhood. Mabusa says she had an ambitious dream to defy all odds, and succeed from a tender age.\n\nGrowing up with esoteric parents, denied formal education, impregnated at 13 and suffering emotional abuse coupled with early motherhood stresses almost consumed her.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://kubatana.net/2022/02/16/gwanda-women-overcomes-tragedy-to-find-resilience-and-success", "country": "ZW", "media": "https://kubatana.net/wp-content/uploads/2021/11/Read-more-1200-x-630-px.png"}], "total": 1}, "VN": {"articles": [{"id": "34c5887855e080466802a724a4a22e7d", "title": "More casino projects in Da Nang, Khanh Hoa in the pipeline", "summary": "Da Nang and Khanh Hoa have received support for their casino projects, but Binh Thuan has no support from the Ministry of Finance (MOF).\n\nMOF's latest report on casino business found that many localities and businesses want to develop new casinos. After considering the proposals, the ministry has asked the PM to allow the development of two projects.\n\nOne of them is located in a tourism site in Da Nang. The city in the central region now has one small casino – Silver Stores. It has been operating effectively with revenue from the casino business and payment to the state budget ranked third among casinos, after Ho Tram and Phu Quoc, the largest ones.", "topics": "business", "published_date": "2022-02-17 11:45:00", "link": "https://vietnamnet.vn/en/business/more-casino-projects-in-da-nang-khanh-hoa-in-the-pipeline-816308.html", "country": "VN", "media": "https://vnn-imgs-f.vgcloud.vn/2022/02/17/15/more-casino-projects-in-da-nang-khanh-hoa-in-the-pipeline.jpg"}, {"id": "ae14b3d59bb3411b0f1e34f1c6ef66a3", "title": "Suspect who threatened to shoot down Vietnam Airlines plane arrested", "summary": "According to the police, they were able to trace the phone number which made the threat and subsequently arrested the boy, with the suspect later admitting to making the phone call. Police said the boy suffers from a mental disability. This comes following the Vietnam Airlines branch office in Japan receiving a call one morning in January from a man who claimed he was an American, despites peaking in a Japanese accent, threatening to shoot down the plane passing Tokyo Bay if it did not head back to Narita.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://english.vov.vn/en/society/suspect-who-threatens-to-shoot-down-vietnam-airlines-plane-arrested-post924840.vov", "country": "VN", "media": "https://media.vov.vn/sites/default/files/styles/og_image_en/public/2022-02/mb32.jpg?v=1645095607"}], "total": 2}, "BD": {"articles": [{"id": "21ca1fe9627719d03c4bbeb1f5dd5d2e", "title": "1,904 more Rohingyas reach Bhasan Char from Ctg", "summary": "File Photo\n\nCHATTOGRAM, Feb 17, 2022 (BSS)-Another 1,904 more Rohingyas reached Bhasan\n\nChar from the city's Patenga Boat Club in the ninth phase on Thursday under\n\nthe supervision of Bangladesh Navy.\n\nThey arrived at the Bhasan Char after 24 hours after the 9th batch of\n\nRohingyas reached there as a part of their relocation, sources said.\n\nEarlier, they reached Patenga from Cox's Bazar's Ukhiya Balukhali camp and\n\nleft for Bhasan Char with the help of five naval ships around 9.20 am today\n\nafter an overnight stay at a temporary transit camp of BAF Shaheen College.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.bssnews.net/news/45241", "country": "BD", "media": "https://www.bssnews.net/assets/news_photos/2022/02/17/image-45241-1645096931.jpg"}, {"id": "6747ad31fdf4607bcb536903678de9c9", "title": "Covid-19: Bangladesh records 20 deaths, 3,539 infections in 24hrs", "summary": "Bangladesh registered 20 more deaths from coronavirus or Covid-19 in the last 24 hours.\n\nBesides, the country recorded 3,539 new infections during the period.\n\nOn the other hand, Bangladesh witnessed 19 lakh 26 thousand 570 infections so far.\n\nThe health bulletin of the Directorate General of Health Services (DGHS) revealed the information on Thursday (Feb 17).", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.daily-sun.com/post/605918/Covid19:-Bangladesh-records-20-deaths-3539-infections-in-24hrs", "country": "BD", "media": "https://www.daily-sun.com/assets/news_images/2022/02/17/Corona-ds.jpg"}], "total": 2}, "GH": {"articles": [{"id": "ba8f45a978f15efae81c21a1f6c0f2ac", "title": "Mentorship programme for Archbishop Porter Girls SHS", "summary": "", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.graphic.com.gh/news/general-news/mentorship-programme-for-archbishop-porter-girls-shs.html", "country": "GH", "media": "https://www.graphic.com.gh/images/2022/feb/17/Mentorship.jpg"}], "total": 1}, "RO": {"articles": [{"id": "1e6ef31d1ae7e64f079c505b50c1e4ea", "title": "Financial statements of the ECB for 2021", "summary": "17 February 2022 ECB profit €0.2 billion (2020: €1.6 billion) after €0.6 billion transfer to provision for financial risks Profit distributed to euro area national central banks Net interest income on securities held for monetary policy purposes €1.0 billion (2020: €1.3 billion) ECB's Balance Sheet grows to €680 billion (2020: €569 billion) The European Central Bank's (ECB's) audited financial statements for 2021 show that profit for the year was €192 million (2020: €1,643 million). The €1,452 million decrease compared to the previous year was mainly due to lower income from foreign reserve assets and from securities held for monetary policy purposes, as well as a transfer to the provision for financial risks.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.ecb.europa.eu//press/pr/date/2022/html/ecb.pr220217~28ffc75d4c.en.html", "country": "RO", "media": "https://www.ecb.europa.eu/press/shared/img/socialmedia/social-default.jpg?0ef1632c35edede913681bb76af694a4"}, {"id": "73c9ea53b2659d72a5a717ca51bf9830", "title": "Consolidated balance sheet of the Eurosystem as at 31 December 2021", "summary": "(EUR millions)\n\nNotes: Based on provisional unaudited data. The annual accounts of all the Eurosystem national central banks will be finalised by the end of May 2022, and the final annual consolidated balance sheet of the Eurosystem will be published thereafter.\n\nTotals/sub-totals may not add up due to rounding.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.ecb.europa.eu/pub/annual/balance/html/ecb.eurosystembalancesheet2021~f9edd2ff57.en.html", "country": "RO", "media": "https://www.ecb.europa.eu/pub/shared/img/socialmedia/social-default.jpg?3136c21846b77fd118cdbb98079cd548"}], "total": 2}, "RU": {"articles": [{"id": "24bc3128eefcb7f2222b3ec84650b26c", "title": "US accuses China of harming global trade", "summary": "Washington claims Chinese state-led economy hurting workers and firms worldwideThe Office of the US Trade Representative has once again accused China of failing to meet its commitments to the World Trade Organization (WTO), saying that Beijing is repeatedly exploring new ways to implement aggressive trade practices.According to US Trade Representative Katherine Tai, China refuses to live up to its commitments under the phase-one trade deal, which, according to her, would \"provide a solid foundation for future bilateral engagement.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.rt.com/business/549647-china-us-wto-harm-trade/?utm_source=rss&utm_medium=rss&utm_campaign=RSS", "country": "RU", "media": "https://cdn.bignewsnetwork.com/rtc1645092733.jpg"}, {"id": "088a69fc7d43bb7b408e93500c50ac77", "title": "Russian Olympic chief rejects Valieva decision", "summary": "The Russian Olympic Committee (ROC) issued a strong message as figure skater Kamila Valieva goes for goldRussian Olympic Committee (ROC) president Stanislav Pozdnyakov has said the organization \"categorically disagrees\" with the decision to recognize figure skater Kamila Valieva's results in Beijing as only provisional.Valieva is in the middle of an investigation after returning a positive doping sample from December, which was only reported after she had helped the ROC to gold in the team event in Beijing.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.rt.com/sport/549656-roc-rejects-valieva-provisional-result/?utm_source=rss&utm_medium=rss&utm_campaign=RSS", "country": "RU", "media": "https://cdn.bignewsnetwork.com/rtc1645092737.jpg"}], "total": 2}, "CN": {"articles": [{"id": "554a351d5820055f19fd57098a4b2eac", "title": "China to raise prices of gasoline, diesel", "summary": "BEIJING, Feb. 17 (Xinhua) -- China will raise the retail prices of gasoline and diesel from Friday, the country's top economic planner said on Thursday. The price of gasoline will increase by 210 yuan (about 33.16 U.S. dollars) per tonne, and the price of diesel will increase by 200 yuan, according to the National Development and Reform Commission. Under the current pricing mechanism, when international crude oil prices change by more than 50 yuan per tonne and remain at that level for 10 working days, the prices of refined oil products such as gasoline and diesel in China are adjusted accordingly.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "http://www.news.cn/english/20220217/219a106b4cb94210a82f539d09e6cd38/c.html", "country": "CN", "media": null}], "total": 1}, "KR": {"articles": [{"id": "a94fd1206489fbd76a99d699ca4f96fe", "title": "S. Korea's national debt-to-GDP ratio rising faster than other developed countries: KERINews", "summary": "arirang * All Arirang Programs are Sponsored by the Communications Development Fund of Korea Communications Commission.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "http://www.arirang.co.kr/news/News_View.asp?nseq=293642", "country": "KR", "media": "http://www.arirang.com/arirang_blue.png"}], "total": 1}, "AU": {"articles": [{"id": "325509cfdab7187875ffc5ce17cd9b5a", "title": "NRL Fantasy analysis: Dragons", "summary": "National Rugby League respects and honours the Traditional Custodians of the land and pay our respects to their Elders past, present and future. We acknowledge the stories, traditions and living cultures of Aboriginal and Torres Strait Islander peoples on the lands we meet, gather and play on.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.nrl.com/news/2022/02/17/nrl-fantasy-analysis-dragons", "country": "AU", "media": "https://www.nrl.com/remote.axd?https://flex.nrl.ooflex.net/keyframedownloadcontroller?id=393501&max_height=1920&max_width=1920?center=0.231%2C0.514&preset=share"}], "total": 1}, "FR": {"articles": [{"id": "73ad4d429a92fdef3fe84a10251f2a72", "title": "New life for Tigers held in train carriage in Argentina as they head to South Africa", "summary": "Bengal tigers abandoned 15 years ago by a travelling circus, who have since been living in a rail car in San Luis, Argentina are finally being rescued by Four Paws International.The global animal welfare organization announced it has reached an agreement with local authorities to take them to a sanctuary in South Africa in the coming weeks. \n \n\n © AP / Africanews \n\nTwo of the animals were abandoned by a traveling circus in a 75-square-meter (about 800-square foot) train car and fed by a local rancher since 2007.", "topics": "news", "published_date": "2022-02-17 11:45:00", "link": "https://www.africanews.com/2022/02/17/new-life-for-tigers-held-in-train-carriage-in-argentina-as-they-head-to-south-africa/?utm_source=microsoft&utm_campaign=feeds_news&utm_medium=referral", "country": "FR", "media": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AATYPDW.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg&x=387&y=274"}], "total": 1}}, "last_fetched": "02/17/2022, 17:15:35"}